{"conference_events":{"version":"BAD NETWORK/FIREWALL","events":[{"id":8428,"guid":"b1a28d62-75e9-48de-bec9-44df4e611685","title":"33C3 Closing Ceremony","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-30T18:30:00.000+01:00","end_time":"2016-12-30T19:00:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"","speakers":[{"id":4984,"image":"/system/people/avatars/000/004/984/large/Nicolas_W%C3%B6hrl.jpg?1443528875","full_public_name":"Nicolas Wöhrl","abstract":"Physicist, working in the field of nanotechnology. Science communicator with his podcast „methodisch inkorrekt“. \r\n\r\nIn love with science!","description":"Profession: Dr. Nicolas Wöhrl is a physicist. He joint the Center of Nanointegration (CENIDE) at the University of Duisburg-Essen where he is working at the Nano Energy Technology Center (NETZ). NETZ is an application-focused research project. The aim of the project is to develop materials and also processes which allow nanotechnology to be used in industry – especially focused on energy applications.\r\n\r\nPassion: Nicolas is a science communicator. He participated in numerous events where current research was presented and explained to the public including science-slams and experimental shows for kids. He is also the founder of the popular scientific podcast „methodisch inkorrekt“ where he is biweekly presenting science news for everybody.\r\n\r\nBelieve: Nicolas believes in science and education and he wants to get the society more involved in the wonders of science. He believes that the scientists themselves have the responsibility to bring back the science to the masses.","links":[{"url":"http://www.methodisch-inkorrekt.de","title":"Podcast"}]},{"id":6387,"image":"/system/people/avatars/000/006/387/large/pui4X9Or-2.jpg?1479383433","full_public_name":"@ReinhardRemfort","abstract":"Für eine flächendeckende Nutellagrundversorgung und die Anerkennung des Löffels als geeignetes Konsumwerkzeug!","description":"Ich wurde in den frühen Morgenstunden des 1. November 1982 im Universitätsklinikum in Essen geboren. 21 Jahre später bin ich dann nach dem Besuch eines katholischen Kindergartens, eines katholischen Gymnasiums wieder an der Uni Essen gelandet, diesmal aber in den Naturwissenschaften. Hier beschäftige ich mich seit meiner Diplomarbeit mit der Erzeugung synthetischer Diamanten und mit zunehmender Begeisterung damit, das beschissene Image der Physik aufzupolieren. Das mache ich im Rahmen von ScienceSlams (deutscher Meister 2013), dem alle zwei Wochen erscheinenden Podcast „methodisch inkorrekt!“, dem Blog Schrödingers Kotze, Experimentiervorträgen für Kinder und Erwachsene, kleineren Moderationen im Fernsehen, der Teilnahme an Fachkonferenzen zur Wissenschaftskommunikation und dem Schreiben eines kleinen Buches bei Ullstein.","links":[{"url":"http://www.minkorrekt.de","title":"Methodisch inkorrekt!"}]}]},{"id":8243,"guid":"b598ebbf-0fc6-4127-bb9d-20ae18f1171d","title":"33C3 Infrastructure Review","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-30T16:00:00.000+01:00","end_time":"2016-12-30T17:00:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"NOC, POC, VOC and QOC show interesting facts and figures as an excuse to present all the mischief they’ve been up to this year.","speakers":[{"id":2042,"image":"/system/people/avatars/000/002/042/large/1922.png?1360200676","full_public_name":"Leon","abstract":"","description":"","links":[]}]},{"id":8429,"guid":"b8e0eb47-4832-4726-bc9b-9015bd96becf","title":"33C3 Opening Ceremony","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T11:00:00.000+01:00","end_time":"2016-12-27T11:30:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"","speakers":[{"id":5735,"image":null,"full_public_name":"anna","abstract":"Schreibt bei netzpolitik.org zu Datenschutz, Überwachung und allem möglichen, was die Öffentlichkeit nicht wissen soll, aber sollte.","description":"","links":[{"url":"https://netzpolitik.org/author/anna/","title":"anna bei netzpolitik.org"}]},{"id":7246,"image":null,"full_public_name":"elisa","abstract":"Arbeitet bei der Open Knowledge Foundation Deutschland in Projekten rund um offene Daten, F/OSS und Civic Tech. War in einem früheren Leben Archäologin.","description":"","links":[]}]},{"id":8117,"guid":"4745fbc3-87d4-41eb-8c82-2c1bb8a51beb","title":"3 Years After Snowden: Is Germany fighting State Surveillance?","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T17:15:00.000+01:00","end_time":"2016-12-28T18:15:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Germany has a good reputation for strong data protection. It also features the only parliamentary inquiry committee investigating the Snowden revelations. But what are actual results of parliamentary, journalistic and public engagement?","speakers":[{"id":5735,"image":null,"full_public_name":"anna","abstract":"Schreibt bei netzpolitik.org zu Datenschutz, Überwachung und allem möglichen, was die Öffentlichkeit nicht wissen soll, aber sollte.","description":"","links":[{"url":"https://netzpolitik.org/author/anna/","title":"anna bei netzpolitik.org"}]},{"id":5764,"image":"/system/people/avatars/000/005/764/large/gsUZvL1L.jpg?1475588232","full_public_name":"Andre Meister","abstract":"Andre ist Nerd und schreibt auf netzpolitik.org. Eigentlich zu allen netzpolitischen Themen, aber in letzter Zeit vorwiegend über Überwachung. Sein Hut war kurzzeitig bekannt für Landesverrat.","description":"","links":[{"url":"https://netzpolitik.org/author/andre","title":"Profil auf netzpolitik.org"}]}]},{"id":7999,"guid":"600ca67d-e18d-49d8-8e5d-08d5b38ec528","title":"A Data Point Walks Into a Bar","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T18:15:00.000+01:00","end_time":"2016-12-27T18:45:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"tl;dr: Mother Teresa said \"If I look at the mass I will never act. If I look at the one, I will.\" I'll present ways that make us act when looking at the mass.","speakers":[{"id":6895,"image":"/system/people/avatars/000/006/895/large/11295704_982354475122291_1856523409278933328_n.jpg?1474914933","full_public_name":"Lisa Charlotte Rost","abstract":"Lisa loves to design data visualizations, currently as a Knight-Mozilla OpenNews Fellow at the National Public Radio in Washington, DC. Meaning, she creates graphics for the NPR website, but also goes to conferences like this one and posts on her blog or on Twitter about data-viz related things. Back in Berlin she designed for/with OpenDataCity, SPIEGEL \u0026 Tagesspiegel, taught data viz at universities and organized the Data Viz Meetup. ","description":"","links":[{"url":"https://twitter.com/lisacrost","title":"Twitter"},{"url":"http://lisacharlotterost.de/","title":"Portfolio"}]}]},{"id":8062,"guid":"f32a1a13-b244-4a1d-a6cf-99c5e3bdad27","title":"A look into the Mobile Messaging Black Box","logo":"/system/events/logos/000/008/062/large/Untitled.png?1475144790","type":"lecture","do_not_record":false,"start_time":"2016-12-28T11:30:00.000+01:00","end_time":"2016-12-28T12:30:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Most of us use mobile messaging every day. We use certain apps that we chose for a number of factors, like our friends using it, good press, privacy promises, or simply their feature sets. This talk aims to enable more of us to reason about the privacy and security of messaging apps. We will try to present simple analogies translating abstract security and privacy expectations into concrete feature sets. We will illustrate these features using the the popular messaging app Threema. Our analysis of its protocol is based on our own reverse-engineering efforts and a re-implementation of the Threema protocol that we will release during the talk.","speakers":[{"id":6929,"image":null,"full_public_name":"Roland Schilling","abstract":"Roland Schilling holds a Dipl.-Ing. degree in Computer Science and Engineering from Hamburg University of Technology (TUHH) and has been working as a Ph.D. Student and Research Assistant in the institute of Security in Distributed\r\nApplications at TUHH for almost five years with a research focus on mobile communication security. During this time he has been teaching classes in software- and application security, as well as introductory security lectures.","description":"","links":[]},{"id":6936,"image":null,"full_public_name":"Frieder Steinmetz","abstract":"Student of Computer Science and Engineering with a strong interest in InfoSec.","description":"","links":[{"url":"www.tinkerfool.org","title":"Blog"}]}]},{"id":8407,"guid":"b5be9501-88f1-4d9f-a5aa-269c8ff22d37","title":"An Elevator to the Moon (and back)","logo":"/system/events/logos/000/008/407/large/space-elevator-square.jpg?1478019322","type":"lecture","do_not_record":false,"start_time":"2016-12-29T18:30:00.000+01:00","end_time":"2016-12-29T19:30:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"Why is it so hard to go to the Moon? The curse of Newtonian Mechanics and Tsiolkovsky's Rocket Equation force us to build huge rockets to achieve any meaningful activity on the Moon. There are two strategies to hack the laws of celestial mechanics: making fuel on the Moon and using cables to climb out of the gravity well. Here we focus on the latter, which is the Moon version of the famous space elevator. The difference to an Earth elevator is - anelevator to the Moon's surface is realistic with today's materials. In the talk an introduction to the general problem is given and a starting point for a discussion is given that can easily lead to a sustainable access to the Moon if there is demand to do so.\r\n","speakers":[{"id":7169,"image":"/system/people/avatars/000/007/169/large/markus-landgraf.jpg?1478019191","full_public_name":"Markus Landgraf","abstract":"Architecture Analyst at ESA/ESTEC","description":"Markus is a mission and architecture analyst for the European Space Agency. He has been involved in numerous space missions and is currently working at European Space Research and Technology Centre (ESTEC ) in La Hague. He is also actively blogging about space technology and is very much involved in the proceedings of space elevator technology.","links":[{"url":"http://blogs.esa.int/rocketscience/","title":"rocket science blog"}]}]},{"id":8163,"guid":"a1f43609-a446-41e7-9ac6-4db12bcb14c1","title":"A New Dark Age","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T17:15:00.000+01:00","end_time":"2016-12-29T18:15:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"James Bridle is a British writer and artist living in Greece. His work explores the impact of technology on society, law, geography, politics, and culture. His Drone Shadow installations have appeared on city streets worldwide, he has mapped deportation centres with CGI, designed new kinds of citizenship based on online behaviour. and used neural networks and satellite images to predict election results. A New Dark Age is an exploration of what we can no longer know about the world, and what we can do about it.\r\n\r\n","speakers":[{"id":7007,"image":null,"full_public_name":"James Bridle","abstract":"James Bridle is a British artist and writer based in Athens, Greece. His work can be found at http://booktwo.org/.","description":"James Bridle is a British artist and writer based in Athens, Greece. His artworks have been commissioned by galleries and institutions and exhibited worldwide and on the internet. His writing on literature, culture and networks has appeared in magazines and newspapers including Wired, Domus, Cabinet, the Atlantic, the New Statesman, the Guardian, the Observer and many others, in print and online. He lectures regularly at conferences, universities, and other events. His formulation of the New Aesthetic research project has spurred debate and creative work across multiple disciplines. His work can be found at http://booktwo.org.","links":[{"url":"http://booktwo.org","title":"James Bridle's Website"}]}]},{"id":8420,"guid":"450d2481-6606-40fe-ba8b-7117d4724155","title":"Anthropology for kids - What is privacy?","logo":"/system/events/logos/000/008/420/large/1___960.jpg?1482080320","type":"lecture","do_not_record":false,"start_time":"2016-12-27T16:45:00.000+01:00","end_time":"2016-12-27T17:15:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"I would like to present my project called Anthropology for kids and a specific book, that I am working on in the larger framework of this project.  \r\nThis book will look like an ordinary school notebook in which a teacher checks a student if the lesson had been learnt. But it is actually not! I gathered this collection of historical and anthropological notes, so that together with school kids we can think about how the very idea of privacy was developed in different countries and in different historical epochs. In ancient Babylon wealthy women were allowed to cover their faces and their bodies, but the poor ones were not. In the Soviet Union during Stalin times it was dangerous to tell a political joke even in the group of close friends. One of them may report a joke to the authorities. Punishment for a political joke could be a prison sentence. \r\nToday more or less all our online communication is watched or recorded by authorities.\r\nHow does our present relate to other times in history, how is the western notion of privacy related to the ideas in other cultures.","speakers":[{"id":7123,"image":"/system/people/avatars/000/007/123/large/14224734_10154444832323959_8221331878115640030_n.png?1476382892","full_public_name":"Nika Dubrovsky","abstract":"Nika Dubrovsky is an artists, publisher and a blogger. \r\nShe was born in USSR and currently live in Berlin. \r\nThe project that she is working on now called \"Anthropology for kids\" with the specific book:\r\n\"What is privacy?\"","description":"","links":[{"url":"http://nikadubrovsky.org/","title":"personal blog (in Russian)"},{"url":"a4kids.org","title":"anthropology for kids"}]}]},{"id":8026,"guid":"84ce6d72-3f4f-445b-801e-37f6a1331bed","title":"A Story of Discrimination and Unfairness","logo":"/system/events/logos/000/008/026/large/bias.jpg?1475005121","type":"lecture","do_not_record":false,"start_time":"2016-12-27T16:45:00.000+01:00","end_time":"2016-12-27T17:15:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"Artificial intelligence and machine learning are in a period of astounding growth. However, there are concerns that these technologies may be used, either with or without intention, to perpetuate the prejudice and unfairness that unfortunately characterizes many human institutions. We show for the first time that human-like semantic biases result from the application of standard machine learning to ordinary language—the same sort of language humans are exposed to every day. We replicate a spectrum of standard human biases as exposed by the Implicit Association Test and other well-known psychological studies. We replicate these using a widely used, purely statistical machine-learning model—namely, the GloVe word embedding—trained on a corpus of text from the Web. Our results indicate that language itself contains recoverable and accurate imprints of our historic biases, whether these are morally neutral as towards insects or flowers, problematic as towards race or gender, or even simply veridical, reflecting the status quo for the distribution of gender with respect to careers or first names. These regularities are captured by machine learning along with the rest of semantics. In addition to our empirical findings concerning language, we also contribute new methods for evaluating bias in text, the Word Embedding Association Test (WEAT) and the Word Embedding Factual Association Test (WEFAT). Our results have implications not only for AI and machine learning, but also for the fields of psychology, sociology, and human ethics, since they raise the possibility that mere exposure to everyday language can account for the biases we replicate here.","speakers":[{"id":3596,"image":"/system/people/avatars/000/003/596/large/aylin.jpg?1477420526","full_public_name":"Aylin Caliskan","abstract":"Aylin Caliskan is a Postdoctoral Research Associate and a CITP Fellow at Princeton University. Her work on the two main realms, security and privacy, involves the use of machine learning and natural language processing. She currently works on big-data-driven discrimination and inference through machine learning. She also has ongoing research on privacy preserving information disclosure and contextual integrity. ","description":"In her previous work, she demonstrated that de-anonymization is possible through analyzing linguistic style in a variety of textual media, including social media, cyber criminal forums, source code, and executable binaries. She is extending her work to develop countermeasures against de-anonymization. Aylin's other research interests include designing privacy enhancing tools to prevent unnecessary private information disclosure while quantifying and characterizing human privacy behavior. She holds a PhD in Computer Science from Drexel University and a Master of Science in Robotics from the University of Pennsylvania.","links":[{"url":"http://www.princeton.edu/~aylinc/","title":"Aylin's Webpage"},{"url":"https://citp.princeton.edu","title":"Princeton University - CITP"}]}]},{"id":8273,"guid":"ef62eb53-cb69-42c6-aab0-bc9d3b0e1e92","title":"ATMs how to break them to stop the fraud","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T23:00:00.000+01:00","end_time":"2016-12-29T00:00:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"How to stop the ATMs fraud? How to protect ATMs from attacks such as black box jackpotting? How to prevent network hijacking such as rogue processing center or MiTM? Some of these issues can be fixed by configuration means, some fixed by compensation measures, but many only by vendor. We will tell you about what bank can do now and what we as a community of security specialists should force to vendors.","speakers":[{"id":6960,"image":null,"full_public_name":"Olga Kochetova","abstract":"ATM-addicted","description":"Olga is interested in how various devices interact with cash or plastic cards. She is a senior specialist for the penetration testing team at Kaspersky Lab. Olga has authored multiple articles and webinars about ATM security. She is also the author of advisories about various vulnerabilities for major ATM vendors and has been a speaker at international conferences, including Black Hat Europe, Hack in Paris, Positive Hack Days, Security Analyst Summit, Nuit Du Hack, HITB GSEC and others.","links":[{"url":"https://twitter.com/_Endless_Quest_","title":"@_Endless_Quest_"}]},{"id":7221,"image":null,"full_public_name":"Alexey Osipov","abstract":"Pentest them all.","description":"Lead Expert on a Penetration Testing Team at Kaspersky Lab. An author of variety of techniques and utilities exploiting vulnerabilities in XML protocols and telecom equipment security. Author of advisories for various vulnerabilities for major ATM vendors. A speaker at international security conferences: Black Hat, Hack in Paris (presenting the paper on ATM vulnerabilities), NoSuchCon Paris, Nuit du Hack, Positive Hack Days and others.","links":[{"url":"https://twitter.com/GiftsUngiven","title":"@GiftsUngiven"}]}]},{"id":8315,"guid":"f6811c99-96af-44d5-b82d-5afe826b2caf","title":"A world without blockchain","logo":"/system/events/logos/000/008/315/large/icon-1294811_640.png?1475272511","type":"lecture","do_not_record":false,"start_time":"2016-12-28T18:30:00.000+01:00","end_time":"2016-12-28T19:30:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"Instant money transfer, globally without borders and 24/7. That’s one of the promises of Bitcoin. But how does national and international money transfer work in the world of banks?","speakers":[{"id":6947,"image":null,"full_public_name":"Mark van Cuijk","abstract":"Mark is an experienced full-stack DevOps engineer. Mark now helps banks to understand modern technology, currently focussing on blockchain.","description":"After finishing his masters on information security, writing an award-winning thesis on the Android permission model, he co-founded Limesco, a community-driver mobile phone operator. He co-founded and ran two Bitcoin startup, but decided to learn more about to classical banking system. Mark now works with banks, which allows him to learn about how those systems work, while at the same time educating those banks about blockchain technology.​","links":[]}]},{"id":7899,"guid":"198bdfe5-24cf-4b2f-9cd5-7522a99b3b4e","title":"Berechnete Welt","logo":"/system/events/logos/000/007/899/large/Logo.jpg?1481283258","type":"lecture","do_not_record":false,"start_time":"2016-12-29T20:30:00.000+01:00","end_time":"2016-12-29T21:00:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Wer all unsere Daten der Gegenwart mit selbstlernenden Algorithmen auswertet, wird die nahe Zukunft grob vorhersagen können. Die Instrumente dafür sind so weit, viele seriöse Forscher arbeiten an Teilbruchstücken. Die Folgen für die Gesellschaft scheinen fatal zu sein. Orwell naht gewaltig.","speakers":[{"id":6583,"image":"/system/people/avatars/000/006/583/large/DSC08198_%28Kopie%29_klein.JPG?1473692468","full_public_name":"Karl Urban","abstract":"Free science journalist. Working public radio and newspapers in German-speaking world: Deutschlandfunk, SWR, Süddeutsche Zeitung, Neue Zürcher Zeitung, Welt.","description":"Geologist by training, space geek since childhood. Has many global concerns.","links":[{"url":"http://die-fachwerkstatt.de/urban","title":"Die Fachwerkstatt"},{"url":"http://www.astrogeo.de","title":"Blog: AstroGeo"},{"url":"http://podcast.pikarl.de","title":"Podcast: AstroGeo"}]}]},{"id":8225,"guid":"e26852ae-9efe-47a0-9e65-3bbd120f7422","title":"Beyond Virtual and Augmented Reality","logo":"/system/events/logos/000/008/225/large/Slice.png?1482770208","type":"lecture","do_not_record":false,"start_time":"2016-12-30T12:15:00.000+01:00","end_time":"2016-12-30T12:45:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"With recent development in capture technology, preserving one's’ daily experiences and one's’ knowledge becomes richer and more comprehensive. Furthermore, new recording technologies beyond simple audio/video recordings become available: 360° videos, tactile recorders and even odor recorders are becoming available. . The new recording technology and the massive amounts of data require new means for selecting, displaying and sharing experiences. \r\n\r\n","speakers":[{"id":1891,"image":"/system/people/avatars/000/001/891/large/kai.png?1380263807","full_public_name":"Kai Kunze","abstract":"I strive to make technology more accessible.\r\n-General love for science, hacking and playing with tech- \r\nI work as an Associate Professor at the Graduate School of Media Design, Keio University, Japan.","description":"Kai has quite diverse interests. Currently, he invests a lot of time in:\r\n\r\nexploring reading activities\r\n\r\nactivity recognition\r\n\r\nhuman computer interaction\r\n\r\ncontext/activity recognition\r\n\r\nembedded systems\r\n\r\nsocial computing\r\n\r\ndistributed systems\r\n\r\npervasive computing.","links":[{"url":"http://kaikunze.de","title":"Homepage"},{"url":"http://app.net/kkai","title":"app.net"},{"url":"http://twitter.com/k_garten","title":"twitter"}]}]},{"id":8288,"guid":"b7e028fa-175f-464d-bc85-adf56e358626","title":"Bonsai Kitten waren mir lieber - Rechte Falschmeldungen in sozialen Netzwerken","logo":"/system/events/logos/000/008/288/large/logo.png?1475269239","type":"lecture","do_not_record":false,"start_time":"2016-12-27T19:00:00.000+01:00","end_time":"2016-12-27T19:30:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"Auf der Hoaxmap werden seit vergangenem Februar Gerüchte über Geflüchtete und deren Widerlegungen gesammelt, sortiert und in Kartenform präsentiert. Die Themen sind dabei so vielfältig wie die Erzählformen.","speakers":[{"id":6978,"image":null,"full_public_name":"fraulutz","abstract":"Lutz Helm ist Softwareentwickler und Radioaktivist und arbeitet seit Februar 2016 an der Gerüchtekarte Hoaxmap mit.","description":"Lutz Helm arbeitet als Softwareentwickler in Leipzig. Er ist außerdem seit über zehn Jahren bei Radio BLAU, dem Freien Radio in Leipzig, aktiv. Dort koordinierte er unter anderem mehrere Jahre lang das werktägliche Abendmagazin “Aktuell”. Als er noch keinen Twitteraccount hatte, musste er seine Scherze noch gelegentlich bei der Online-Ausgabe des Satire-Magazins Titanic loswerden. Seit Februar 2016 arbeitet er nun bei dem von Karolin Schwarz initiierten Projekt hoaxmap.org mit. Hoaxmap sammelt widerlegte Gerüchte und Falschmeldungen vor allem über Geflüchtete und war 2016 für den Grimme Online Award nominiert.","links":[{"url":"https://twitter.com/fraulutz","title":"@fraulutz auf Twitter"}]},{"id":7042,"image":null,"full_public_name":"NoAverageRobot","abstract":"Karolin Schwarz ist Initiatorin des Projektes \u003ca href=\"http://hoaxmap.org\" target=\"_blank\"\u003eHoaxmap\u003c/a\u003e, dass 2016 für den Grimme Online Award nominiert war.","description":"Karolin Schwarz, geboren und aufgewachsen in Sachsen-Anhalt, lebt seit 2005 in Leipzig. Sie studierte Ethnologie und Afrikanistik, verbunden mit Aufenthalten in Kenia und Tansania. Beruflich ist sie seit sieben Jahren im Bereich Community Management tätig. Derzeit arbeitet Schwarz als Social-Media-Redakteurin. Im Februar 2016 initiierte sie das Projekt hoaxmap.org, das sich der Aufklärung über viral verbreitete Falschmeldungen und Gerüchte über Geflüchtete widmet. Gemeinsam mit Lutz Helm war sie deshalb 2016 für den Grimme Online Award nominiert. Sie träumt von der Gründung des Instituts für angewandte Sachsenkritik.","links":[{"url":"https://twitter.com/NoAverageRobot","title":"NoAverageRobot auf Twitter"}]}]},{"id":8314,"guid":"64c07cb5-ec19-4972-a2c8-96c0e0df83c6","title":"Bootstraping a slightly more secure laptop","logo":"/system/events/logos/000/008/314/large/28070128343_d6c0b5497c_k.jpg?1475272210","type":"lecture","do_not_record":false,"start_time":"2016-12-27T14:00:00.000+01:00","end_time":"2016-12-27T15:00:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Heads is an open source custom firmware and OS configuration for laptops and servers that aims to provide slightly better physical security and protection for data on the system. Unlike Tails, which aims to be a stateless OS that leaves no trace on the computer of its presence, Heads is intended for the case where you need to store data and state on the computer. It targets specific models of commodity hardware and takes advantage of lessons learned from several years of vulnerability research. This talk provides a high level overview of Heads, a demo of installing it on a Thinkpad and a tour of some of the attacks that it protects against.","speakers":[{"id":4825,"image":"/system/people/avatars/000/004/825/large/Screen_Shot_2014-08-09_at_4.36.51_PM.png?1407616656","full_public_name":"Trammell Hudson","abstract":"I like to \u003ca href=\"http://trmm.net/Reverse_engineering\"\u003etake things apart\u003c/a\u003e.","description":"I'm Trammell Hudson, a \u003ca href=\"http://trmm.net/Category:Software\" title=\"Category:Software\"\u003eprogrammer\u003c/a\u003e, \u003ca href=\"http://trmm.net/Category:Photography\" title=\"Category:Photography\"\u003ephotographer\u003c/a\u003e, frequent \u003ca href=\"http://trmm.net/Hacks\" title=\"Hacks\"\u003ehacker\u003c/a\u003e and occasional \u003ca href=\"http://trmm.net/Category:Clocks\" title=\"Category:Clocks\"\u003ewatchmaker\u003c/a\u003e.  I enjoy \u003ca href=\"http://trmm.net/Reverse_engineering\" title=\"Reverse engineering\"\u003ereverse engineering\u003c/a\u003e things, restoring \u003ca href=\"http://trmm.net/Category:Retrocomputing\" title=\"Category:Retrocomputing\"\u003eantique computers\u003c/a\u003e and \u003ca href=\"http://trmm.net/Category:Blinky\" title=\"Category:Blinky\"\u003emaking things blink\u003c/a\u003e.  Sometimes I use my Amateur Extra rating (NY3U) and hack on \u003ca href=\"http://trmm.net/Category:Radio\" title=\"Category:Radio\"\u003eRadio and RF\u003c/a\u003e projects.  I also have other \u003ca href=\"http://trmm.net/Category:Hobbies\" title=\"Category:Hobbies\"\u003ehobbies\u003c/a\u003e involving coffee, aviation, sailing and other vehicles.  And on the weekends I enjoy \u003ca href=\"http://trmm.net/Category:Classes\" title=\"Category:Classes\"\u003eteaching classes at NYC Resistor\u003c/a\u003e.\r\n\u003c/p\u003e\u003cp\u003e\u003ca text\" href=\"http://trmm.net\"\u003etrmm.net\u003c/a\u003e is a collection of links to my blog posts, flickr sets and projects.\r\n","links":[{"url":"http://trmm.net/","title":"My Projects"},{"url":"http://nycresistor.com/","title":"NYC Resistor"},{"url":"http://twosigma.com/","title":"Two Sigma"}]}]},{"id":8338,"guid":"48e016a4-5683-4bda-8976-98f1dbf62787","title":"Building a high throughput low-latency PCIe based SDR","logo":"/system/events/logos/000/008/338/large/XTRX_in_hands.jpg?1479260196","type":"lecture","do_not_record":false,"start_time":"2016-12-27T12:45:00.000+01:00","end_time":"2016-12-27T13:45:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Software Defined Radios (SDRs) became a mainstream tool for wireless engineers and security researches and there are plenty of them available on the market. Most if not all SDRs in the affordable price range are using USB2/USB3 as a transport, because of implementation simplicity. While being so popular, USB has limited bandwidth, high latency and is not really suitable for embedded applications. PCIe/miniPCIe is the only widespread bus which is embedded friendly, low latency and high bandwidth at the same time. But implementing PCIe/miniPCIe is not for the faint of heart - you have to write your own FPGA code, write your own Linux kernel driver and ensure compatibility with different chipsets, each with its own quirks. In this talk we will look at the requirements for a high performance SDR like XTRX, how this leads to certain design decisions and share pitfalls and gotchas we encountered (and solved).","speakers":[{"id":3000,"image":"/system/people/avatars/000/003/000/large/Alexander_Chemeris_by_Bill_Warner_face.jpg?1482783627","full_public_name":"Alexander Chemeris","abstract":"","description":"","links":[{"url":"http://twitter.com/#!/chemeris","title":"Twitter"}]},{"id":6941,"image":null,"full_public_name":"Sergey Kostanbaev","abstract":"SW/HW System developer","description":"","links":[]}]},{"id":8012,"guid":"70269173-72a8-4eab-b356-f22faea6cdca","title":"Building Custom Pinball Machines","logo":"/system/events/logos/000/008/012/large/4412754.png?1482415556","type":"lecture","do_not_record":false,"start_time":"2016-12-29T16:00:00.000+01:00","end_time":"2016-12-29T17:00:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"How to build a pinball machine? We introduce you to all basics and explain the different options for hardware and software. As an example, we show images of our own custom pinball machine.","speakers":[{"id":3565,"image":null,"full_public_name":"jab","abstract":"Research associate at University of Hanover, Germany. Interested in Software, Hardware and Pinball.","description":"Studied Computer Science at University of Hanover. Currently doing his PhD in Computer Science. Working part time as a software developer.\r\n\r\nBuilding a head2head (2 player) pinball machine as a private project to learn about manufacturing hardware, game design and real time software. As part of this hobby he also contributes to the Mission Pinball Framework which is an open source project to drive pinball machines.","links":[]}]},{"id":8034,"guid":"1f7eb981-2819-4824-8f40-4ddde0be7bf3","title":"Build your own NSA","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T20:30:00.000+01:00","end_time":"2016-12-28T21:30:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"When thinking about surveillance, everyone worries about government agencies like the NSA and big corporations like Google and Facebook. But actually there are hundreds of companies that have also discovered data collection as a revenue source.  We decided to do an experiment: Using simple social engineering techniques, we tried to get the most personal you may have in your procession.","speakers":[{"id":5040,"image":"/system/people/avatars/000/005/040/large/ich_zenmate.png?1443731725","full_public_name":"Andreas Dewes","abstract":"I’m a trained physicist with a background in low-temperature physics and quantum computing, now working as a data scientist \u0026 programmer. I’m interested in data analysis and technology with a focus on privacy, algorithmic transparency and security.","description":"","links":[{"url":"http://github.com/adewes","title":"Github"}]},{"id":7209,"image":"/system/people/avatars/000/007/209/large/Eckert.jpg?1480149892","full_public_name":"@sveckert","abstract":"Investigative researching journalist for biggest german broadcaster ARD - focusing on new technologies. ","description":"Since 2007 Svea Eckert works as a freelance journalist for the public service broadcaster “Das Erste” (ARD). She is mainly researching and reporting on current events for PrimeTime news shows “Tagesschau” and “Tagesthemen”. Her main focus lies on new technology: current internet policies and digital society, economics and data protection policies.\r\n\r\nIn 2011 she released, as co-author, her first documentary “Weltmacht Wikileaks?”. Four more documentaries for \"Das Erste\" (ARD) followed. In 2012 she told the story about facebook and its then much speculated about IPO in her documentary “Facebook - Milliardengeschäft Freundschaft” (“Facebook - Billion Dollar Business friendship”). In 2014 her knowledge and her research during the NSA-affair ended in her first book “Überwacht und ausgespäht: Prism, NSA, Facebook \u0026 Co.” (“Monitored and spied out: Prism, NSA, Facebook \u0026 Co.”) which was published in the Lingen Verlag. In 2015 she published her recent documentary \"Schlachtfeld Internet - Wenn das Netz zur Waffe wird\" (\"The Internet as a battlefield\") where Edward Snowden was the main interview partner - she was researching in hundreds of secret NSA documents.\r\n\r\nSvea Eckert studied “Journalism and Communications” and Economics in Hamburg. During that time she published articles and television broadcasts for numerous publishers and TV stations. Amongst them are “Spiegel TV” and “ZDF”. She also published for “DIE ZEIT” and “Financial Times Deutschland” during an internship at New York German Press. She completed her journalistic training at NDR, Hamburg and Hannover.","links":[{"url":"https://www.sveaeckert.de","title":"Homepage"}]}]},{"id":8401,"guid":"0c197c9a-35eb-4780-a38d-9c53b7ff9bea","title":"CCC-Jahresrückblick 2016","logo":"/system/events/logos/000/008/401/large/pesthoernchenFrei.png?1478130202","type":"lecture","do_not_record":false,"start_time":"2016-12-29T12:45:00.000+01:00","end_time":"2016-12-29T15:00:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Wir werden einen Überblick über die Themen geben, die den Chaos Computer Club 2016 beschäftigt haben. Neben der Zusammenfassung und der Rückschau auf das vergangene Jahr wollen wir einen Blick in die Zukunft wagen.","speakers":[{"id":1633,"image":"/system/people/avatars/000/001/633/large/9.jpg?1360200570","full_public_name":"frank","abstract":"Spokesperson of the Chaos Computer Club and expert on secure communications","description":"","links":[{"url":"https://duckduckgo.com/?q=frank+rieger+ccc","title":"everything you need to know"},{"url":"http://frank.geekheim.de/","title":"blog"}]},{"id":3995,"image":"/system/people/avatars/000/003/995/large/Screen_Shot_2016-12-15_at_19.26.23.png?1481826427","full_public_name":"Linus Neumann","abstract":"Podcaster, Blogger, Hacker.\r\nPsychologist, Cyclist, Anarchist.\r\nBarbarian vegetarian.","description":"Linus Neumann ist einer der Sprecher des Chaos Computer Clubs (CCC).\r\n\r\nZusammen mit Tim Pritlove macht er den wöchentlichen Podcast Logbuch:Netzpolitik und schreibt äußerst unregelmäßig bei netzpolitik.org.\r\n\r\nBeruflich macht er das mit IT-Sicherheit.","links":[]},{"id":1630,"image":"/system/people/avatars/000/001/630/large/ich09-9-9.jpg?1379324352","full_public_name":"Constanze Kurz","abstract":"Constanze is the spokeswoman of the German Chaos Computer Club.","description":"Constanze is an author und freelance writer on technical topics and works at Berlin-based netzpolitik.org. She holds a doctoral degree in computer science. She is an activist and expert on surveillance techniques and co-authored technical analyses for the German Constitutional Court on controversial cases like data retention, covert infiltration of IT systems (law on the Federal Criminal Office (BKA-Gesetz)), anti-terror database, and voting computers.","links":[]},{"id":4395,"image":"/system/people/avatars/000/004/395/large/avatar.png?1451156561","full_public_name":"nexus","abstract":"","description":"","links":[]}]},{"id":7939,"guid":"56537f49-c8f0-4d73-bdba-d4d8307fc170","title":"Check Your Police Record!","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T16:00:00.000+01:00","end_time":"2016-12-27T16:30:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"Polizeibehörden und Geheimdienste sammeln Daten der Bürger – mehr als je zuvor. Der Bestand an unterschiedlichen Datenbanken ist enorm gewachsen und geradezu unübersichtlich geworden. Aufgrund datenschutzrechtlicher Regelungen gibt es für etliche dieser Datenbanken einen gesetzlichen Auskunftsanspruch des Bürgers.","speakers":[{"id":6652,"image":null,"full_public_name":"RA Ulrich Kerner","abstract":"Rechtsanwalt Ulrich Kerner, Fachanwalt für Strafrecht\r\nAttorney-At-Law Ulrich Kerner, Bar-Certified Criminal Defense Spezialist","description":"Rechtsanwalt Ulrich Kerner berät und vertritt kritische Blogger, politische Künstlergruppen und Netzaktivisten, aber auch Unternehmer und Unternehmen in Fragen des Polizei- und Ordnungsrechts, Medien- und Presserechts und des Wirtschafts- und Strafrechts. Der Fachanwalt für Strafrecht hat ein besonderes Interesse an den Themen Bürgerrechte und Freiheit des Einzelnen, die von staatlicher Seite seit geraumer Zeit unter dem Deckmantel von Terrorismusgefahr und Gefahr für die innere Sicherheit immer weiter beschnitten werden. So war er einer der Beschwerdeführer gegen den sog. Hackerparagraphen § 202c StGB vor dem Bundesverfassungsgericht. Bevor er sein juristisches Studium begann, war er viele Jahre als freischaffender Musiker tätig. Für das Land Berlin ist er nebenamtlicher Arbeitsgemeinschaftsleiter in der Rechtsreferendarausbildung.\r\n\r\nAttorney-at-Law Ulrich Kerner was founder of a record label and worked as a freelance musician for several years before studying law at Humboldt-University in Berlin. The bar-certified specialist lawyer for criminal defense law has a main interest in civil rights and constitutional law, where we face a rollback under the guise of terrorist threats and inner security. He was one of the suitors against the Hackerparagraph (§ 202c StGB) at the Bundesverfassungsgericht. Besides being a criminal defense lawyer, he advises and represents blogger, artists groups, net activists and corporate clients in the areas of public law, media and press law and civil rights.","links":[{"url":"http://www.anwaltfuerstrafsachen.de","title":"Website: Anwalt für Strafsachen"}]}]},{"id":8042,"guid":"90c2f1c6-c32e-4bb2-b8a0-db6b4e24e4b3","title":"Code BROWN in the Air","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T23:00:00.000+01:00","end_time":"2016-12-29T00:00:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"The talk is about the paging system, an old technology in the 90's, used in healthcare, ICS and government, a systematic review of security impacts that it brought to us in the age of SDR, covering the United States, Canada, England and Japan.  By sniffing known pager frequencies in the general vicinity of hospitals, factories and public facilities with a $20 DVB-T, we discovered that not only is pager technology alive and kicking, but much of the traffic is not encrypted, resulting in violation of privacy laws and more importantly, leaks of sensitive information.  The talk is not about the protocol nor the hardware device.","speakers":[{"id":6884,"image":"/system/people/avatars/000/006/884/large/gravatar.jpeg?1474876805","full_public_name":"miaoski","abstract":"Philippe Lin works for Trend Micro as a threat researcher, who is mainly interested in open source software, open hardware, Arduino, and a new comer to the world of SDR.","description":"","links":[]}]},{"id":8404,"guid":"88cc14c0-8962-4906-9b37-06ff82ce159c","title":"Community","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-30T11:30:00.000+01:00","end_time":"2016-12-30T12:30:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Mitch Altman (born December 22, 1956) is a San Francisco-based hacker and inventor, best known for inventing TV-B-Gone, as featured speaker at hacker conferences, as international expert on the hackerspace movement, and for teaching introductory electronics workshops. He is also Chief Scientist and CEO of Cornfield Electronics.","speakers":[{"id":1395,"image":"/system/people/avatars/000/001/395/large/BrainMachineAvatar3.jpg?1410616466","full_public_name":"Mitch","abstract":"Inventor of TV-B-Gone.  Co-Founder of Noisebridge.  Promoter of Hackerspaces and Open Source.","description":"Inventor of TV-B-Gone remote controls, co-founder of Noisebridge (San Francisco hackerspace), contributor to MAKE Magazine and 2600, co-founder of 3ware (SillyValley RAID controller startup), helped pioneer VR in mid-1980s, gives talks and soldering and electronics workshops worldwide.","links":[{"url":"http://www.TVBGone.com","title":"TV-B-Gone universal remote controls"},{"url":"http://en.wikipedia.org/wiki/Mitch_Altman","title":"Wikipedia page"},{"url":"http://www.CornfieldElectronics.com","title":"Cornfield Electronics"},{"url":"https://noisebridge.net/","title":"Noisebridge"},{"url":"http://makezine.com/10/brainwave/","title":"Brainwave Machine in MAKE"},{"url":"http://tedxtalks.ted.com/video/Mitch-Altman-at-TEDxBrussels","title":"TEDxBrussels talk on the Hackerspace Movement"}]}]},{"id":7946,"guid":"700a07e7-a9c4-437b-a4c5-4491b23a9b4a","title":"Console Hacking 2016","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T23:00:00.000+01:00","end_time":"2016-12-28T00:00:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Last year, we demonstrated Linux running on the PS4 in a lightning talk - presented on the PS4 itself. But how did we do it? In a departure from previous Console Hacking talks focusing on security, this year we're going to focus on the PS4 hardware, what makes it different from a PC, and how we reverse engineered it enough to get a full-blown Linux distro running on it, complete with 3D acceleration.","speakers":[{"id":1651,"image":"/system/people/avatars/000/001/651/large/chipalphasq.png?1384755244","full_public_name":"marcan","abstract":"If it ain't broke, I'll fix it!","description":"","links":[{"url":"http://hackmii.com","title":"Wii hacking blog"},{"url":"http://marcansoft.com","title":"Blog"},{"url":"http://twitter.com/marcan42","title":"Twitter"}]}]},{"id":8229,"guid":"bfc2ab1f-8384-4d7d-801a-dde8c81e039c","title":"Copywrongs 2.0","logo":"/system/events/logos/000/008/229/large/brace2big.jpg?1475257311","type":"lecture","do_not_record":false,"start_time":"2016-12-28T16:00:00.000+01:00","end_time":"2016-12-28T17:00:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"EU copyright reform plans threaten freedom of expression: Commissioner Günther Oettinger wants to make sharing even the tiniest snippets of news content subject to costly licensing, and obligate internet platforms to monitor all user uploads. We can still stop these proposals – if you join the fight now.","speakers":[{"id":7017,"image":"/system/people/avatars/000/007/017/large/P1012552_juliareda_sq.jpg?1475252446","full_public_name":"Julia Reda","abstract":"Member of the European Parliament\r\nEuropean Pirate Party / Greens/EFA group","description":"Julia Reda is a member of the European Parliament for the European Pirate Party and a Vice Chair of the Greens/EFA group. She advocates for the free exchange of culture and knowledge across borders and for progress that benefits all.\r\n\r\nJulia was listed among the „30 under 30 championing Europeans’ rights“ by Forbes and named the second-most influential MEP for internet policy by netzpolitik.org.","links":[{"url":"https://juliareda.eu","title":"JuliaReda.eu"},{"url":"https://twitter.com/senficon","title":"Twitter"}]}]},{"id":8414,"guid":"b5b4ce04-1e4b-4e09-8347-4e72cb5f90b9","title":"Corporate surveillance, digital tracking, big data \u0026 privacy","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T11:30:00.000+01:00","end_time":"2016-12-29T12:30:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"Today virtually everything we do is monitored in some way. The collection, analysis and utilization of digital information about our clicks, swipes, likes, purchases, movements, behaviors and interests have become part of everyday life. While individuals become increasingly transparent, companies take control of the recorded data.","speakers":[{"id":3587,"image":null,"full_public_name":"Wolfie Christl","abstract":"Wolfie Christl is a technologist, researcher, writer and privacy advocate with a focus on the social impact of information technology. Communication engineer by profession, he forgot almost everything about CRT TVs, 8051 assembler and Yagi antennas, but studied (and did not complete degrees in) computer science, sociology and media studies.","description":"Having been into digital communities, open source, bottom-up media and Python since the late 1990's, his current work is focused on privacy in times of pervasive digital tracking and data-driven decisions on people.\r\n\r\nIn October 2016, his book „Networks of Control“ was published, written together with Sarah Spiekermann. His 2014 study „Kommerzielle digitale Überwachung im Alltag“ was presented in the European Parliament and widely discussed in German-speaking countries. Before, he co-created „Data Dealer“, an award-winning online game about personal data and privacy. In addition, he contributed to TV documentaries about digital tracking, works as a trainer for employee privacy and writes for newspapers such as the German FAZ. From 2000 to 2006 he was a part of Public Netbase, a media art platform, non-profit ISP and kind of early hackerspace in Vienna. He and his projects have been featured in the New York Times, Forbes and many other media outlets around the world.","links":[{"url":"http://wolfie.crackedlabs.org","title":"http://wolfie.crackedlabs.org"},{"url":"http://twitter.com/WolfieChristl","title":"Twitter"}]}]},{"id":8092,"guid":"3226a81b-dd11-42cc-8c14-ae9f95c01bbd","title":"Datenschutzgrundverordnung: Rechte für Menschen, Pflichten für Firmen \u0026 Chancen für uns","logo":"/system/events/logos/000/008/092/large/33c3_vortrag_Logo_2.png?1475267182","type":"lecture","do_not_record":false,"start_time":"2016-12-30T13:45:00.000+01:00","end_time":"2016-12-30T14:15:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Ziel des Vortrages ist es, einen Überblick über die neuen aus der Datenschutzgrundverordnung entstehenden Rechte von Betroffenen (also Du mein*e junge*r Jedi) zu geben und dabei aufzuzeigen, an welchen Stellen Musik für uns drin sein kann.","speakers":[{"id":6932,"image":"/system/people/avatars/000/006/932/large/derPUPE_400_avantar.jpg?1475063559","full_public_name":"derPUPE","abstract":"humanoid, uptime: 43 years 3 months\r\nGeneration C64 / ZX81\r\nBeruflich: seit sechs Jahren Datenschutzbetrauftragter in einem international tätigen Konzern. Davor IT-Normade mit verschiedensten Stationen, siehe XING.\r\nHobbies: typische Nerdthemen + addons \u0026 Hörbucher, Schach und meine Mitmenschen. ","description":"Slogan: Patch yourself to improve the system. Bei Twitter steht: „Weltensegler \u0026 Proclamator des gepflegten Schabernacks. Deutschlands jüngster Althippie - Überparteilich wirkender VollHerz-Gesellschaftspatcher“, was mich neben meiner beruflichen Profession immer noch sehr gut beschreibt. \r\nDurch FoeBud und Club schon frühzeitig im Thema Datenschutz sozialisiert, war der Vortrag von Thomas Maus auf dem 22c3 (2005) der Auslöser, mich auch politisch im Thema Datenschutz zu engagieren. Durch langjährliche Besuche auf nationalen und internationalen Datenschutzkonferenzen habe ich in vielen Gespächen neben den eigenen die Wirkungsmechanismen in großen Firmen bei der Umsetzung des Themas Datenschutz kennenlernen dürfen. Aus diesen Erfahrungen komme ich zu dem Schluss, daß durch die EU-DSGVO uns Aktivisten ein „Window of opportunity“ gegeben ist, welches es jetzt wie im Vortrag erläutert wird, zu nutzen gilt.","links":[{"url":"https://twitter.com/derPUPE","title":"derPUPE on TWITTER"},{"url":"https://www.xing.com/profile/Lars_Hohl","title":"derPUPE on XING"}]}]},{"id":7945,"guid":"5fb5e620-383a-4679-b37a-beef20bcd4fe","title":"Decoding the LoRa PHY","logo":"/system/events/logos/000/007/945/large/Screen_Shot_2016-09-29_at_12.19.54_PM.png?1475176968","type":"lecture","do_not_record":false,"start_time":"2016-12-29T18:30:00.000+01:00","end_time":"2016-12-29T19:30:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"LoRa is an emerging Low Power Wide Area Network, a new class of wireless technology designed to connect everything from streetlights to intelligent mousetraps.  I will discuss the design and security implications of LPWANs, dive deep into the LoRa PHY, and demonstrate sniffing and injection with an open source LoRa transceiver built on commodity Software Defined Radio tools.","speakers":[{"id":6820,"image":"/system/people/avatars/000/006/820/large/knight.jpg?1475176107","full_public_name":"Matt Knight","abstract":"Matt is a software engineer and security researcher with Bastille Networks, where he seeks to discover vulnerabilities in the ubiquitous wireless interfaces that connect embedded devices to the Internet of Things.  In 2016, he documented the closed-source LoRa PHY based on blind signal analysis.  Matt holds a BE with a concentration in Electrical Engineering from Dartmouth College.","description":"Matt is a software engineer and security researcher with Bastille Networks, where he seeks to discover vulnerabilities in the ubiquitous wireless interfaces that connect embedded devices to the Internet of Things.  In 2016, he documented the closed-source LoRa PHY based on blind signal analysis.  Matt previously worked as a hardware and wireless security consultant, leveraging Software Defined Radio to craft custom attacks against embedded devices, and has developed wireless networking products for a variety of customers.  Matt holds a BE with a concentration in Electrical Engineering from Dartmouth College.","links":[{"url":"https://github.com/BastilleResearch/gr-lora","title":"gr-lora Open Source GNU Radio OOT Transceiver"},{"url":"https://github.com/matt-knight/research","title":"Matt's Research Archive"},{"url":"https://linkedin.com/in/matthewfknight","title":"Matt's LinkedIn"}]}]},{"id":8348,"guid":"a1a52c4c-8233-403b-8f04-db981df016c1","title":"Deploying TLS 1.3: the great, the good and the bad","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T21:45:00.000+01:00","end_time":"2016-12-27T22:45:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"Transport Layer Security (TLS) 1.3 is almost here. The protocol that protects most of the Internet secure connections is getting the biggest ever revamp, and is losing a round-trip. We will explore differences between TLS 1.3 and previous versions in detail, focusing on the security improvements of the new protocol as well as some of the challenges we face around securely implementing new features such as 0-RTT resumption. At Cloudflare we will be the first to deploy TLS 1.3 on a wide scale, and we’ll be able to discuss the insights we gained while implementing and deploying this protocol.","speakers":[{"id":6145,"image":"/system/people/avatars/000/006/145/large/filippo_valsorda_300.jpg?1443652325","full_public_name":"Filippo Valsorda","abstract":"Filippo Valsorda (@FiloSottile) is a systems and cryptography engineer at Cloudflare, where he's developing the experimental TLS 1.3 stack in Go and he kicked DNSSEC until it became something deployable. Nevertheless, he's probably best known for making popular online vulnerability tests, including the original Heartbleed test.","description":"\u003ch2\u003eRecent presentations\u003c/h2\u003e\r\n\u003cul\u003e\r\n\u003cli\u003e32c3: \"The plain simple reality of entropy\"\u003c/li\u003e\r\n\u003cli\u003eGopherCon: \"From cgo back to Go\"\u003c/li\u003e\r\n\u003cli\u003eHOPE XI: \"Stealing Bitcoin with math\"\u003c/li\u003e\r\n\u003cli\u003eHOPE XI: \"The code archive\"\u003c/li\u003e\r\n\u003cli\u003eHITB2015AMS: \"Non-Hidden Hidden Services Considered Harmful: Attacks and Detection\"\u003c/li\u003e\r\n\u003cli\u003e2014 Hack.lu: \"The Heartbleed test adventure\"\u003c/li\u003e\r\n\u003cli\u003eHITB2014KUL: \"Exploiting ECDSA failures in the Bitcoin blockchain\"\u003c/li\u003e\r\n\u003c/ul\u003e\r\n\r\n\u003cp\u003eFilippo teaches the closely related training „Breaking Bad Crypto“ on faulty cryptography designs and implementations and how to break them.\r\nIt was recently held at the DEF CON 21 and 23 CryptoVillage, 32c3, 31c3 and HITB2015AMS.\u003c/p\u003e\r\n\r\n\u003cp\u003eFind \u003ca href=\"https://speakerdeck.com/filosottile\"\u003ehere\u003c/a\u003e the slides and links to videos, and \u003ca href=\"https://blog.filippo.io/hi/\"\u003ehere\u003c/a\u003e additional blabbing. The exploit kit is loaded only behind one of these links. Choose wisely.\u003c/p\u003e","links":[{"url":"https://blog.filippo.io","title":"Blog"},{"url":"https://twitter.com/FiloSottile","title":"Twitter"},{"url":"https://speakerdeck.com/filosottile","title":"Speakerdeck"}]},{"id":5003,"image":"/system/people/avatars/000/005/003/large/nick-twitter.jpeg?1416254143","full_public_name":"Nick Sullivan","abstract":"Nick Sullivan leads the security engineering team at CloudFlare. He built many of the content security mechanisms for Apple’s multi-billion dollar iTunes store. He previously worked as a security analyst worked at Symantec analyzing large scale threat data.","description":"Nick Sullivan leads the security engineering team at CloudFlare. He built many of the content security mechanisms for Apple’s multi-billion dollar iTunes store. He previously worked as a security analyst worked at Symantec analyzing large scale threat data.\r\n\r\nNick is a hands-on engineering leader, software developer, and security architect with deep expertise in cryptography, computer security, software protection, information security, digital rights management and distributed systems. He is passionate about building and breaking secure systems and moving the state of computer security forward through technological innovation, open source software, writing, and speaking. His security expertise has been cited by news organizations including the New York Times, Wall Street Journal, CNN, Forbes, Bloomberg, Wired, re/code, The Verge, Schneier Blog, CBC, Ars Technica and others.","links":[{"url":"https://twitter.com/grittygrease","title":"Twitter"}]}]},{"id":8266,"guid":"658b276a-e3a2-4698-b2a8-2edb724be17e","title":"Der 33 Jahrerückblick","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T11:30:00.000+01:00","end_time":"2016-12-28T12:00:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"The proper relationship of technology and politics have been the subject of an evergreen debate on the floor of the Chaos Communication Congress.  Rather than taking a position in this debate, we are asking how the two have been co-articulated in practice so far by CCC participants?","speakers":[{"id":3495,"image":"/system/people/avatars/000/003/495/large/avatar-with-glasses.jpg?1480388674","full_public_name":"maxigas","abstract":"","description":"","links":[{"url":"https://relay70.metatron.ai","title":"Research blog"},{"url":"https://research.metatron.ai","title":"Research wiki"}]},{"id":7053,"image":"/system/people/avatars/000/007/053/large/m.jpg?1476798621","full_public_name":"mel","abstract":"Melanie has a background in Anthropology and Computer Science and a PhD in Communications, researching on the intersection of digital technologies, communication studies, STS and international development. Since 2013 Melanie is a research associate at TU Berlin with a teaching a research interest in electronics, digital labs and ICTs and education and working on a freelance basis as a consultant in the same area. ","description":"","links":[]}]},{"id":8440,"guid":"835ad2b7-162f-4731-b032-603eee69371b","title":"DIE NSU-MONOLOGE / NSU-MONOLOGLARI","logo":null,"type":"performance","do_not_record":true,"start_time":"2016-12-28T20:30:00.000+01:00","end_time":"2016-12-28T22:45:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Der Kampf der Hinterbliebenen um die Wahrheit\r\n---\r\nGeride kalanların gerçekler için savaşı\r\n","speakers":[{"id":6400,"image":null,"full_public_name":"Bühne für Menschenrechte","abstract":"Bühne für Menschenrechte erzählt von Menschen, die Grenzen überwunden, Verbündete gefunden, ein \"Nein\" nie als Antwort akzeptiert und unter aussichtslosen Bedingungen immer weiter gemacht haben - mit dem Ziel eines Lebens in Sicherheit und mit Menschenwürde.","description":"","links":[{"url":"http://buehne-fuer-menschenrechte.de/","title":"Website"}]},{"id":7269,"image":null,"full_public_name":"Elisabeth Pleß","abstract":"Bühne für Menschenrechte","description":"","links":[]},{"id":7272,"image":null,"full_public_name":"Idil Üner","abstract":"Bühne für Menschenrechte","description":"","links":[]},{"id":7273,"image":null,"full_public_name":"Mehmet Kurtulus","abstract":"Bühne für Menschenrechte","description":"","links":[]},{"id":7274,"image":null,"full_public_name":"Vanida Karun","abstract":"Bühne für Menschenrechte","description":"","links":[]},{"id":7266,"image":null,"full_public_name":"Michael Ruf","abstract":"Bühne für Menschenrechte","description":"","links":[]},{"id":7270,"image":null,"full_public_name":"Nissar Gardi","abstract":"Referentin des Projekts \"Empower. Beratungsstelle für Betroffene rechter, antisemitischer und rassistischer Gewalt\"","description":"","links":[]},{"id":7271,"image":null,"full_public_name":"Andreas Kienzle","abstract":"Nebenklageanwalt der Familie Yozgat","description":"","links":[]},{"id":7267,"image":null,"full_public_name":"Florentine Seuffert","abstract":"Bühne für Menschenrechte","description":"","links":[]},{"id":7268,"image":null,"full_public_name":"Barnie Ecke","abstract":"Bühne für Menschenrechte","description":"","links":[]},{"id":7275,"image":null,"full_public_name":"Robert Colonius","abstract":"Bühne für Menschenrechte","description":"","links":[]},{"id":7279,"image":null,"full_public_name":"Sarah Sott","abstract":"Bühne für Menschenrechte","description":"","links":[]}]},{"id":8131,"guid":"378cdf23-350b-4a05-afd0-6360139a7a06","title":"Dieselgate – A year later","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T19:00:00.000+01:00","end_time":"2016-12-27T19:30:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"At 32C3 we gave an overview on the organizational and technical aspects of Dieselgate that had just broken public three months before. In the last year we have learned a lot and spoken to hundreds of people. Daniel gives an update on what is known and what is still to be revealed.","speakers":[{"id":4673,"image":null,"full_public_name":"Daniel Lange (DLange)","abstract":"","description":"","links":[]}]},{"id":8037,"guid":"6347d122-daf0-4b30-851c-32cac06bf6bd","title":"Die Sprache der Populisten","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T16:00:00.000+01:00","end_time":"2016-12-28T17:00:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Mit dem Erstarken der Rechtspopulisten (nicht nur in Deutschland) werden populistische Positionen immer häufiger hingenommen, obwohl es sich dabei um vermeintliche \"Gewissenheiten\" handelt, die bei näherer Betrachtung inakzeptabel sind. Solche Positionen beruhen nicht auf einer nachvollziehbaren Argumentation, sondern auf sprachlich-rhetorischen Tricks, die im Grunde leicht zu durchschauen sind, denen jedoch immer mehr Menschen auf den Leim gehen. Dieser Vortrag soll zeigen, welche Tricks das sind und wie Populisten demaskiert werden können. Dabei wird deutlich werden, dass nicht nur eine Partei für populistische Parolen anfällig ist.","speakers":[{"id":4085,"image":"/system/people/avatars/000/004/085/large/Maha-kritisch.jpg?1378312720","full_public_name":"Martin Haase/maha","abstract":"Martin Haase (aka maha) is a linguistics professor and an internet activist.","description":"Martin Haase (maha) ist Professor für romanische Sprachwissenschaft an der Otto-Friedrich-Universität Bamberg und netzpolitisch engagiert.","links":[{"url":"http://martinhaase.de/","title":"Homepage"},{"url":"http://maha-online.de/","title":"Blog"}]}]},{"id":8057,"guid":"aaec73e9-66b9-46d2-aa0f-9f43018198ea","title":"Dissecting HDMI","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T17:15:00.000+01:00","end_time":"2016-12-29T18:15:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Ever wondered what is actually happening when a speaker can't get their laptop to project? While developing the FPGA-based \u003ca href=\"https://hdmi2usb.tv\"\u003eHDMI2USB.tv open hardware for recording conferences\u003c/a\u003e, we discovered just how convoluted the HDMI protocol can be. Come hear all the horrible details!","speakers":[{"id":6660,"image":"/system/people/avatars/000/006/660/large/Tim_July2016_026.jpg?1472793640","full_public_name":"Tim 'mithro' Ansell","abstract":"","description":"\u003cp\u003e\r\n\u003ca href=\"https://blog.mithis.net/\"\u003eTim 'mithro' Ansell\u003c/a\u003e is a long time open source contributor. Originally getting into FOSS to make cool computer games, he quickly found and fell in love with the language Python. Tim loved the language so much he would eventually go on to start a conference dedicated to the topic called PyCon AU.\r\n\u003c/p\u003e\u003cp\u003e\r\nTim's current efforts concentrate around trying to make recording and live streaming of user groups and conferences (such as PyCon AU) cheap and easy to do. This has amazingly required the development of custom open hardware and a huge amount of Python to make it happen.\r\n\u003c/p\u003e","links":[{"url":"https://blog.mithis.net/","title":"Mithro Rants about stuff"},{"url":"https://code.timvideos.us/","title":"TimVideos.us"},{"url":"https://hdmi2usb.tv/","title":"HDMI2USB.tv"}]}]},{"id":8151,"guid":"bc638f9f-0370-42f9-b83c-f85cca4ca38d","title":"Dissecting modern (3G/4G) cellular modems","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T14:00:00.000+01:00","end_time":"2016-12-29T15:00:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"Let's have a detailed look at some modern 3G/4G cellular modems and see what we can find out about their internals using undocumented debug interfaces and software or hardware based hacking techniques.","speakers":[{"id":1757,"image":"/system/people/avatars/000/001/757/large/62.jpg?1360200609","full_public_name":"LaForge","abstract":"Mobile Communications (GSM/GRPS) expert, former Linux Kernel Hacker, Freedom Fighter. Nerd. Kinky. Mensch mit Kommandozeilenhintergrund.","description":"","links":[{"url":"http://laforge.gnumonks.org/weblog","title":"Laforge’s blog"},{"url":"http://gnumonks.org/projects","title":"Various Projects"},{"url":"http://laforge.gnumonks.org/","title":"Homepage"},{"url":"http://en.wikipedia.org/wiki/Harald_Welte","title":"English Wikipedia"},{"url":"http://gpl-violations.org/","title":"The GPL-violations.org project"},{"url":"http://openbsc.osmocom.org/","title":"OpenBSC"}]},{"id":6996,"image":null,"full_public_name":"holger","abstract":"","description":"","links":[]}]},{"id":7853,"guid":"b8d9fac7-bbe6-40da-aa80-aed27f77a708","title":"Do as I Say not as I Do: Stealth Modification of Programmable Logic Controllers I/O by Pin Control Attack","logo":"/system/events/logos/000/007/853/large/Logo2.png?1481195946","type":"lecture","do_not_record":false,"start_time":"2016-12-29T16:00:00.000+01:00","end_time":"2016-12-29T17:00:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"Input/Output is the mechanisms through which embedded systems interact and control the outside world. Particularly when employed in mission critical systems, the I/O of embedded systems has to be both reliable and secure. Embedded system’s I/O is controlled by a pin based approach. In this work, we investigate the security implications of embedded system’s pin control. In particular, we show how an attacker can tamper with the integrity and availability of an embedded system’s I/O by exploiting cerain pin control operations and the lack of hardware interrupts associated to them. ","speakers":[{"id":6699,"image":"/system/people/avatars/000/006/699/large/0kNLxdCK.jpg?1481708647","full_public_name":"Ali Abbasi","abstract":"Ali Abbasi is a Ph.D. candidate in Distributed and Embedded System Security group at the University of Twente, The Netherlands and visiting Ph.D. researcher at the Chair of Systems Security of Ruhr-University Bochum, Germany. His research interest involves embedded systems security mostly related to Industrial Control Systems, Critical Infrastructure security, and Real-Time Operating Systems security. He received his master degree in Computer Science from Tsinghua University, Beijing, China in 2013. He was working there on Programmable Logic Controller (PLC) security in Network Security Lab, Microprocessor and SoC Technology R\u0026D center with the National 863 High-tech Program grant from Ministry of Industry and Information Technology of China. He is currently doing his research at the Chair of Systems Security of Ruhr-University Bochum regarding designing system-level protection mechanisms to battle against the sophisticated memory corruption and code-reuse attacks against PLCs and other critical real-time embedded systems. Before that Ali was working as Head of Vulnerability Analysis and Penetration Testing Group at National Computer Security Incident Response Team (CSIRT) at the Sharif University of Technology in Tehran, Iran.","description":"","links":[{"url":"http://wwwhome.cs.utwente.nl/~abbasia/","title":"Homepage"}]},{"id":6988,"image":null,"full_public_name":"Majid","abstract":"Majid Hashemi is a Research \u0026 Development Engineer at Quarkslab, France. In his role as a researcher at Quarkslab, he is dedicated to reverse engineering and analyzing embedded devices.\r\nMajid was involved in this research as an independent researcher. Majid's foremost curiosity is for low-level programming and reverse engineering the dark corners of the operating system. In the past, Majid was mostly involved in analyzing critical infrastructures and radio communications equipment.","description":"","links":[]}]},{"id":7888,"guid":"149f13d4-cc8c-49a9-9e68-544754646022","title":"Downgrading iOS: From past to present","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T20:30:00.000+01:00","end_time":"2016-12-28T21:30:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"This talk is about the iOS secure boot chain and how it changed throughout different iOS versions, while focusing on downgrading despite countermesures. \r\nIt will explain basics like what SHSH blobs and APTickets are and how IMG3 and IMG4 file format works.\r\nAlso a new technique called \"prometheus\" will be introduced which allows for the first time downgrading 64bit devices.","speakers":[{"id":6749,"image":"/system/people/avatars/000/006/749/large/1363935.jpg?1473604461","full_public_name":"tihmstar","abstract":"I'm a 19-year-old student, living in germany.\r\nI love exploiting and reverse engeneering and i'm especially attracted by apple iOS devices and their security.\r\nI like looking at problems from different angles, to find the best solution.\r\n","description":"","links":[]}]},{"id":8439,"guid":"c9f7749d-c365-43ad-9869-1f014c9f1f06","title":"Durchmarsch von Rechts","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T23:00:00.000+01:00","end_time":"2016-12-29T00:00:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Seit einigen Jahren formieren sich am rechten Rand der Gesellschaft explosionsartig neue rassistische, völkisch-nationalistische und offen nazistische Strömungen, Gruppen und Parteien. Einen erschreckenden Verstärker findet das neue braune Getöse in den sozialen Medien und sein Resonanzraum reicht inzwischen bis weit in die Mitte der Gesellschaft.\r\n\r\nTeil des Problems sind institutioneller Rassismus in den Behörden und unkontrollierbare Geheimdienste, die den Mob gewähren lassen: Dafür bietet der NSU-Komplex ein erschütterndes Beispiel. Vor dem neuen, sehr lauten, in der Tendenz aber auch gewalttätigen und terroristischen Phänomen rechter Formierung stehen Linke und bürgerliche Mitte ziemlich verdattert und hilflos. \r\n\r\nJetzt kommt es darauf an, diese Hilflosigkeit zu überwinden, das Geschehen zu analysieren und sich Gegenstrategien einfallen zu lassen. Das ist „unser“ Job. ","speakers":[{"id":7240,"image":null,"full_public_name":"Friedrich Burschel","abstract":"Friedrich Burschel ist Historiker und Politologe und seit 35 Jahren Antifa-Aktivist. Er arbeitet als Referent zum Schwerpunkt Neonazismus und Strukturen/Ideologien der Ungleichwertigkeit bei der Akademie für Politische Bildung der Rosa Luxemburg Stiftung in Berlin. ","description":"Friedrich Burschel ist Historiker und Politologe und seit 35 Jahren Antifa-Aktivist; er arbeitet als Referent zum Schwerpunkt Neonazismus und Strukturen/Ideologien der Ungleichwertigkeit bei der Akademie für Politische Bildung der Rosa Luxemburg Stiftung in Berlin. Er ist akkreditierter Korrespondent des nicht-kommerziellen Lokalsenders Radio Lotte Weimar im NSU-Prozess und Mitarbeiter des Internetprojektes NSU-Watch (nsu-watch.info).","links":[{"url":"http://www.nsu-watch.info/","title":"NSU-Watch"},{"url":"http://antifra.blog.rosalux.de","title":"Antifra-Blog "},{"url":"http://www.rosalux.de/index.php?id=24495","title":"Abgründe staatlicher Verstrickung"}]}]},{"id":8245,"guid":"8270c91a-d6e2-4f1c-9ebb-cdf10708d921","title":"Eavesdropping on the Dark Cosmos","logo":"/system/events/logos/000/008/245/large/photo.jpg?1475260312","type":"lecture","do_not_record":false,"start_time":"2016-12-29T22:45:00.000+01:00","end_time":"2016-12-29T23:15:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Imagine, there is this huge data center but your user privileges allow you to access only 5% of the data. That is the exact same situation physicists face when trying to study the cosmos. 95% of our universe is made out of something that cannot be seen or touched. We generally call this unknown substance \"dark matter\" / \"dark energy\". The recent discovery of gravitational waves gives us a handle on the dark cosmos. We can now listen to invisible events in our universe. But there may also be other methods to shed light on the dark side.","speakers":[{"id":6640,"image":"/system/people/avatars/000/006/640/large/me.jpg?1475253803","full_public_name":"Simon Barke","abstract":"Born in Germany, PhD in physics, lived in Tanzania, worked on gravitational wave detectors on ground and in space, now conducting research in Florida on a dark matter generator/detector that is constructed in Hamburg, Germany.","description":"Simon Barke was born in Germany where he studied physics. For a while, he lived in Moshi, Tanzania, and worked at different local schools and universities. Over the last years, he had the privilege to be involved in a number of exciting projects. He was a scientific monitor at the LIGO gravitational wave detector in Livingston (LA, US). He got his PhD for research on low-frequency gravitational wave observatories in space at the Max Planck Institute for Gravitational Physics (Albert Einstein Institute) in Hannover, Germany. Currently he is employed at the University of Florida (Gainesville, FL, US) where he conducts research on ALPS, a dark matter generator \u003cu\u003eand\u003c/u\u003e detector that will be completed by 2019 at the German Electron Synchrotron DESY (Hamburg, Germany)\r\n\u003ci\u003eHe also does Android Wear apps, science slams, plays online games, and cannot sing (at all).\u003c/i\u003e","links":[{"url":"https://simonbarke.com/","title":"About me"},{"url":"https://lisamission.org","title":"About LISA"},{"url":"http://www.ligo.org/","title":"About LIGO"},{"url":"http://alps.desy.de/","title":"About ALPS"},{"url":"http://darkcosmos.org","title":"About the Dark Cosmos"}]}]},{"id":8113,"guid":"a097896d-04fc-4f58-8d8e-a8dbef9812b4","title":"Edible Soft Robotics","logo":"/system/events/logos/000/008/113/large/image.jpeg?1475186987","type":"lecture","do_not_record":false,"start_time":"2016-12-29T22:45:00.000+01:00","end_time":"2016-12-29T23:15:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"As a soft roboticist I am constantly searching for inspiration for novel soft actuators, and as a home cook and artist I consider eating an object to be a high-level form of interactivity. Having noted the similarities between cast silicone and gummi candies it was natural to combine these interests. I will share my experiments in assessing different candies for their engineering potential, and show my work-in-progress for sweet soft robots.","speakers":[{"id":6977,"image":"/system/people/avatars/000/006/977/large/image.jpeg?1475184989","full_public_name":"Kari Love","abstract":"Kari Love has professionally built soft robots, space suits, costumes and puppets. Recreationally she makes very silly things.","description":"Kari Love is a soft roboticist at Super-Releaser, a Brooklyn-based R\u0026D consultancy. At Final Frontier Design, a commercial space suit company, from 2013-2016 Ms. Love worked as a technical expert on 5 NASA contracts. She developed costumes for Broadway for more than a decade, including her Spider-man: Turn Off The Dark costume which was inducted into the Smithsonian collection, and has built puppet costumes at The Jim Henson Company. She was also a bridesmaid on the first documented wedding in parabolic flight.","links":[{"url":"https://www.karimakes.com/","title":"Work Stuff"}]}]},{"id":8021,"guid":"9d36932f-616a-4677-b924-60c1986fbbfc","title":"Eine kleine Geschichte der Parlamentsschlägerei","logo":"/system/events/logos/000/008/021/large/brawl.jpg?1481931664","type":"lecture","do_not_record":false,"start_time":"2016-12-29T00:15:00.000+01:00","end_time":"2016-12-29T00:45:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Der Vortrag gibt einen Abriss über die Geschichte der Parlamentsschlägerei, ordnet diese politisch und geografisch ein - um dann die verschiedenen Typen und Formen anhand von Videomaterial zu zeigen und gemeinsam zu analysieren.\r\n\r\nDie beiden Vortragenden betreiben seit 2010 gemeinsam das weltweit einzige Fachblog für Parlamentsschlägereien.","speakers":[{"id":6913,"image":"/system/people/avatars/000/006/913/large/portrait.jpg?1481931461","full_public_name":"Joachim Schautenbach","abstract":"Joachim Schautenbach wurde 1979 im beschaulichen Rothenburg ob der Tauber geboren. Nach seinem Studium der Politikwissenschaften trat er eine Stelle als unabhängiger parlamentarischer Beobachter in Berlin an.","description":"","links":[]},{"id":6915,"image":"/system/people/avatars/000/006/915/large/Emma_goldman_1886.jpg?1479126533","full_public_name":"Pia Fortunata","abstract":"","description":"","links":[]}]},{"id":7824,"guid":"4ef69e6a-026f-4b30-888d-af654b220a3d","title":"Einführung zu Blockchains","logo":"/system/events/logos/000/007/824/large/Blockchain_small.png?1472849124","type":"lecture","do_not_record":false,"start_time":"2016-12-28T17:15:00.000+01:00","end_time":"2016-12-28T18:15:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"Blockchain ist die Technologie welche moderne Kryptowährungen ermöglicht. In dem Vortrag wird die Funktionsweise von Blockchains ganz allgemein erklärt. Anhand der Bitcoin Blockchain wird ausserdem gezeigt, wie diese Funktionen in einem echten System umgesetzt werden können.","speakers":[{"id":6019,"image":"/system/people/avatars/000/006/019/large/lego_punk_small.jpg?1443459451","full_public_name":"vimja","abstract":"I’m an IT student from Bern, Switzerland.\r\nIn February 2015, I co-founded the local Chaostreff in Bern.","description":"I’m interested in Free Software, InfoSec, mechanical keyboards and all sorts of stuff. I am also interested in the communities that form around free and open source software.\r\n\r\nAs part of my IT studies, I've worked with Blockchain technology for the last 1.5 years. I have worked with both Bitcoin and Ethereum and ended up writing my bachelor thesis on searching the Bitcoin Blockchain for information.\r\n\r\n33c3 DECT: 5346 (LEGO)\r\n\r\nPGP Key:\r\npub   4096R/B8A370B45E3400FC 2012-04-02 [expires: 2017-11-05]\r\nuid               [ultimate] Niklaus Manuel Hofer \u003cniklaus@mykolab.ch\u003e\r\nsub   4096R/72493CD943A2999D 2012-04-02\r\nsub   4096R/1104D530ACCE24E5 2015-11-14\r\n","links":[]}]},{"id":8237,"guid":"d1681340-162c-48ce-8c0b-61c3e176696d","title":"Es sind die kleinen Dinge im Leben","logo":"/system/events/logos/000/008/237/large/Logo-talk-33c3.png?1482882305","type":"lecture","do_not_record":false,"start_time":"2016-12-28T11:30:00.000+01:00","end_time":"2016-12-28T12:00:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Jeder weiß ungefähr was ein Mikroskop ist und vielleicht hat man auch mal davon gehört das da immernoch dran geforscht wird – Stichwort Hochauflösungsmikroskopie (Nobelpreis 2014 in Chemie). Es gibt deutlich mehr Mikroskope in der professionellen Forschung als es Teleskope gibt, deutlich mehr – und da könnte man sich jetzt fragen: \"Warum sehe ich so viele Bilder von Sterne, aber kaum Mikroskopiebilder von öffentlichen Einrichtungen und Stellen?\". Um diese Frage zu beantworten will ich kurz in die Welt der Hochauflösungsmikroskopie einführen und die Techniken erklären. Ein bisschen über die Community erzählen und versuchen klar zu machen, warum es hier mit der Offenheit noch etwas hapert. UND: Es soll auch mikroskopiert werden.","speakers":[{"id":7027,"image":"/system/people/avatars/000/007/027/large/AndreLampe_v2-warnschild.png?1475258172","full_public_name":"André Lampe","abstract":"Laserphysiker und Wissenschaftskommunikator. Ich habe in meiner Doktorarbeit ein Hochauflösungsmikroskop gebaut. Darüber erzähle ich gerne auf Bühnen bei Science Slams, ich blogge über Mikroskope bei den scienceblogs.de und ich möchte gerne meine Begeisterung für die kleinen Dinge mit vielen Menschen teilen.","description":"Arbeiterkind, Ostwestfale, nach Berlin zugezogener, Pflasterkleber im Katastrophenschutz, Physikstudent, neben dem  Studium Physiklehrer an einer medizintechnischen Assistenten Schule, Lesebühnenautor, Fachwechsler zur Doktorarbeit in die Biochemie, Science Slammer und im Herzen Physiker und Bastler. Hat schonmal im Fernsehen moderiert und Dinge erklärt, z.B. bei der Sendung TM Wissen, hat Erklärvideos auf YouTube gemacht, bloggt für die scienceblogs.de und will immer alle davon überzeugen das sich ein Blick durch ein Mikroskop durchaus lohnt.","links":[{"url":"scienceblogs.de/diekleinendinge/","title":"\"Die kleinen Dinge\" bei den scienceblogs.de"}]}]},{"id":8214,"guid":"562ced0e-1be5-4912-b9a1-d79709ad324a","title":"Ethics in the data society","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T23:30:00.000+01:00","end_time":"2016-12-30T00:00:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"This talk presents the idea that ethics as logic that can be programmed into machines doesn’t seem to work; perhaps, ethics is something else. This talk is about what that something else may be – power. (This talk is not about the Trolley Problem! But it will mention why it shouldn’t apply to the driverless car.)","speakers":[{"id":5093,"image":"/system/people/avatars/000/005/093/large/headshot.jpg?1475247091","full_public_name":"mayameme","abstract":"mayameme is a researcher, writer, reader, and activist who has been working at the intersection of media, technology, human rights, and feminism. ","description":"mayameme is a researcher, writer, and activist who has been working at the intersection of media, technology, human rights, and feminism. She has been working at Tactical Technology Collective since early 2010. She is also a doctoral candidate at Leuphana University, Luneburg, focusing on how ethics is being framed in the context of driverless cars. She has Masters degrees from the University of Sussex in Media and Cultural Studies, and from Delhi University (Applied Psychology). ","links":[]}]},{"id":8167,"guid":"c54bec28-0cec-4472-9a0f-36be8b626dd7","title":"Everything you always wanted to know about Certificate Transparency","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T11:30:00.000+01:00","end_time":"2016-12-27T12:30:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"Certificate transparency - what is it, and what can be done with it?","speakers":[{"id":7009,"image":null,"full_public_name":"Martin Schmiedecker","abstract":"... is researcher for computer security and digital forensics in Vienna. Works for SBA Research. Member of C3Wien.","description":"","links":[]}]},{"id":7858,"guid":"798573a8-f544-48f0-abaf-ebc405f03f4a","title":"Exploiting PHP7 unserialize","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T12:45:00.000+01:00","end_time":"2016-12-27T13:45:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"PHP-7 is a new version of the most prevalent server-side language in use today. Like previous version, this version is also vulnerable to memory corruptions.\r\nHowever, the language has gone through extensive changes and none of previous exploitation techniques are relevant.\r\nIn this talk, we explore the new memory internals of the language from exploiters and vulnerability researchers point of view. We will explain newly found vulnerabilities in the 'unserialize' mechanism of the language and present re-usable primitives for remote exploitation of these vulnerabilities.","speakers":[{"id":6716,"image":null,"full_public_name":"Yannay Livneh","abstract":"Security Researcher, Developer and occasional Hacker","description":"Yannay has been lead security researcher at Check Point Software Technologies LTD for the past year. Before joining Check Point, Yannay served as a security researcher and developer in the IDF for four years. Yannay holds a first degree in computer science from Bar Ilan University, which he graduated at the age of 18. ","links":[]}]},{"id":7960,"guid":"f21478d4-e8db-4f19-854c-2f74b5824706","title":"Fnord-Jahresrückblick","logo":"/system/events/logos/000/007/960/large/logo.png?1474487509","type":"lecture","do_not_record":false,"start_time":"2016-12-29T00:45:00.000+01:00","end_time":"2016-12-29T02:15:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Wenn mal wieder der Zensor pinkeln war, wenn DAMIT ja wohl NIEMAND rechnen konnte, wenn es um demokratisch legitimiertes Baumanagement oder um Stahlbälle geht, dann ist es wieder an der Zeit für eine lockere Abendshow mit den High- und Lowlights des Jahres.","speakers":[{"id":1621,"image":"/system/people/avatars/000/001/621/large/Bildschirmfoto_2013-12-03_um_18.02.55.png?1386116185","full_public_name":"Fefe","abstract":"Hängt seit gefühlt 1980 jedes Jahr beim Chaos Communication Congress herum, hält gelegentlich Vorträge. Betreibt ein Blog (Link siehe unten).","description":"Eigentlich ganz umgänglich. Jedenfalls umgänglicher als man so denken würde. Ausnahmen bestätigen die Regel.","links":[{"url":"http://www.fefe.de/","title":"Fefes Homepage"},{"url":"http://blog.fefe.de/","title":"Fefes Blog"}]},{"id":1633,"image":"/system/people/avatars/000/001/633/large/9.jpg?1360200570","full_public_name":"frank","abstract":"Spokesperson of the Chaos Computer Club and expert on secure communications","description":"","links":[{"url":"https://duckduckgo.com/?q=frank+rieger+ccc","title":"everything you need to know"},{"url":"http://frank.geekheim.de/","title":"blog"}]}]},{"id":8461,"guid":"96f837e6-f137-4b23-88d9-8326a9ac9196","title":"Fnord-Jahresrückblick: Stream","logo":null,"type":"other","do_not_record":false,"start_time":"2016-12-29T00:45:00.000+01:00","end_time":"2016-12-29T02:15:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"","speakers":[]},{"id":7922,"guid":"0a3b7891-6446-4ef7-afc4-e95c21193c68","title":"Formal Verification of Verilog HDL with Yosys-SMTBMC","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T17:15:00.000+01:00","end_time":"2016-12-28T18:15:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"Yosys is a free and open source Verilog synthesis tool and more. It gained prominence last year because of its role as synthesis tool in the Project IceStorm FOSS Verilog-to-bitstream flow for iCE40 FPGAs. This presentation however dives into the Yosys-SMTBMC formal verification flow that can be used for verifying formal properties using bounded model checks and/or temporal induction.\r\n","speakers":[{"id":5860,"image":"/system/people/avatars/000/005/860/large/clifford-sp.png?1442857482","full_public_name":"Clifford","abstract":"","description":"","links":[{"url":"http://www.clifford.at/","title":"Website"},{"url":"https://twitter.com/oe1cxw","title":"Twitter"}]}]},{"id":8412,"guid":"2aba641b-114d-4dac-866e-533314a3c108","title":" From Server Farm to Data Table","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T21:15:00.000+01:00","end_time":"2016-12-29T21:45:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"\r\nEarly digital computers were the size of rooms. While the devices have gotten smaller, because of the increasingly networked nature of technology the room has gotten bigger--it's ceased having walls and started to cover the ocean floor and ascend into low earth orbit. While Neal Stephenson may have cornered this living-inside-a-computer narrative in 1996 with \"Mother Earth, Mother Board\", in the past twenty years the seams of the network have become even more opaque, subsumed into The Cloud and other problematic abstractions. This talk will mostly be about different approaches to documenting, comprehending, and thinking about network infrastructure and the ways that the visual vernacular of technologies shape their history and politics. \r\n\r\n","speakers":[{"id":7176,"image":null,"full_public_name":"Ingrid Burrington","abstract":"","description":"","links":[]}]},{"id":8221,"guid":"09eb4f7a-8cf0-436f-aaa4-88190ee26e6d","title":"Genetic Codes and what they tell us – and everyone else","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-30T13:00:00.000+01:00","end_time":"2016-12-30T13:30:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"The genome – the final frontier – or just a complex mess of letters? Somewhere in there, our eye or skin color is hidden. But also, diseases can be diagnosed or predicted by analyzing the genome. More and more research is committed to finding clues for diseases in our genes. The opportunity is clear: If I know about a disease I might get ahead of time, I could possibly intervene before it starts. Yet: How accurate are these predictions and how meaningful are they? And more importantly: What happens to my genetic data once it has been decoded?","speakers":[{"id":6979,"image":"/system/people/avatars/000/006/979/large/1613987_10202311413199118_1574925434_n.jpg?1475187778","full_public_name":"_Adora_Belle_","abstract":"My name is Anna Müllner, I am a German medical Biotechnologist. After finishing my PhD in cancer research, I am now working for a life science communication company. I am also a science blogger, podcaster and science slammer. I have long since been interested in data security, for medical data in particular, ethical issues in science and evidence-based medicine. I would be happy to present at the 33c3, at what will be my third time at the c3.\r\nIf the need should arise, I can give German translations of slides and uncommon biological terms to the translators.\r\n","description":"","links":[{"url":"http://zellmedien.de","title":"Zellmedien"},{"url":"http://scilogs.spektrum.de/lifescience/","title":"1ife5cience"}]}]},{"id":7966,"guid":"dd070191-1d1c-4b9c-a887-e4950a688cdb","title":"Geolocation methods in mobile networks","logo":"/system/events/logos/000/007/966/large/C3.gif?1481205280","type":"lecture","do_not_record":false,"start_time":"2016-12-27T17:30:00.000+01:00","end_time":"2016-12-27T18:00:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"This talk presents the results of the technical analysis for the German Parliamentary Committee investigating the NSA spying scandal on geolocation methods in mobile networks.","speakers":[{"id":6853,"image":null,"full_public_name":"Erik","abstract":"Erik is a research associate and PhD student in the Security and Privacy research group at University of Hamburg. He holds an Master of Science in physics from the University of Rostock.","description":"He is an expert on surveillance techniques and contributed to a technical analysis for the German Parliamentary Committee investigating the NSA spying scandal on geolocation methods.","links":[]}]},{"id":7865,"guid":"1a6657a2-b6c2-4acc-b8fc-5ec081c0877f","title":"Gone in 60 Milliseconds","logo":"/system/events/logos/000/007/865/large/687474703a2f2f692e696d6775722e636f6d2f6f65506e484a6e2e6a7067.jpg?1473218711","type":"lecture","do_not_record":false,"start_time":"2016-12-28T13:45:00.000+01:00","end_time":"2016-12-28T14:15:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"\u003cp\u003eMore and more businesses are moving away from monolithic servers and turning to event-driven microservices powered by cloud function providers like AWS Lambda. So, how do we hack in to a server that only exists for \u003ci\u003e60 milliseconds\u003c/i\u003e?\u003c/p\u003e\r\n\r\n\u003cp\u003eThis talk will show novel attack vectors using cloud event sources,  exploitabilities in common server-less patterns and frameworks, abuse of undocumented features in AWS Lambda for persistent malware injection, identifying valuable targets for pilfering, and, of course, how to exfiltrate juicy data out of a secure Virtual Private Cloud. \u003c/p\u003e","speakers":[{"id":1903,"image":"/system/people/avatars/000/001/903/large/me.jpg?1473220761","full_public_name":"Rich Jones","abstract":"Rich Jones develops security, privacy and peer-to-peer file sharing tools. Lately, his work has been on Zappa, the server-less Python framework.\r\n\r\nChampagne, python, explosions, trap music.","description":"Rich Jones is a Bay Area technologist, entrepreneur and journalist. He has been developing free software since 2004 and is extremely passionate about building empowering media tools.\r\n\r\nAs a mobile developer, he has developed applications used by millions of people all around the world, including the first Android BitTorrent client, and OpenWatch, a global police monitoring tool, as well as applications for the American Civil Liberties Union.\r\n\r\nAs as web and backend server developer, he developed Gun.io, a job network for freelance hackers which has handled tens of millions of dollars in payment transfers, and was most recently a founder and backend developer for Kickflip.io, a mobile live video streaming SDK and CDN. He has also worked on numerous peer to peer content delivery systems including the Anomos anonymity system and the DirtyShare filesharing system.\r\n\r\nHe has also worked as a researcher and malware analyst at Harvard Law School's Berkman Center for Internet and Society and is a graduate of Boston University, where he studied Cognitive and Neural Systems.\r\n\r\nHis work has been profiled in Forbes, Wired, on the BBC, as well as in the book This Machine Kills Secrets: How Wikileaks, Cypherpunks, and Hacktivists Aim to Free the World's Information, and he recently appeared as a \"Deep Web\" security expert on the Al-Jazeera America program, America Tonight.\r\n\r\nHe is an American-sounding British national who has visited and worked in many countries around the world, including China, Morocco, Mexico and North Korea.\r\n\r\nHe lives on GitHub: https://github.com/Miserlou/","links":[{"url":"https://github.com/Miserlou","title":"Rich on GitHub"},{"url":"https://kickflip.io","title":"Kickflip"},{"url":"https://gun.io","title":"Gun.io"}]}]},{"id":8263,"guid":"a6b27767-e42d-4610-a8d5-5a1f20587b34","title":"Hacking collective as a laboratory","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T22:00:00.000+01:00","end_time":"2016-12-29T22:30:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"Talk presents findings from sociological investigation on hacking collectives. I will try to answer the question whether hacking collectives are laboratories, as seen by sociology of science. I will also show some peculiar traits of hacking collective, beneficial both for sciences and societies. Perhaps academia needs hackers more than it’s willing to admit? ","speakers":[{"id":6875,"image":null,"full_public_name":"Ezi","abstract":"","description":"","links":[]}]},{"id":8317,"guid":"2f586f3b-5399-496c-ab03-c25ad8ea8cf6","title":"Hacking Reality ","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T16:00:00.000+01:00","end_time":"2016-12-28T17:00:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"Inspired by a long history of bold reality hacks this talk considers the kinds of potentials opening up through emerging Virtual Reality (VR) and Mixed Reality technologies. In this current moment of climate crisis and structural metamorphosis how can we work with powerful immersive technologies to understand our own perceptual systems, to radically communicate and to innovate new ways of being together?","speakers":[{"id":7049,"image":"/system/people/avatars/000/007/049/large/0.jpg?1475268593","full_public_name":"Kate Genevieve ","abstract":"Kate Genevieve is an artist, researcher and educator at chroma.space. At chroma.space she creates media performance, interactive art, urban disruption and games experiments. She's working towards a PHD at the University of Sussex on virtual reality and touch. ","description":"chroma.space projects range from large-scale projections on buildings, intimate performances in deconsecrated churches to outdoors virtual reality events. Recent projects have shown at FACT Liverpool, Brighton Digital Festival, London’s Science Museum, SCANZ 2013, Nimes 2016 and on the streets of Paris during ArtCOP21. Kate is working on a practice-based PHD at the University of Sussex, researching emotions, sensing and virtual reality with joint supervision from the School of Media and the Sackler Centre for Consciousness Science.  This research draws on both indigenous understandings and neuroscience research into how we feel the environment around us. Inspired by cybernetics and ecological thinking, she collaborates across disciplines, bringing in diverse perspectives - from dance to architecture, magic to neuroscience, anthropology to physics - to feel out alternatives on the horizon. chroma.space runs open labs and research, public events and workshops, exhibitions and AV happenings on the potentials that improvisation, creative technologies and open source culture have for transforming how we sense, communicate and receive information.\r\n","links":[{"url":"http://chroma.space/","title":"chroma.space website"},{"url":"https://twitter.com/kategenevieve","title":"twitter"}]}]},{"id":8349,"guid":"60b52369-b0ee-455f-904a-4dfef49596eb","title":"Hacking the World","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T13:00:00.000+01:00","end_time":"2016-12-28T13:30:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"In this lecture I wish to reflect on the maturation of the security and hacking communities and their role in larger societal and political participation. We'll reflect on the predominant role that technology has been growing into our lives, and the responsibilities we have in nurturing it. After having spent the last years in researching, exposing, and preventing the electronic targeting of dissidents and journalists, I hope to synthesize my experience and suggest how to reconsider our tactics, the successes, and the failures, and hopefully draw some inspiration for a brighter future.","speakers":[{"id":5602,"image":"/system/people/avatars/000/005/602/large/team-claudio.jpg?1479050002","full_public_name":"Claudio \"nex\" Guarnieri","abstract":"I'm a hacker, security researcher and civil rights advocate. I research and write on government surveillance and threats to journalists and dissidents worldwide and support human rights organisations with operational security and emergency response.","description":"I'm a security researcher mostly specialized in the analysis of malware, botnets and computer attacks in general. I work as a Technologist and Researcher at Amnesty International, and I'm a Senior Research Fellow at the Citizen Lab, University of Toronto, and a core member of The Honeynet Project. I created the open source malware analysis software Cuckoo Sandbox and Viper and I run the Malwr free service. I published abundant research on botnets and targeted attacks and presented at conferences such as Hack In The Box, BlackHat, Chaos Communication Congress and many more. In recent years I devoted my attention especially to issues of privacy and surveillance and I published numerous articles on surveillance vendors such as FinFisher and HackingTeam with the Citizen Lab as well as on NSA/GCHQ and Five Eyes surveillance capabilities with The Intercept and Der Spiegel. I also contribute to Global Voices Advocacy. I've been selected among the 50 persons of the year 2014 by Wired Italy, I received with the Citizen Lab the EFF Pioneer Award 2015, and I've been selected by Forbes among the 30 Under 30 honorees for 2016. I continuously research and write on government surveillance and threats to journalists and dissidents worldwide and support human rights organisations with operational security and emergency response.","links":[{"url":"https://nex.sx","title":"Website"},{"url":"https://twitter.com/botherder","title":"Twitter"}]}]},{"id":8181,"guid":"c849ebc8-b3b9-49fb-a9a2-ebef217c80b6","title":"Haft für Whistleblower?","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T14:30:00.000+01:00","end_time":"2016-12-28T15:00:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"Der neue Straftatbestand der Datenhehlerei gem. § 202d StGB kriminalisiert Whistleblower und droht mit Haftstrafe bis zu drei Jahren oder Geldstrafe. Das schwächt die Zivilgesellschaft und verhindert wichtige demokratische Aufklärungsprozesse.","speakers":[{"id":6652,"image":null,"full_public_name":"RA Ulrich Kerner","abstract":"Rechtsanwalt Ulrich Kerner, Fachanwalt für Strafrecht\r\nAttorney-At-Law Ulrich Kerner, Bar-Certified Criminal Defense Spezialist","description":"Rechtsanwalt Ulrich Kerner berät und vertritt kritische Blogger, politische Künstlergruppen und Netzaktivisten, aber auch Unternehmer und Unternehmen in Fragen des Polizei- und Ordnungsrechts, Medien- und Presserechts und des Wirtschafts- und Strafrechts. Der Fachanwalt für Strafrecht hat ein besonderes Interesse an den Themen Bürgerrechte und Freiheit des Einzelnen, die von staatlicher Seite seit geraumer Zeit unter dem Deckmantel von Terrorismusgefahr und Gefahr für die innere Sicherheit immer weiter beschnitten werden. So war er einer der Beschwerdeführer gegen den sog. Hackerparagraphen § 202c StGB vor dem Bundesverfassungsgericht. Bevor er sein juristisches Studium begann, war er viele Jahre als freischaffender Musiker tätig. Für das Land Berlin ist er nebenamtlicher Arbeitsgemeinschaftsleiter in der Rechtsreferendarausbildung.\r\n\r\nAttorney-at-Law Ulrich Kerner was founder of a record label and worked as a freelance musician for several years before studying law at Humboldt-University in Berlin. The bar-certified specialist lawyer for criminal defense law has a main interest in civil rights and constitutional law, where we face a rollback under the guise of terrorist threats and inner security. He was one of the suitors against the Hackerparagraph (§ 202c StGB) at the Bundesverfassungsgericht. Besides being a criminal defense lawyer, he advises and represents blogger, artists groups, net activists and corporate clients in the areas of public law, media and press law and civil rights.","links":[{"url":"http://www.anwaltfuerstrafsachen.de","title":"Website: Anwalt für Strafsachen"}]}]},{"id":8270,"guid":"fc64467a-cfb3-40ea-a335-4289aef4d06b","title":"Hebocon","logo":"/system/events/logos/000/008/270/large/hebocon_logo.png?1475265089","type":"performance","do_not_record":false,"start_time":"2016-12-29T23:30:00.000+01:00","end_time":"2016-12-30T00:00:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Join with your derpy bot to fight your nemesis! Push it off the table or knock the enemy over. No weapons. No advanced controllers. No tears. Don't take it serious. ","speakers":[{"id":7033,"image":"/system/people/avatars/000/007/033/large/fraktalmedius.jpg?1475261417","full_public_name":"Konfusius","abstract":"Co founder of IT-Syndikat, likes to work with artists to make awesome stuff together. Software developer to earn a living, tinkerer by heart. Member of Tinkerlab @ arts festival Schmiede.","description":"After listening to CRE 134 I decided that i want a Hackerspace in Innsbruck and found some people already planning one.\r\nBeing a software developer and student, at the Hackerspace I am focusing in organizing events to compensate for social deprivation ;)\r\n\r\nI joined the Schmiede arts festival two years ago to support groups in interactive installations. As part of Tinkerlab we organized two Hebocons last and this year.","links":[{"url":"http://it-syndikat.org/","title":"Hackerspace IT-Syndikat"}]}]},{"id":8139,"guid":"155a622a-196e-4e05-a262-88f3a7726bbe","title":"Hochsicherheits-Generalschlüssel Marke Eigenbau","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T18:30:00.000+01:00","end_time":"2016-12-29T19:30:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Die Verfügbarkeit preiswerter Maschinentechnik und Open Source CAD-Software hat den Aufwand des Herstellens eigener mechanischer Schlüssel signifikant abgesenkt, die wir noch vor zehn Jahren als „sicher“ bezeichnet haben.\r\nKlassische Zylinderschlösser sind in der Vergangenheit bereits ausführlich analysiert worden, doch wie sieht die Situation bei anspruchsvolleren mechanischen Schließsystemen aus?\r\nWir zeigen, wie man den Generalschlüssel einer hoch präzisen, hochpreisigen Schließanlage ermittelt. Weiterhin präsentieren wir unseren Workflow der Software und Mechanik, mit dem man Rohlinge und Schlüssel eines Hochsicherheitssystem mit einer „Low Cost“ CNC-Fräse herstellen kann. Im Gegensatz zum 3D-Drucken bietet uns dies eine deutlich höhere Präzision und mechanische Stabilität - und das für unter 2 Euro pro Schlüssel.","speakers":[{"id":4782,"image":null,"full_public_name":"Michael Weiner","abstract":"Michael is an electrical engineer with focus on embedded systems security. In his free time, he can be spotted in the muCCC where he is getting more and more involved in various aspects of locks.","description":"Michael received his M.Sc. degree in Electrical Engineering and Information Technology in 2012. In his professional life, he is focused on embedded systems development security where he has contributed to real-life security analyses at the TUM (Munich) and UPC (Barcelona). In his private life, he is becoming a lock enthusiast interested in various aspects of mechanical and electronic locks.","links":[]},{"id":3701,"image":null,"full_public_name":"RFguy","abstract":"I'm a member of the Munich CCC chapter and hardware hacker and electronics guy for about 30 years, having fun with mechanical and electronic lock analysis and making RF designs. Main hardware designer of the cccamp 2015 rad1o badge. Also building up infrastructure at congress an cccamp.","description":"Main work in RF Design, received Diplom Ingenieur (FH) in 2009, active in the Munich CCC chapter for infrastructure and a lot of hardware project there.\r\nAnalyzation of mechanical and electronic access control system and locks. \r\nExperience in workshops and courses in lockpicking and electronic and RF design. \r\nTalk at 29C3 \"Open Source Schlüssel und Schlösser\" as \"Jan\". Two talks at Ohm2013 and one 30c3, also involved in rad1o badge design and talk at cccamp 2015","links":[]}]},{"id":8127,"guid":"5a517be2-220b-4eb6-88c3-e7ef08c98ace","title":"How Do I Crack Satellite and Cable Pay TV?","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T12:45:00.000+01:00","end_time":"2016-12-27T13:45:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"Follow the steps taken to crack a conditional access and scrambling system used in millions of TV set-top-boxes across North America. From circuit board to chemical decapsulation, optical ROM extraction, glitching, and reverse engineering custom hardware cryptographic features. This talk describes the techniques used to breach the security of satellite and cable TV systems that have remained secure after 15+ years in use.","speakers":[{"id":6983,"image":null,"full_public_name":"Chris Gerlinsky","abstract":"Chris Gerlinsky is a Canadian hacker whose interest in computers led to his introduction to pay TV security systems twenty years ago. From bulletin boards and analog TV scrambling to smartcards and SOCs, Chris wants to disassemble it all to see how it works.","description":"","links":[]}]},{"id":8099,"guid":"0d02bd82-f771-471c-b4bb-5e24b755b169","title":"How do we know our PRNGs work properly?","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T11:30:00.000+01:00","end_time":"2016-12-29T12:30:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Pseudo-random number generators (PRNGs) are critical pieces of security\r\ninfrastructure. Yet, PRNGs are surprisingly difficult to design,\r\nimplement, and debug. The PRNG vulnerability that we recently found in\r\nGnuPG/Libgcrypt (CVE-2016-6313) survived 18 years of service and several\r\nexpert audits. In this presentation, we not only describe the details of\r\nthe flaw but, based on our research, explain why the current state of\r\nPRNG implementation and quality assurance downright provokes incidents.\r\nWe also present a PRNG analysis method that we developed and give\r\nspecific recommendations to implementors of software producing or\r\nconsuming pseudo-random numbers to ensure correctness.\r\n","speakers":[{"id":6620,"image":"/system/people/avatars/000/006/620/large/vk_new.jpg?1475176852","full_public_name":"Vladimir Klebanov","abstract":"Up to 2016, Vladimir Klebanov was a postdoctoral researcher at Karlsruhe Institute of Technology, developing formal methods for program correctness and information security. Since 2016, he is part of the security testing \u0026 tools group at SAP SE.","description":"","links":[{"url":"http://formal.iti.kit.edu/~klebanov/","title":"Website at KIT"}]},{"id":6621,"image":null,"full_public_name":"Felix Dörre","abstract":"Bachelor student of computer science at KIT, Karlsruhe. Wrote his bachelor's thesis about the verification of Pseudo-Random-Number-Generators.","description":"","links":[]}]},{"id":8083,"guid":"8aaa55ad-b426-4d7a-8d46-f4b34a906eda","title":"How physicists analyze massive data: LHC + brain + ROOT = Higgs","logo":"/system/events/logos/000/008/083/large/logo_full-350.png?1479458993","type":"lecture","do_not_record":false,"start_time":"2016-12-28T12:15:00.000+01:00","end_time":"2016-12-28T12:45:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Physicists are not computer scientists. But at CERN and worldwide, they need to analyze petabytes of data, efficiently. Since more than 20 years now, ROOT helps them with interactive development of analysis algorithms (in the context of the experiments' multi-gigabyte software libraries), serialization of virtually any C++ object, fast statistical and general math tools, and high quality graphics for publications. I.e. ROOT helps physicists transform data into knowledge.\r\n\r\nThe presentation will introduce the life of data, the role of computing for physicists and how physicists analyze data with ROOT. It will sketch out how some of us foresee the development of data analysis given that the rest of the world all of a sudden also has big data tools: where they fit, where they don't, and what's missing.\r\n","speakers":[{"id":6967,"image":"/system/people/avatars/000/006/967/large/avatar-at.jpeg?1479458808","full_public_name":"Axel","abstract":"N. Axel Naumann is an Applied Physicist at CERN, Switzerland. He is currently a lead developer of the ROOT project and responsible for cling, a C++ interpreter. Axel is CERN's representative at the C++ committee (JTC1/SC22/WG21) of the International Standardization Organization (ISO).","description":"Born in Kassel, Germany, on 9 May 1974, he studied Physics and Mathematics at the Westfaelische Wilhelmsuniversitaet in Muenster, Germany, and received a PhD at the University of Nijmegen, The Netherlands. Before coming to CERN, Axel worked at private companies and the Fermi National Accelerator Laboratory (Chicago, USA).\r\n\r\nAxel has given several keynote presentations, for instance at ACCU 2015, CHEP 2013 and a Google Tech Talk. Axel has published work in physics and computing.\r\n","links":[]}]},{"id":8169,"guid":"4bff9cb3-9e91-4305-9029-f4d9053c7b5c","title":"In Search of Evidence-Based IT-Security","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T13:45:00.000+01:00","end_time":"2016-12-28T14:15:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"Applied IT security is largely a science-free field. The IT-Security industry is selling a range of products with often very questionable and sometimes outright ridiculous claims. Yet it's widely accepted practice among users and companies that protection with security appliances, antivirus products and firewalls is a necessity. There are no rigorous scientific studies that try to evaluate the effectiveness of most security products or strategies. Evidence-based IT security could provide a way out of the security nihilism that's often dominating the debate – however it doesn't exist yet.","speakers":[{"id":2462,"image":null,"full_public_name":"hanno","abstract":"Hanno Böck is a freelance journalist and IT security researcher.\r\nHe is a regular writer on the german online IT magazine Golem.de, the newspaper taz and others. He often writes about cryptography and IT security in general. Hanno also runs the Fuzzing Project to improve free software security. This work is supported by the Linux Foundation's Core Infrastructure Initiative.","description":"","links":[{"url":"https://hboeck.de/","title":"Personal webpage"}]}]},{"id":8027,"guid":"8d0aed87-2484-4880-ae08-2dc3c7898959","title":"Intercoms Hacking","logo":"/system/events/logos/000/008/027/large/logointercom.jpg?1479118660","type":"lecture","do_not_record":false,"start_time":"2016-12-28T21:45:00.000+01:00","end_time":"2016-12-28T22:45:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"\u003cp\u003eTo break into a building, several methods have already been discussed, such as trying to find the code\r\npaths of a digicode, clone RFID cards, use some social engineering attacks, or the use of archaic methods\r\nlike lockpicking a door lock or breaking a window.\u003c/p\u003e\r\n\u003cp\u003eNew methods are now possible with recent intercoms.\r\nIndeed, these intercoms are used to call the tenants to access the building. But little study has been\r\nperformed on how these boxes communicate to request and grant access to the building.\u003c/p\u003e\r\n\u003cp\u003eIn the past, they were connected with wires directly to apartments. Now, these are more practical and\r\nallow residents to open doors not only from their classic door phone, but to forward calls to their home\r\nor mobile phone. Private houses are now equipped with these new devices and its common to find these\r\n“connected” intercoms on recent and renovated buildings.\u003c/p\u003e\r\n\u003cp\u003eIn this short paper we introduce the Intercoms and focus on one particular device that is commonly\r\ninstalled in buildings today. Then we present our analysis on an interesting attack vector, which already\r\nhas its own history. After this analysis, we present our environment to test the intercoms, and show some\r\npractical attacks that could be performed on these devices. During this talks, the evolution of our mobile lab and some advances on the 3G intercoms, and M2M intercoms attacks will be also presented.\u003c/p\u003e","speakers":[{"id":5027,"image":null,"full_public_name":"Sebastien Dudek","abstract":"Sébastien Dudek is a security consultant at Synacktiv. His main fields of interest are radio communication technologies and network and software security. He has been a speaker at NoSuchCon, Hack.lu, and Nuit du Hack. He has also contributed for the French magazine MISC and blogged about various security mechanisms.","description":"","links":[{"url":"http://handgrep.se","title":"Website"},{"url":"http://www.synacktiv.com","title":"Company"}]}]},{"id":7880,"guid":"2a9ac911-1072-4672-8fbc-2887f4fd7aec","title":"International exchange of tax information","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T11:30:00.000+01:00","end_time":"2016-12-28T12:00:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"The Common Reporting Standard is a multinational agreement  signed by more than 80 nations, including all EU member states. The signatories promised to exchange bank account information on foreigners.","speakers":[{"id":6746,"image":null,"full_public_name":"taxman","abstract":"Lawyer with an affinity to IT.","description":"I am a lawyer who has worked on several continents and has by accident been thrown into the intricate world of international exchange of tax information. ","links":[]}]},{"id":7942,"guid":"c4211c94-7cea-457d-9214-7ccf5d7c89cc","title":"Interplanetary Colonization","logo":"/system/events/logos/000/007/942/large/640px-Spacecolony1.jpg?1474294764","type":"lecture","do_not_record":false,"start_time":"2016-12-29T21:15:00.000+01:00","end_time":"2016-12-29T21:45:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"The long term survival of the human species requires that we become an interplanetary species. But we must answer two big questions: where are we going, and how do we get there? We explore what scientists know (and don’t know) about humanity’s potential future homes both inside and outside the solar system, and then we’ll dive into the technological challenges of (and potential solutions for) getting humans to and colonizing a new planet.","speakers":[{"id":5459,"image":"/system/people/avatars/000/005/459/large/Telescope_camera_assembly_george_e.jpg?1479118466","full_public_name":"Liz George","abstract":"I am an astrophysicist and astronomical instrument builder. I have spent my career pushing forward technologies to build some of the world's most sensitive instruments for studying the universe.","description":"","links":[]},{"id":5936,"image":"/system/people/avatars/000/005/936/large/peter-lucilens.jpg?1447768652","full_public_name":"Peter Buschkamp","abstract":"After studying Experimental- and Laser-Physics in Bielefeld, I received a PhD in Astrophysics from the Max Planck Institute for extraterrestrial Physics.\r\nI build research instruments for astronomy by day to use them at night. In between, I like to discuss and mull over implications of natural and computer sciences for society, hike the alps and help building the Munich Freifunk backbone.","description":"","links":[]}]},{"id":7811,"guid":"7c3a4ac8-1925-4459-bdd8-b9d9e18a6cfa","title":"Irren ist staatlich","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T21:15:00.000+01:00","end_time":"2016-12-29T21:45:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"Dieses Jahr feiert das Informationsfreiheitsgesetz (IFG) seinen zehnten Geburtstag – und niemand feiert mit. Zeit für eine Abrechnung. FOIA frei!","speakers":[{"id":5605,"image":null,"full_public_name":"Arne Semsrott","abstract":"Arne ist Projektleiter von FragDenStaat.de und arbeitet bei der Open Knowledge Foundation Deutschland.","description":"","links":[{"url":"htttp://FragDenStaat.de","title":"FragDenStaat"}]}]},{"id":8444,"guid":"babc1d56-c3b9-4a21-bfae-af4190c05e93","title":"JODI - Apache is functioning normally ","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T22:00:00.000+01:00","end_time":"2016-12-29T22:30:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Joan Heemskerk and Dirk Paesmans, collectively known as JODI, are rightfully venerated for their countless contributions to art and technology, working as an artistic duo since the mid-90’s. ","speakers":[{"id":7249,"image":null,"full_public_name":"DI","abstract":"","description":"","links":[]},{"id":7250,"image":null,"full_public_name":"JO","abstract":"","description":"","links":[]}]},{"id":8388,"guid":"e4fbbb8d-0b74-4129-83b7-bda2247175bc","title":"Kampf dem Abmahnunwesen","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T16:45:00.000+01:00","end_time":"2016-12-27T17:15:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Im Spannungsfeld zwischen der Vorderfront der Computertechnik und einem Spezialbereich des Urheberrechts hat sich eine Industrie eine Nische geschaffen, in der sie durch Hochspezialisierung und Automatisierung ein einträgliches Geschäft aufgezogen haben. Dabei nehmen sie als Kollateralschaden in Kauf, dass Unschuldige durch die Drohkulisse zum Zahlen bewegt und zum Schließen ihres offenen Netzwerks gebracht werden. Wir beschreiben, was man dagegen tun kann und was wir dagegen schon getan haben.","speakers":[{"id":6784,"image":"/system/people/avatars/000/006/784/large/20160229_123530.jpg?1473848303","full_public_name":"Beata Hubrig","abstract":"","description":"","links":[]},{"id":1544,"image":"/system/people/avatars/000/001/544/large/243.jpg?1360200546","full_public_name":"erdgeist","abstract":"","description":"","links":[]}]},{"id":8408,"guid":"65d150d3-f432-4a36-b3e3-20ee80ad913c","title":"Keys of Fury","logo":"/system/events/logos/000/008/408/large/logo.jpg?1479404200","type":"lecture","do_not_record":false,"start_time":"2016-12-27T19:00:00.000+01:00","end_time":"2016-12-27T19:30:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"Keys Of Fury is a brutalist storytelling about technology and keystrokes where text is used unadorned and roughcast, like concrete. I define my practice as KYBDslöjd (drawing by Type In) who uses the Commodore 64 computer, Teletext technologies and Typewriter. Brutalism has an unfortunate reputation of evoking a raw dystopia and KYBDslöjd evokes an “object of nostalgia”. But nostalgic‬, ‪retro‬, obsolete or ‪limited‬ are rhetoric qualities earn by constant repetition. We live in a time where hardware and software become obsolete before most of the users have learned how to use them or disappear into pure functionality. The obedience to standards who made us passive observers and consumers. ","speakers":[{"id":6356,"image":"/system/people/avatars/000/006/356/large/raquelmeyers.png?1448296090","full_public_name":"raquel meyers","abstract":"Raquel Meyers is a Spanish artist based in Sweden who defines her practice as KYBDslöjd (drawing by typing) with the Commodore 64 computer and Teletext technologies. The grid is the framework and the character set are the instructions. A brutalist storytelling about technology and keystrokes. Since 2004 she has performed at festivals like Transmediale, Fylkingen, Piksel, Mapping, La Casa encendida and Cimatics, at 8bit events like Tokyo Blip Festival and the Playlist exhibition, as well at Liste Art Fair Basel, Ars Electronica Center, Alingsås Konsthall, Bonniers Konsthall, Xpo Gallery, Click New Media Arts Festival, Alt_Cph, BEK- Bergen Center for Electronic Arts, LABoral and iMAL.","description":"","links":[{"url":"http://www.raquelmeyers.com","title":"raquelmeyers.com"},{"url":"http://csdb.dk/scener/?id=22227","title":"AcidT* [CSDb]"}]}]},{"id":7927,"guid":"b092a437-b612-4887-ba55-f08ddfe333b9","title":"Lasers in the sky (with asteroids)","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T22:00:00.000+01:00","end_time":"2016-12-29T22:30:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"At 32C3 we shot lasers into space... now it's lasers in space!\r\nWe look at space- and airborne laser platforms and what practical uses people have come up with (hint: mostly more or less secret communication and military use).  We'll also recap the basic physics and boundaries and check if 'pew pew pew' is really gonna cut it (hint: mostly no). To close, we'll have a look at laser based propulsion for space travel and other speculative applications off the beaten path. ","speakers":[{"id":5936,"image":"/system/people/avatars/000/005/936/large/peter-lucilens.jpg?1447768652","full_public_name":"Peter Buschkamp","abstract":"After studying Experimental- and Laser-Physics in Bielefeld, I received a PhD in Astrophysics from the Max Planck Institute for extraterrestrial Physics.\r\nI build research instruments for astronomy by day to use them at night. In between, I like to discuss and mull over implications of natural and computer sciences for society, hike the alps and help building the Munich Freifunk backbone.","description":"","links":[]}]},{"id":8018,"guid":"c92203a0-9158-4111-ab52-5dacd0e46c73","title":"Law Enforcement Are Hacking the Planet","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T16:00:00.000+01:00","end_time":"2016-12-27T16:30:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"In early 2015, the Federal Bureau of Investigation hacked computers in Austria, Denmark, Chile, Colombia, Greece, and likely the United Kingdom and Turkey too. In all, the agency used a Tor Browser exploit to target over 4000 computers spread across the world based on a single, arguably illegal warrant.","speakers":[{"id":6687,"image":null,"full_public_name":"Joseph Cox","abstract":"Investigative journalist for VICE’s Motherboard, covering hackers, data breaches, and digital security. ","description":"For the past year, I have researched law enforcement’s international use of malware and hacking tools.","links":[]}]},{"id":8072,"guid":"6caf962e-8a5e-4dba-ab7e-d3b6a71dc376","title":"Liberté, Égalité, Fraternité... and privacy ?!","logo":"/system/events/logos/000/008/072/large/logo_nl.png?1475157053","type":"lecture","do_not_record":false,"start_time":"2016-12-29T14:00:00.000+01:00","end_time":"2016-12-29T15:00:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"France is under a state of emergency since November 2015. Several laws and a more intrusive surveillance framework, infringing rights and freedoms, have been adopted these recent years in the name of the fight against terrorism.","speakers":[{"id":6910,"image":null,"full_public_name":"Agnes","abstract":"Legal and policy analysis coordinator at La Quadrature du Net","description":"","links":[{"url":"http://1000grues.eu","title":"1000Grues"},{"url":"https://laquadrature.net","title":"La Quadrature du Net"}]},{"id":6959,"image":null,"full_public_name":"Christopher Talib","abstract":"Campaign Manager at La Quadrature du Net","description":"","links":[]}]},{"id":8087,"guid":"090675f6-f86e-4082-886b-e13c9c837ecb","title":"Lightning Talks Day 2","logo":"/system/events/logos/000/008/087/large/YNMibW_C.jpg?1482827512","type":"lecture","do_not_record":false,"start_time":"2016-12-28T12:45:00.000+01:00","end_time":"2016-12-28T15:00:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Lightning Talks are short lectures (almost) any congress participant may give! Bring your infectious enthusiasm to an audience with a short attention span! Discuss a program, system or technique! Pitch your projects and ideas or try to rally a crew of people to your party or assembly! Whatever you bring, make it quick! ","speakers":[{"id":5263,"image":"/system/people/avatars/000/005/263/large/9156d604276247f1870f0d13020e20bb.png?1448987135","full_public_name":"gedsic","abstract":"","description":"","links":[]},{"id":4601,"image":"/system/people/avatars/000/004/601/large/bigalex.jpeg?1482358962","full_public_name":"bigalex","abstract":"","description":"","links":[]}]},{"id":8088,"guid":"853f2681-504c-45bf-b9af-cbabd005c376","title":"Lightning Talks Day 3","logo":"/system/events/logos/000/008/088/large/YNMibW_C.jpg?1482827532","type":"lecture","do_not_record":false,"start_time":"2016-12-29T12:45:00.000+01:00","end_time":"2016-12-29T15:00:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Lightning Talks are short lectures (almost) any congress participant may give! Bring your infectious enthusiasm to an audience with a short attention span! Discuss a program, system or technique! Pitch your projects and ideas or try to rally a crew of people to your party or assembly! Whatever you bring, make it quick! ","speakers":[{"id":5263,"image":"/system/people/avatars/000/005/263/large/9156d604276247f1870f0d13020e20bb.png?1448987135","full_public_name":"gedsic","abstract":"","description":"","links":[]},{"id":4601,"image":"/system/people/avatars/000/004/601/large/bigalex.jpeg?1482358962","full_public_name":"bigalex","abstract":"","description":"","links":[]}]},{"id":8089,"guid":"c6decee9-310c-40b9-90af-5937df22e1aa","title":"Lightning Talks Day 4","logo":"/system/events/logos/000/008/089/large/YNMibW_C.jpg?1482827548","type":"lecture","do_not_record":false,"start_time":"2016-12-30T12:45:00.000+01:00","end_time":"2016-12-30T15:00:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Lightning Talks are short lectures (almost) any congress participant may give! Bring your infectious enthusiasm to an audience with a short attention span! Discuss a program, system or technique! Pitch your projects and ideas or try to rally a crew of people to your party or assembly! Whatever you bring, make it quick! ","speakers":[{"id":5263,"image":"/system/people/avatars/000/005/263/large/9156d604276247f1870f0d13020e20bb.png?1448987135","full_public_name":"gedsic","abstract":"","description":"","links":[]},{"id":4601,"image":"/system/people/avatars/000/004/601/large/bigalex.jpeg?1482358962","full_public_name":"bigalex","abstract":"","description":"","links":[]}]},{"id":8019,"guid":"8c32309e-7136-4899-8ee4-1558e63ad137","title":"Lockpicking in the IoT","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T21:45:00.000+01:00","end_time":"2016-12-27T22:45:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"\"Smart\" devices using BTLE, a mobile phone and the Internet are becoming more and more popular. We will be using mechanical and electronic hardware attacks, TLS MitM, BTLE sniffing and App decompilation to show why those devices and their manufacturers aren't always that smart after all. And that even AES128 on top of the BTLE layer doesn't have to mean \"unbreakable\". Our main target will be electronic locks, but the methods shown apply to many other smart devices as well...","speakers":[{"id":1562,"image":null,"full_public_name":"Ray","abstract":"Ray's mainly known for only taking questions as an answer, but also is an active lockpicker and electronics hacker.","description":"Besides presenting Hacker Jeopardy for over ten years now, Ray is also known for his presentations about lockpicking. He created the first 3D printed key and used laser cutters to circumvent key control of high security handcuffs. For three years now he is also going for electronic locks, bypassing mechanical actors as well as flashing own firmwares \"just because he can\".","links":[]}]},{"id":8369,"guid":"cb23378b-6db0-4e2f-a4c8-f5006a467ca3","title":"Machine Dreams","logo":"/system/events/logos/000/008/369/large/dream_machine_cutout.jpg?1475521404","type":"lecture","do_not_record":false,"start_time":"2016-12-29T16:00:00.000+01:00","end_time":"2016-12-29T17:00:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"Artificial Intelligence provides a conceptual framework to understand mind and universe in new ways, clearing the obstacles that hindered the progress of philosophy and psychology. Let us see how AI can help us to understand how our minds create the experience of a universe.","speakers":[{"id":4034,"image":"/system/people/avatars/000/004/034/large/joscha.JPG?1384629131","full_public_name":"Joscha","abstract":"AI researcher, cognitive scientist at Harvard Program for Evolutionary Dynamics","description":"Joscha Bach studied computer science and philosophy in Berlin and New Zealand before embarking into Artificial Intelligence. He obtained his PhD in 2008 from the Institute of Cognitive Science in Osnabrück, founded IT companies and works at Harvard University in Boston, USA. He is the author of the cognitive architecture MicroPsi; his main interests involve Artificial General Intelligence and computational models of cognition and motivation.","links":[]}]},{"id":8076,"guid":"80190dbb-bf17-40a0-95e4-18a32bcd37e4","title":"Make the Internet Neutral Again ","logo":"/system/events/logos/000/008/076/large/SaveDtheinternet.jpg?1475159463","type":"lecture","do_not_record":false,"start_time":"2016-12-27T18:15:00.000+01:00","end_time":"2016-12-27T18:45:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"After three years the EU has for the first time new Net Neutrality rules. What do they mean in practice? Which commercial practices by ISPs are allowed and which have to be punished by the telecom regulator. We give an overview about three years of campaign and where we go from here. ","speakers":[{"id":4366,"image":"/system/people/avatars/000/004/366/large/fire.png?1384554661","full_public_name":"Thomas Lohninger","abstract":"Net political activist from Austria with focus on net neutrality and data retention. ","description":"\u003ca href=\"http://socialhack.eu\"\u003eThomas Lohninger\u003c/a\u003e \u003ca href=\"https://twitter.com/socialhack\"\u003e(@socialhack)\u003c/a\u003e, geboren 1986, hat mit der Vorratsdatenspeicherung in Österreich angefangen, sich in der Netzpolitik zu engagieren. Davor war er im LGBT- und Anti-Rassismus-Bereich tätig. Er ist Sprecher des \u003ca href=\"http://akvorrat.at\"\u003eAKVorrat Österreich\u003c/a\u003e, Mitglied der \u003ca href=\"http://netzfreiheit.org\"\u003eInitiative für Netzfreiheit\u003c/a\u003e und arbeitet für die \u003ca href=\"http://okfn.at\"\u003eOpen Knowledge Foundation\u003c/a\u003e. Wenn er keine Netzpolitik macht, programmiert er, podcastet er oder macht Hörspiele. Seine Hauptthemen sind Netzneutralität, Vorratsdatenspeicherung und Open Knowledge.","links":[{"url":"http://socialhack.eu","title":"stuff i do"},{"url":"https://twitter.com/socialhack","title":"@socialhack"},{"url":"https://netzfreiheit.org","title":"Initiative für Netzfreiheit"},{"url":"https://digitalegesellschaft.de","title":"Digitale Gesellschaft"}]},{"id":6959,"image":null,"full_public_name":"Christopher Talib","abstract":"Campaign Manager at La Quadrature du Net","description":"","links":[]}]},{"id":7911,"guid":"143759c6-2cad-4fc8-a120-86dcc8de97e6","title":"Make Wi-Fi fast again","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T20:30:00.000+01:00","end_time":"2016-12-27T21:30:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Mit steigendem Datenaufkommen und einer immer größer werdenden Zahl von Geräten muss auch das WLAN wachsen. Nach \"ur WiFi sucks!!1!\" ist dieser Talk eine kleine Einführung in die Neuerungen, welche mit dem 802.11ac-Standard gekommen sind und gibt eine Erklärung, wie sie funktionieren.","speakers":[{"id":6468,"image":"/system/people/avatars/000/006/468/large/Unifest.jpg?1473785397","full_public_name":"Hendrik Lüth","abstract":"Entropianer, Linux seit 2012, Freifunker, Feuerwehrmann, Amateurfunker, WLAN-Nerd, Elektroniker, Entwickler, WLAN-Admin\r\n","description":"Ich beschäftige mich primär mit Netzwerkinfrastruktur und studiere Elektrotechnik. Nebenbei arbeite ich als HiWi im Rechenzentrum des KIT und bin dort für Support und WLAN zuständig. Ich konfiguriere und verwalte die über 1500 AccessPoints und setze mich dabei auch mit den WLAN-Standards auseinander. Auch plane ich die Festinstallationen in den Hörsälen oder Bibliotheken. Auch durfte ich schon die Gulasch Programmier Nacht mit gutem WLAN versorgen und werde dies auch auf dem 33C3 tun.\u003cbr\u003e\r\nNebenbei bin ich Mitglied in der Freiwilligen Feuerwehr und versuche solchen Hobbys wie Freifunk und Amateurfunk nachzukommen. Wenn dann noch Zeit ist bastel ich auch gerne mal mit Elektronik herum.","links":[{"url":"http://lueth-labs.de","title":"Webseite"}]}]},{"id":7975,"guid":"07a731a0-2c3a-40f1-928e-3f709eb1eccf","title":"Making Technology Inclusive Through Papercraft and Sound","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T16:00:00.000+01:00","end_time":"2016-12-29T17:00:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"The participation of women in computer education is low; undergraduate classrooms in Germany were only 10% female in 2000[1]. The picture at the primary school level is fuzzier, as students do not declare majors at that level, but evidence indicates the trend starts from a young age. Can we make computer education more gender-inclusive? Presenting technology in familiar, non-threatening contexts can lead to more balanced gender participation. For example, Chibitronics uses the context of papercraft to present electronics to beginners; the familiarity of papercraft improves the participation of women of all ages in the creation of electronics. Based on these learnings, we have devised the “Love to Code” platform, an open source hardware-to-cloud stack which combines the familiarity of paper craft with a web-based, driver-free embedded firmware development environment based on FSK audio provisioning via a headphone jack. In this talk, we will dive into the novel open source technical contributions of this platform, which includes the audio-based provisioning protocol and the unique rigid-flex design of the circuitry enabling papercraft integration, as well as the multi-threaded client OS and cloud infrastructure required to complete the picture. This combination of new technology with familiar interfaces aims to lower the barrier to computer education, thus making coding a more accessible and inclusive activity.","speakers":[{"id":3155,"image":null,"full_public_name":"bunnie","abstract":"bunnie loves hardware. He loves to make it, and to break it; he loves the smell of it.","description":"His passion for hardware began in elementary school, and since then he has garnered a PhD at MIT in EE, and has designed nanophotonic silicon chips, wireless radios, consumer electronics, robotic submarines, and other things. He believes hardware is delightful in part because there are no secrets in hardware; you just need a better microscope. Likewise, he is a proponent of open source hardware, and is an active contributor to the ecosystem. At chumby, he designed several open source hardware platforms, some of which had found its way to the shelves of retailers around the world. Recently he helped to create Novena, an open-source hardware and software laptop, and Chibitronics, a new way construct electronics on unconventional materials such as paper using circuit stickers. bunnie is also an educator; he serves as a Research Affiliate for the MIT Media Lab, technical advisor for several hardware startups and MAKE magazine, and shares his experiences manufacturing hardware in China through his blog. He currently lives in Singapore.\r\n","links":[{"url":"https://bunniestudios.com/blog","title":"my blog."}]}]},{"id":8022,"guid":"4c92b3f4-e32a-483b-9e5f-4e8201849284","title":"Memory Deduplication: The Curse that Keeps on Giving","logo":"/system/events/logos/000/008/022/large/memdedup_logo.PNG?1482858644","type":"lecture","do_not_record":false,"start_time":"2016-12-29T12:45:00.000+01:00","end_time":"2016-12-29T13:45:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"We are 4 security researchers who have collectively worked on 3 different attack techniques that all (ab)use memory deduplication in one way or another. There is a cross-vm data leak attack, a cross-vm data write attack, and an in-sandbox (MS Edge) Javascript data leak + full memory read/write attack based in MS Edge.\r\n\r\nIn this talk we detail how memory deduplication works and the many different ways it is exploited in our attacks.","speakers":[{"id":6914,"image":"/system/people/avatars/000/006/914/large/profile_pic.jpg?1474984393","full_public_name":"Ben Gras","abstract":"Ben Gras has been part of the systems security research group at the Vrije Universiteit Amsterdam since 2015. Previously, he was a scientific programmer working on the Minix operating system under Andy Tanenbaum for 10 years. \r\n","description":"","links":[{"url":"www.shrike-systems.com","title":"Personal site"},{"url":"www.vusec.net","title":"Work group site"}]},{"id":7219,"image":"/system/people/avatars/000/007/219/large/kaveh-292x300.jpg?1480018902","full_public_name":"Kaveh Razavi","abstract":"Kaveh Razavi is a security researcher at the Vrije Universiteit Amsterdam in the Netherlands. He is currently mostly interested in reliable exploitation and mitigation of hardware vulnerabilities and side-channel attacks on OS/hardware interfaces. He has previously been part of a CERT team specializing on operating system security, has worked on authentication systems of a Swiss bank, and has spent two summers in Microsoft Research building large-scale system prototypes. He holds a BSc from Sharif University of Technology, Tehran, an MSc from ETH Zurich and a PhD from Vrije Universiteit Amsterdam.","description":"","links":[]},{"id":3239,"image":null,"full_public_name":"brainsmoke","abstract":"","description":"","links":[]},{"id":7216,"image":"/system/people/avatars/000/007/216/large/portrait.jpg?1479934209","full_public_name":"Antonio Barresi","abstract":"Antonio is Co-founder and CEO of xorlab, a Swiss IT security company. Before founding xorlab, he worked at the Laboratory for Software Technology (LST) at ETH Zurich on software security related topics. His research interests are software and systems security. Over the last years he has given talks at different industry and academic security conferences (e.g. Black Hat, Hacktivity, WOOT). Before joining LST, he worked in industry as a Software Engineer, Security Consultant, and IT Risk Officer. He holds a BSc and MSc degree in Computer Science from ETH Zurich.","description":"","links":[{"url":"https://www.xorlab.com","title":"xorlab"},{"url":"http://antoniobarresi.com","title":"Personal website"}]}]},{"id":8020,"guid":"d51d9e44-947b-4a09-94ad-c31c5cf5e5e1","title":"Methodisch inkorrekt!","logo":"/system/events/logos/000/008/020/large/logopodcast.jpg?1474982648","type":"lecture","do_not_record":false,"start_time":"2016-12-30T00:15:00.000+01:00","end_time":"2016-12-30T01:45:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Wer hat diese Jungs wieder reingelassen?! Nicolas Wöhrl und Reinhard Remfort sind eine Gefahr für Leib und Leben. Unter dem Deckmantel der Wissenschaftskommunikation machen sie auf der Bühne alles das, was sie an der Uni nie gewagt hätten.","speakers":[{"id":4984,"image":"/system/people/avatars/000/004/984/large/Nicolas_W%C3%B6hrl.jpg?1443528875","full_public_name":"Nicolas Wöhrl","abstract":"Physicist, working in the field of nanotechnology. Science communicator with his podcast „methodisch inkorrekt“. \r\n\r\nIn love with science!","description":"Profession: Dr. Nicolas Wöhrl is a physicist. He joint the Center of Nanointegration (CENIDE) at the University of Duisburg-Essen where he is working at the Nano Energy Technology Center (NETZ). NETZ is an application-focused research project. The aim of the project is to develop materials and also processes which allow nanotechnology to be used in industry – especially focused on energy applications.\r\n\r\nPassion: Nicolas is a science communicator. He participated in numerous events where current research was presented and explained to the public including science-slams and experimental shows for kids. He is also the founder of the popular scientific podcast „methodisch inkorrekt“ where he is biweekly presenting science news for everybody.\r\n\r\nBelieve: Nicolas believes in science and education and he wants to get the society more involved in the wonders of science. He believes that the scientists themselves have the responsibility to bring back the science to the masses.","links":[{"url":"http://www.methodisch-inkorrekt.de","title":"Podcast"}]},{"id":6387,"image":"/system/people/avatars/000/006/387/large/pui4X9Or-2.jpg?1479383433","full_public_name":"@ReinhardRemfort","abstract":"Für eine flächendeckende Nutellagrundversorgung und die Anerkennung des Löffels als geeignetes Konsumwerkzeug!","description":"Ich wurde in den frühen Morgenstunden des 1. November 1982 im Universitätsklinikum in Essen geboren. 21 Jahre später bin ich dann nach dem Besuch eines katholischen Kindergartens, eines katholischen Gymnasiums wieder an der Uni Essen gelandet, diesmal aber in den Naturwissenschaften. Hier beschäftige ich mich seit meiner Diplomarbeit mit der Erzeugung synthetischer Diamanten und mit zunehmender Begeisterung damit, das beschissene Image der Physik aufzupolieren. Das mache ich im Rahmen von ScienceSlams (deutscher Meister 2013), dem alle zwei Wochen erscheinenden Podcast „methodisch inkorrekt!“, dem Blog Schrödingers Kotze, Experimentiervorträgen für Kinder und Erwachsene, kleineren Moderationen im Fernsehen, der Teilnahme an Fachkonferenzen zur Wissenschaftskommunikation und dem Schreiben eines kleinen Buches bei Ullstein.","links":[{"url":"http://www.minkorrekt.de","title":"Methodisch inkorrekt!"}]}]},{"id":8460,"guid":"cfe31c23-3b1e-4dc3-a7ac-15f538cdfd18","title":"Methodisch inkorrekt! Stream","logo":null,"type":"other","do_not_record":true,"start_time":"2016-12-30T00:15:00.000+01:00","end_time":"2016-12-30T01:45:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"","speakers":[]},{"id":8115,"guid":"a431b8a5-b8af-4ccf-bba2-7b1d88a782fb","title":"Million Dollar Dissidents and the Rest of Us","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T11:30:00.000+01:00","end_time":"2016-12-29T12:30:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"In August 2016, Apple issued updates to iOS and macOS that patched three zero-day vulnerabilities that were being exploited in the wild to remotely install persistent malcode on a target’s device if they tapped on a specially crafted link. We linked the vulnerabilities and malcode to US-owned, Israel-based NSO Group, a government-exclusive surveillance vendor described by one of its founders as “a complete ghost”.","speakers":[{"id":6653,"image":null,"full_public_name":"Bill Marczak","abstract":"","description":"","links":[]},{"id":7208,"image":null,"full_public_name":"John Scott-Railton","abstract":"Senior Researchers at Citizen Lab","description":"","links":[]}]},{"id":8264,"guid":"c06dd4c2-c637-445d-9c72-92204a35eeff","title":"Netzpolitik in der Schweiz 2016","logo":"/system/events/logos/000/008/264/large/buepf_tux.jpg?1479140924","type":"lecture","do_not_record":false,"start_time":"2016-12-27T20:30:00.000+01:00","end_time":"2016-12-27T21:30:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"Ein Überblick zur netzpolitischen Situation in der Schweiz. Wir geben einen umfassenden Rückblick auf das ereignissreiche Jahr 2016, in dem die Schweizer Bevölkerung über gleich zwei Massenüberwachungsgesetze entschieden hat. Die netzpolitischen Gruppierungen haben mit viel Einsatz gegen die Gesetze gekämpft . Wir berichten darüber, wie wir das angengangen sind, wie es ausgegangen ist und was wir dabei gelernt haben.\r\nZudem machen wir einen Ausblick auf kommende netzpolitische Herausforderungen.","speakers":[{"id":6379,"image":"/system/people/avatars/000/006/379/large/p.png?1479140174","full_public_name":"Hakuna MaMate","abstract":"","description":"","links":[{"url":"https://www.digitale-gesellschaft.ch","title":"Digitale Gesellschaft Schweiz"},{"url":"https://www.digitale-gesellschaft.ch/sliv","title":"Visualisierung zur staatlichen Überwachung in der Schweiz"}]}]},{"id":8293,"guid":"c53f6fb8-8fe5-487f-9d5c-15ac56edd6b1","title":"Netzpolitik in Österreich","logo":"/system/events/logos/000/008/293/large/ew_Logo_farbe_L.jpg?1481916567","type":"lecture","do_not_record":false,"start_time":"2016-12-27T21:45:00.000+01:00","end_time":"2016-12-27T22:45:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"Die Netzpolitik der österreichischen Bundesregierung hat sich im Jahr 2016 nicht besser dargestellt als die Jahre davor: Neue Überwachungsgesetze, (bislang erfolgreich verhinderte) Versuche eine staatliche Spionagesoftware  (Bundestrojaner) einzuführen, der ewige Kampf um ein Transparenzgesetz, eine scheinheilige Simulation demokratischer Partizipation und das totglaubte E-Voting sind brennende Themen und bedürfen einer breiten gesellschaftlichen Diskussion. Der AKVorrat zeigt in einem netzpolitischen Jahresrückblick, was wir dagegen tun können und zeigt, dass Zivilgesellschaft wirkt. ","speakers":[{"id":4366,"image":"/system/people/avatars/000/004/366/large/fire.png?1384554661","full_public_name":"Thomas Lohninger","abstract":"Net political activist from Austria with focus on net neutrality and data retention. ","description":"\u003ca href=\"http://socialhack.eu\"\u003eThomas Lohninger\u003c/a\u003e \u003ca href=\"https://twitter.com/socialhack\"\u003e(@socialhack)\u003c/a\u003e, geboren 1986, hat mit der Vorratsdatenspeicherung in Österreich angefangen, sich in der Netzpolitik zu engagieren. Davor war er im LGBT- und Anti-Rassismus-Bereich tätig. Er ist Sprecher des \u003ca href=\"http://akvorrat.at\"\u003eAKVorrat Österreich\u003c/a\u003e, Mitglied der \u003ca href=\"http://netzfreiheit.org\"\u003eInitiative für Netzfreiheit\u003c/a\u003e und arbeitet für die \u003ca href=\"http://okfn.at\"\u003eOpen Knowledge Foundation\u003c/a\u003e. Wenn er keine Netzpolitik macht, programmiert er, podcastet er oder macht Hörspiele. Seine Hauptthemen sind Netzneutralität, Vorratsdatenspeicherung und Open Knowledge.","links":[{"url":"http://socialhack.eu","title":"stuff i do"},{"url":"https://twitter.com/socialhack","title":"@socialhack"},{"url":"https://netzfreiheit.org","title":"Initiative für Netzfreiheit"},{"url":"https://digitalegesellschaft.de","title":"Digitale Gesellschaft"}]},{"id":7207,"image":null,"full_public_name":"Alexander Czadilek","abstract":"Data Protection lawyer and activist.","description":"","links":[]}]},{"id":8116,"guid":"2689ebfe-0d84-4c88-9ea6-5cadad9d4fa4","title":"Nicht öffentlich.","logo":null,"type":"performance","do_not_record":false,"start_time":"2016-12-28T00:15:00.000+01:00","end_time":"2016-12-28T01:15:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Der NSA-Untersuchungsausschuss im Bundestag soll aufklären, was die NSA in Deutschland tut und wie deutsche Geheimdienste in diese Aktivitäten verwickelt sind. Fast wie in einer Gerichtsverhandlung – doch es gibt eine Besonderheit: Der Zeuge ist der BND, ein Geheimdienst. Und der tut alles dafür, nichts zu verraten.\r\n\r\n","speakers":[{"id":5735,"image":null,"full_public_name":"anna","abstract":"Schreibt bei netzpolitik.org zu Datenschutz, Überwachung und allem möglichen, was die Öffentlichkeit nicht wissen soll, aber sollte.","description":"","links":[{"url":"https://netzpolitik.org/author/anna/","title":"anna bei netzpolitik.org"}]},{"id":6349,"image":"/system/people/avatars/000/006/349/large/A-KaiBiermann-klein.jpg?1447939648","full_public_name":"Kai Biermann","abstract":"Diplomierter Psychologe, Journalist, Redakteur im Team Investigativ | Daten bei ZEIT ONLINE, betreibt zusammen mit Martin Haase das Neusprechblog, schreibt Sachbücher, zuletzt über Drohnen.","description":"","links":[{"url":"http://neusprech.org/","title":"Neusprechblog"}]},{"id":6401,"image":"/system/people/avatars/000/006/401/large/Felix_2015_a.jpg?1450466259","full_public_name":"Felix Betzin","abstract":"Felix is a Berlin based podcaster and podcast producer.","description":"In one of his projects he reports together with a team of other observers right from the German parliament’s special inquiry into the highly controversial surveillance practices revealed by Edward Snowden. Germany is to date the only country to have engaged in such a political review of its and others spy-agencies activities.","links":[{"url":"http://technische-aufklaerung.de","title":"Podcast"}]},{"id":7247,"image":null,"full_public_name":"Elisabeth Pleß","abstract":"","description":"","links":[]},{"id":7248,"image":null,"full_public_name":"Johannes Wolf","abstract":"","description":"","links":[]},{"id":3723,"image":"/system/people/avatars/000/003/723/large/UB-CLS.jpg?1428757968","full_public_name":"vieuxrenard","abstract":"Ulf Buermeyer is a lawyer based in Berlin. He's co-founder of GFF (https://freiheitsrechte.org), an NGO that protects civil rights by bringing strategic law suits, e.g. against excessive surveillance by secret agencies. Ulf has been advocating civil rights for over ten years, e.g. as a blogger with netzpolitik.org and as an active member of Digitale Gesellschaft e. V and the CCC.","description":"","links":[{"url":"https://buermeyer.de/ulf/","title":"Homepage"},{"url":"https://twitter.com/vieuxrenard","title":"Twitter"},{"url":"https://freiheitsrechte.org","title":"GFF's Homepage"}]}]},{"id":8344,"guid":"686b1941-b211-4902-b4c4-1d642398e08b","title":"Nintendo Hacking 2016","logo":"/system/events/logos/000/008/344/large/game_over_1.png?1481818206","type":"lecture","do_not_record":false,"start_time":"2016-12-27T20:30:00.000+01:00","end_time":"2016-12-27T21:30:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"This talk will give a unique insight of what happens when consoles have been hacked already, but not all secrets are busted yet.\r\nThis time we will not only focus on the Nintendo 3DS but also on the Wii U, talking about our experiences wrapping up the end of an era.\r\nWe will show how we managed to exploit them in novel ways and discuss why we think that Nintendo has lost the game.","speakers":[{"id":6340,"image":null,"full_public_name":"derrek","abstract":"","description":"","links":[{"url":"https://twitter.com/derrekr6","title":"Twitter"},{"url":"http://3dbrew.org/wiki/Main_Page","title":"3DS wiki"}]},{"id":7068,"image":null,"full_public_name":"nedwill","abstract":"I had a blast playing CTFs for 2 years before I decided I wanted to find bugs in real software. It turns out console hacking is a bigger addiction than video games themselves ever were!","description":"","links":[]},{"id":3416,"image":"/system/people/avatars/000/003/416/large/arrogant.jpg?1478730237","full_public_name":"naehrwert","abstract":"whatever works..","description":"","links":[{"url":"https://twitter.com/naehrwert","title":"twitter"}]}]},{"id":8438,"guid":"65833373-6cae-4f9d-947b-c93a83ff1ba1","title":"No Love for the US Gov.","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T18:30:00.000+01:00","end_time":"2016-12-29T19:30:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Lauri Love has never set foot in the United States, yet he is facing a potential century in jail if extradited for his alleged involvement in #OpLastResort, an Anonymous-related protest action that occurred in response to the death of Aaron Swartz.","speakers":[{"id":7235,"image":"/system/people/avatars/000/007/235/large/IMG_20161204_175253.jpg?1480874191","full_public_name":"Jake Davis","abstract":"Former LulzSec and Anonymous member.","description":"Arrested and banned from the Internet for two years. Now works as a consultant,  writer, and artist around technology, privacy, and security.","links":[]},{"id":7239,"image":null,"full_public_name":"Lauri Love","abstract":"Lauri Alexander Love is a Finnish-British activist charged extraterritorially with stealing data from United States Government computers including the Federal Reserve, the US Army, Missile Defense Agency, and NASA via hacking.","description":"","links":[]},{"id":4905,"image":null,"full_public_name":"Mustafa Al-Bassam","abstract":"Mustafa is a security researcher working on a doctorate at\r\nUniversity College London. He was previously a member of LulzSec, and campaigns for hacktivists who find themselves in difficult\r\npositions, like Lauri Love.","description":"","links":[{"url":"https://musalbas.com","title":"Homepage"},{"url":"https://twitter.com/musalbas","title":"Twitter"}]}]},{"id":8031,"guid":"e204268f-0cea-4a1f-bb38-e7d50496492e","title":"No USB? No problem.","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T16:00:00.000+01:00","end_time":"2016-12-28T17:00:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"How to get USB running on an ARM microcontroller that has no built in USB hardware.  We'll cover electrical requirements, pin assignments, and microcontroller considerations, then move all the way up the stack to creating a bidirectional USB HID communications layer entirely in software.","speakers":[{"id":4376,"image":null,"full_public_name":"Xobs","abstract":"Xobs is a firmware hacker, and enjoys figuring out how hardware and software interact, learning new things, and canoeing.  Occasionally he finds himself thinking C is too high-level a language.","description":"Xobs has always taken things apart to figure out how they work.  From childhood toys to vacuum cleaners, nothing was safe from disassembly  Occasionally he tries to put things back together again, which is always a test of comprehension.\r\n\r\nHe grew up and went to school in San Diego, California.  At university, to an administrative quirk, the school of computing was unavailable, so he earned a degree in cognitive science instead, because people are like squishy computers, right?\r\n\r\nAfter university, he got a job working at chumby Industries, where he met Bunnie.  There, he got his first shot at creating low level device firmware, and figuring out how to create computers from scratch.  He did much the firmware for the chumby One.\r\n\r\nChumby moved him to Singapore, where he did system firmware for the NeTV.  After the end of chumby, he stayed in Singapore, and continues to do system design and integration.\r\n\r\nToday, he spends his days fulfilling a lifelong dream of designing his own laptop.  In his spare time, he goes outrigger canoeing in the ocean.","links":[]}]},{"id":8272,"guid":"7a5971c8-746b-4450-ba89-6569667f77c2","title":"On Smart Cities, Smart Energy, And Dumb Security","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T12:45:00.000+01:00","end_time":"2016-12-29T13:45:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"Smart City is an abstract concept everyone talks about but no one knows what it actually means. No one, except Energy utilities.\r\nIn this talk we will explore the vast world of Smart Energy, and see how energy providers used the \"Smart City\" concept to get better control over our energy consumption, all while almost completely ignoring security aspects along the way.\r\nJoin me and see how Smart Energy is making our lives a little bit better, but also dangerously insecure.","speakers":[{"id":5034,"image":null,"full_public_name":"Netanel Rubin","abstract":"Netanel is a vulnerability researcher that has many significant findings under his belt.","description":"","links":[]}]},{"id":7827,"guid":"7ef9172a-e2c7-4e78-9316-08449bd582c6","title":"On the Security and Privacy of Modern Single Sign-On in the Web","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T18:30:00.000+01:00","end_time":"2016-12-28T19:30:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"\u003cp\u003eMany web sites allow users to log in with their Facebook or Google account. This so-called Web single sign-on (SSO) often uses the standard protocols OAuth and OpenID Connect. How secure are these protocols?  What can go wrong?\u003c/p\u003e\r\n\r\n\u003cp\u003eOAuth and OpenID Connect do not protect your privacy at all, i.e., your identity provider (e.g., Facebook or Google) can always track, where you log in. Mozilla tried to create an authentication protocol that aimed to prevent tracking: BrowserID (a.k.a. Persona). Did their proposition really solve the privacy issue? What are the lessons learned and can we do better?\u003c/p\u003e","speakers":[{"id":6217,"image":null,"full_public_name":"Guido Schmitz (gtrs)","abstract":"Guido Schmitz is a researcher at the University of Trier working in the field of web security. Besides research, he organizes Germany's largest Raspberry Pi conference \"Pi and More\", pushes Trier's hackerspace \"Maschinendeck\" forward, and is a board member of the non-profit IT service organization \"Netzwerkstatt Trier\".","description":"","links":[{"url":"https://gtrs.de","title":"Personal Homepage"}]},{"id":7211,"image":null,"full_public_name":"dfett","abstract":"Infosec researcher at the University of Trier. Modelling the web for fun and profit. Finding bugs in single sign-on from time to time. ","description":"","links":[]}]},{"id":7901,"guid":"cb67ad7f-7e12-4f34-aec0-748a61f3f958","title":"Pegasus internals","logo":"/system/events/logos/000/007/901/large/15319353_1203772349660451_127043702_n.jpg?1480701672","type":"lecture","do_not_record":false,"start_time":"2016-12-27T17:30:00.000+01:00","end_time":"2016-12-27T18:00:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"This talk will take an in-depth look at the technical capabilities and vulnerabilities used by Pegasus. We will focus on Pegasus’s features and the exploit chain Pegasus used called Trident. Attendees will learn about Pegasus’s use of 0-days, obfuscation, encryption, function hooking, and its ability to go unnoticed. We will present our detailed technical analysis that covers each payload stage of Pegasus including its exploit chain and the various 0-day vulnerabilities that the toolkit was using to jailbreak a device. After this talk attendees will have learned all of the technical details about Pegasus and Trident and how the vulnerabilities we found were patched.","speakers":[{"id":6728,"image":"/system/people/avatars/000/006/728/large/Max.png?1479393881","full_public_name":"Max Bazaliy","abstract":"Max Bazaliy is a security researcher at Lookout. He has 10 years of experience in the security research space. Max has experience in code obfuscation, exploit development and security research. Before joining Lookout Max was working in malware research and software protection areas, most recently at Bluebox Security. Currently he is focused on mobile security research, XNU exploitation. Max holds a Master's degree in Computer Science and working on his PhD dissertation.\r\n","description":"Max is a Staff Security Researcher at Lookout who has more than ten years experience in areas as mobile security, security protocols design and analysis, mobile security research, tools and techniques development for vulnerability assessment and post-exploitation, reverse engineering mobile\\desktop platforms and penetration testing.\r\n\r\nPrior to joining Lookout Max was working on code obfuscation and software protection solutions, as well as penetration testing of commercial software protection products.\r\n\r\nIn the past few years, Max was a speaker on various security and engineering conferences, including Black Hat, Defcon, UIKonf, Mobile Optimized, Mobile Central Europe, Mobius and UAMobile.\r\n\r\nMax holds a Masters degree in Computer Science and currently is PhD student at the National Technical University of Ukraine “Kyiv Polytechnic Institute” where he’s working on dissertation in code obfuscation and privacy area.","links":[{"url":"https://twitter.com/mbazaliy","title":"Twitter"}]}]},{"id":8195,"guid":"1efa803c-d280-49f0-bd17-8ec8f28e054f","title":"Predicting and Abusing WPA2/802.11 Group Keys","logo":"/system/events/logos/000/008/195/large/icon.jpg?1482789163","type":"lecture","do_not_record":false,"start_time":"2016-12-27T14:00:00.000+01:00","end_time":"2016-12-27T15:00:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"We analyze the generation and management of WPA2 group keys. These keys protect broadcast and multicast Wi-Fi traffic. We discovered several issues and illustrate their importance by decrypting all group (and unicast) traffic of a typical Wi-Fi network.","speakers":[{"id":5456,"image":null,"full_public_name":"Mathy Vanhoef","abstract":"Mathy Vanhoef is a postdoctoral researcher at KU Leuven (Belgium). He finished his PhD on the security of WPA-TKIP, TLS, and RC4, in July 2016. His research interest is in computer security with a focus on wireless security (Wi-Fi), network protocols in general, the RC4 stream cipher, and software security (discovering and exploiting vulnerabilities). Currently he is researching how to automatically detect logical flaws in network protocol implementations.","description":"Mathy Vanhoef is a postdoctoral researcher at KU Leuven, where he performs research on streamciphers, discovered a new attack on RC4 that made it possible to exploit RC4 as used in TLS in practice (the RC4 NOMORE attack), and found the HEIST attack against TLS. He also focuses on wireless security, where he turns commodity wifi cards into state-of-the art jammers, defeats MAC address randomization, and breaks protocols like WPA-TKIP. He also did research on information flow security to assure cookies don't fall in the hands of malicious individuals. Currently he is researching how to automatically fuzz network protocols, and detect *logical* flaws in implementations (e.g. downgrade attacks). Apart from research, he also knows a thing or two about low-level security, reverse engineering, and binary exploitation. He regularly participates in CTFs with KU Leuven's Hacknamstyle CTF team.","links":[{"url":"https://twitter.com/vanhoefm","title":"Twitter "},{"url":"http://www.mathyvanhoef.com/","title":"Homepage"}]}]},{"id":8040,"guid":"6796635e-2dd6-4f91-8f23-ba1bea7e2994","title":"Privatisierung der Rechtsdurchsetzung","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-30T14:30:00.000+01:00","end_time":"2016-12-30T15:00:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"2016 drehte der Anti-Terror-Kampf in der EU auf. Nicht nur im Rahmen der Anti-Terror-Richtlinie wurde über neue Wege diskutiert, wie man das Netz verstärkt unter Kontrolle bringen kann.","speakers":[{"id":1595,"image":"/system/people/avatars/000/001/595/large/1755.png?1360200558","full_public_name":"Markus Beckedahl","abstract":"Markus Beckedahl blogs at netzpolitik.org and is a founder of Digitale Gesellschaft e. V. (@digiges) and the re:publica-conferences.","description":"Markus Beckedahl has been blogging on netzpolitik.org about politics and the digital society since 2002. Markus is a founding-partner at newthinking GmbH and also co-founder and host of Germany’s largest internet and society conference re:publica.","links":[{"url":"http://www.netzpolitik.org","title":"netzpolitik.org"},{"url":"http://www.twitter.com/netzpolitik","title":"@netzpolitik on Twitter"},{"url":"http://www.digitalegesellschaft.de","title":"Digitale Gesellschaft e. V."},{"url":"http://www.re-publica.de","title":"re:publica"}]}]},{"id":8231,"guid":"855ab830-c6c0-4be7-b84c-31ba78e90e3c","title":"PUFs, protection, privacy, PRNGs","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T22:45:00.000+01:00","end_time":"2016-12-29T23:15:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"A physically unclonable function, or PUF, is some physical structure with properties that are easy to verify, hard to predict, and practically impossible to clone. Ideally, this means it's a device-unique unchanging identifier, which can be used for improving security. However, it can be at odds with privacy and anonymity. This talk will give you an overview of the thirty years of history behind PUFs, and will include the most recent advances in research. The functions, structure, and design will be discussed, as well as devices and materials that have properties to base PUFs on.","speakers":[{"id":7006,"image":null,"full_public_name":"Pol Van Aubel","abstract":"Pol Van Aubel is a frequent attendee of CCC and hacker camps. He's a PhD student in the Digital Security group at Radboud University Nijmegen, the Netherlands, trying to improve the security of industrial control systems with research focusing on efficient anomaly detection for real-time systems. He also does some research on physically unclonable functions.","description":"He teaches courses on software and network security to first- and second-year Bachelor's students. Online he goes by the handle MacGyver, which was once thrust upon him for always carrying a Swiss army knife and duct tape. He is a Hurricane Electric certified IPv6 Sage, loves good coffee, and has many stickers on his laptop.","links":[]}]},{"id":8095,"guid":"994082de-ef8e-4f8e-8c46-ec0eb110b845","title":"radare demystified","logo":"/system/events/logos/000/008/095/large/r2big.png?1475174000","type":"lecture","do_not_record":false,"start_time":"2016-12-29T11:30:00.000+01:00","end_time":"2016-12-29T12:30:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"radare is a libre framework and a set of tools to ease several tasks related to reverse engineering, exploiting, forensics, binary patching, .. this year, the project gets 10 year old.\r\n\r\nIn the process, the design evolved and several new functionalities has appeared, defining better development rules, improving code reviews and introducing RDD and fuzzing as part of the development process. Constant refactoring, writing usage examples and documentation and giving talks, to enlarge the community has been key elements to reach the great user base and health the project lives nowadays.\r\n\r\nThis year, in order to celebrate the 10th anniversary, the author organized the first r2con, a congress around the tool that aims to be an excuse for sharing knowledge, tools, scripts about what different parties and people is doing with it.\r\n\r\nThe congress was pretty successful and allowed to meet developers, users and other interested parties for learning more about the future of the tool and understanding its capabilities.","speakers":[{"id":6971,"image":"/system/people/avatars/000/006/971/large/me.jpg?1475172693","full_public_name":"pancake","abstract":"","description":"","links":[{"url":"http://rada.re","title":"radare"}]}]},{"id":8248,"guid":"bc9fff95-ca0f-4448-9c4c-875609353da7","title":"Rebel Cities","logo":"/system/events/logos/000/008/248/large/IMG_3259.JPG?1481097468","type":"lecture","do_not_record":false,"start_time":"2016-12-30T13:45:00.000+01:00","end_time":"2016-12-30T14:15:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"Cities are emerging as a space for local action and local change but also as dangerous spaces where social engineering, exclusion by design and privatised policing take place rapidly, without adequate frames to catch up and assure fundamental rights. Is the city the answer to a new digital ecosystem, with effective mechanisms to enforce it, in the local government powers?","speakers":[{"id":3560,"image":"/system/people/avatars/000/003/560/large/Renata_Avila_Profile_%281%29.jpg?1475147915","full_public_name":"renataavila","abstract":"Renata Avila is a human rights lawyer specialised in Intellectual Property and Technology. She worked as one of the lawyers representing the Guatemalan Nobel Peace Prize Laureate Rigoberta Menchu Tum and more recently, Julian Assange and Wikileaks.","description":"Involved in Internet and Human Rights research since 2006, she worked with the Web Inventor Sir Tim Berners-Lee in an effort to uphold human rights in the digital age. She serves as a Board Member of Creative Commons. She is also a member of Courage Foundation advisory board, assisting whistleblowers at risk and in the BITS initiative for sovereign technologies of the municipality of Barcelona.  She is currently exploring Digital Colonialism. \r\n\r\nRenata Avila holds an LLM from the University of Turin and advanced studies in International Law by the Hague Academy. She worked as one of the lawyers representing the Guatemalan Nobel Peace Prize Laureate Rigoberta Menchu Tum and litigated several cases involving digital rights in Latin America and Europe. She was one of the leading researcher for the Open Net Project, at the Berkman Klein Center for Internet and Society at Harvard University. She was one of the pioneer researchers exploring the uses of technology for transparency and its importance for users and consumers. She worked for three years with the Web Inventor Sir Tim Berners-Lee in an effort to uphold human rights in the digital age and popularize the struggle for the Open Internet among common people, co-leading and supporting efforts like the Web We Want Festival and My Digital Rights, by the British Library. She is also the human rights advisor for the European Fundamental Rights Agency Project on Biometrics and refugees. She is currently an Advisor of the BITS initiative by the Municipality of Barcelona and exploring the concept of digital colonialism, subject of her upcoming book. She is part of the cast of ForEveryone.net, a film exploring the future of the Web.\r\n\r\nRenata Avila ist Menschenrechtsanwältin mit dem Spezialgebiet geistiges Eigentum (Intellectual Property) und Technologie. Sie hat einen LL.M. von der Universität Turin und hat weiterführende Studien in International Law an der Haager Akademie absolviert. Sie arbeitete als eine der AnwältInnen, die die guatemaltekische Friedensnobelpreisträgerin Rigoberta Menchu Tum repräsentierten; dazu prozessierte sie sowohl in Lateinamerika also auch in Europa eine Anzahl Fälle, in denen digitale Rechte ein Thema waren. Sie ist seit 2006 an Internet- und Menschenrechtsforschung beteiligt und war eine der leitenden ForscherInnen für das Open Net Projekt, basiert im Berkman-Klein-Zentrum für Internet und Gesellschaft an der Harvard University. Sie war eine der bahnbrechenden ForscherInnen, die die Anwendung von Technologie zum Schaffen von Transparenz und ihre Bedeutung für Nutzer und Verbraucher erforschten. Sie arbeitete drei Jahre lang mit dem Web-Erfinder Sir Tim Berners-Lee in dem Bemühen, die Menschenrechte im digitalen Zeitalter zu wahren und den Kampf um das offene Netz in der Allgemeinheit zu popularisieren. Dabei hat sie Projekte wie das ‘Web We Want’ Festival und ‘My Digital Rights’  von der British Library mitgeleitet und unterstützt. Sie dient als Vorstandsmitglied von Creative Commons. Sie ist auch Beiratsmitglied der Courage Foundation, die gefährdete Informanten unterstützt, und des D-Cent Board, das das Potenzial von dezentralen Technologien erforscht. Sie ist auch die Menschenrechtsberaterin für die Europäische Agentur für Grundrechte, hier insbesondere für das Projekt über Biometrics und Flüchtlinge. Sie ist zur Zeit Beraterin der BITS-Initiative der Gemeinde Barcelona und untersucht das Konzept des digitalen Kolonialismus, auch Thema ihrer bevorstehendenden Buches. Sie ist Teil der Besetzung von ForEveryone.net, ein Film über die Zukunft des Webs.\r\n\r\n","links":[]}]},{"id":8074,"guid":"56b62043-b92d-4b32-b5d0-b78d8fbcbb24","title":"Recount 2016: An Uninvited Security Audit of the U.S. Presidential Election","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T14:30:00.000+01:00","end_time":"2016-12-28T15:30:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"The 2016 U.S. presidential election was preceded by unprecedented cyberattacks and produced a result that surprised many people in the U.S. and abroad.  Was it hacked?  To find out, we teamed up with scientists and lawyers from around the country\u0026mdash;and a presidential candidate\u0026mdash;to initiate the first presidential election recounts motivated primarily by e-voting security concerns.  In this talk, we will explain how the recounts took place, what we learned about the integrity of the election, and what needs to change to ensure that future U.S. elections are secure.\r\n","speakers":[{"id":6963,"image":"/system/people/avatars/000/006/963/large/mockbikepic.jpg?1482357403","full_public_name":"Matt  Bernhard","abstract":"I'm a second year computer science Ph.D. student at the University of Michigan with Professor Alex Halderman. My research interests focus on the broad social implications of technology and privacy, delving into computer security, cryptography, networks, usability, censorship, systems, and voting technology. ","description":"","links":[{"url":"mbernhard.com","title":"website"},{"url":"https://twitter.com/umbernhard","title":"@umbernhard"}]},{"id":4228,"image":"/system/people/avatars/000/004/228/large/halderman_um14-sm.jpg?1416683700","full_public_name":"J. Alex Halderman","abstract":"I’m a professor of computer science at the University of Michigan and Director of Michigan’s Center for Computer Security and Society.  \u003ca href=\"https://jhalderm.com\"\u003eMy research\u003c/a\u003e spans software security, network security, privacy, anonymity, electronic voting, and censorship resistance.  I've uncovered problems in e-voting systems in the U.S., Estonia, India, and Australia.  I was part of the teams that discovered the TLS \u003ca href=\"https://weakdh.org\"\u003eLogjam\u003c/a\u003e and \u003ca href=\"https://drownattack.com\"\u003eDROWN\u003c/a\u003e vulnerabilities.  My recent projects include \u003ca href=\"https://letsencrypt.org\"\u003eLet's Encrypt, \u003ca href=\"https://decoyrouting.com\"\u003eDecoy Routing\u003c/a\u003e, \u003ca href=\"https://zmap.io\"\u003eZMap\u003c/a\u003e, and \u003ca href=\"https://censys.io\"\u003eCensys\u003c/a\u003e.\r\n\r\n","description":"","links":[{"url":"https://jhalderm.com","title":"J. Alex Halderman's Web Site"}]}]},{"id":8238,"guid":"fc6c53de-ec9d-4966-a912-5cfaf54c0dd2","title":"Retail Surveillance / Retail Countersurveillance","logo":"/system/events/logos/000/008/238/large/50mu.png?1475259394","type":"lecture","do_not_record":false,"start_time":"2016-12-30T13:00:00.000+01:00","end_time":"2016-12-30T13:30:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"From geo-magnetic tracking for smartphones to facial recognition for email marketing, from physical shopping cart fingerprinting to computer vision algorithms that use your clothing as metadata, this talk will explore the emerging landscape of hyper-competitive retail surveillance. Instead of dramatizing these technologies which can lead to calcification and normalization, the aim of this talk is to energize discourse around building creative solutions to counter, adapt to, or rethink emerging surveillance technologies.","speakers":[{"id":7024,"image":"/system/people/avatars/000/007/024/large/image.jpeg?1475257753","full_public_name":"Adam Harvey","abstract":"Adam Harvey is an artist and independent researcher based in Berlin. His work investigates the convergence of surveillance, privacy, and data analysis technologies. Past projects include CV Dazzle (2010), Stealth Wear (2013), Privacy Gift Shop (2013), and SKYLIFT (2016).","description":"Harvey investigates the potential for anti-surveillance concepts to help navigate a world of mass surveillance. He is a graduate of New York University where he created CV Dazzle, camouflage from face detection. His counter-surveillance projects have appeared in the New York Times, Der Spiegel, BBC, the Air Force Times, and in a tweet from the Pentagon.\r\n\r\nCurrently, he lives and works in Berlin on developing new products for the Privacy Gift Shop, an online marketplace for countersurveillance and art.","links":[{"url":"https://ahprojects.com","title":"ahprojects.com"}]}]},{"id":8399,"guid":"f75d0531-ac47-4edd-99bd-9eadd836982a","title":"Reverse engineering Outernet","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T11:30:00.000+01:00","end_time":"2016-12-27T12:30:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"\u003ca href=\"https://outernet.is\"\u003eOuternet\u003c/a\u003e is a company whose goal is to ease worldwide access to internet contents by broadcasting files through geostationary satellites. Most of the software used for Outernet is open source, but the key parts of their receiver are closed source and the protocols and specifications of the signal used are secret. I have been able to \u003ca href=\"http://destevez.net/tag/outernet/\"\u003ereverse engineer\u003c/a\u003e most of the protocols, and a functional \u003ca href=\"https://github.com/daniestevez/free-outernet\"\u003eopen source\u003c/a\u003e receiver is now available.","speakers":[{"id":7133,"image":null,"full_public_name":"Daniel Estévez","abstract":"Currently finishing a PhD in pure Mathematics. Also have a background in Computer Science. Amateur Radio operator since 2014. Interest in decoding Amateur Radio satellites since 2015.","description":"","links":[{"url":"http://destevez.net","title":"Blog"},{"url":"https://github.com/daniestevez","title":"Github"}]}]},{"id":8024,"guid":"fc959f0c-5e93-4b23-8a63-5b6478adb700","title":"Routerzwang und Funkabschottung","logo":"/system/events/logos/000/008/024/large/rz_lego-techy_quad.jpg?1474989825","type":"lecture","do_not_record":false,"start_time":"2016-12-27T17:30:00.000+01:00","end_time":"2016-12-27T18:00:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Nach drei Jahren wurde endlich die nutzerunfreundliche Praxis des Routerzwangs („Compulsory Routers“) gesetzlich für unzulässig erklärt, und aktuell treibt uns die EU-Funkabschottung („Radio Lockdown Directive“) um. Um was geht es dabei? Und was können wir daraus für andere Fälle lernen?","speakers":[{"id":6918,"image":"/system/people/avatars/000/006/918/large/me-avatar.jpg?1474986660","full_public_name":"Max Mehl","abstract":"Max Mehl is Germany Coordinator of the Free Software Foundation Europe (FSFE). His working field is German and European policy and public awareness for Free Software and user rights.","description":"In recent years he was active around the Compulsory Routers case in Germany, EU Radio Lockdown Directive, „I love Free Software“ day, DRM, or FSFE’s „Free Your Android“ campaign.","links":[{"url":"https://fsfe.org/about/mehl/","title":"FSFE Profile"}]}]},{"id":8135,"guid":"094b6119-b261-4750-89cf-43fed50eb679","title":"Saving the World with (Vegan) Science","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T21:15:00.000+01:00","end_time":"2016-12-29T21:45:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Describing the science behind new high tech vegan foods which will replace animal agriculture. I will also discuss the potential impact to lessen the severity of climate change and give an update on the Real Vegan Cheese biohacker project.","speakers":[{"id":5425,"image":"/system/people/avatars/000/005/425/large/IMG_20150127_181346.jpg?1428853717","full_public_name":"Benjamin Rupert","abstract":"Chemist working on energy storage and Real Vegan Cheese","description":"I am a PhD chemist who has worked on energy storage, solar energy, and technologies related to nuclear disarmament.  I am also an animal rights activist and biohacker working on producing milk proteins in yeast in order to make vegan cheese which is identical to the animal derived version. Also the author of a popular paper describing turning methamphetamine in to sudafed.","links":[{"url":"http://meowdip.heterodoxy.cc/about/","title":"Personal Page"},{"url":"http://heterodoxy.cc/meowdocs/pseudo/pseudosynth.pdf","title":"Synthesis of Sudafed from Meth"}]}]},{"id":7963,"guid":"c45fa431-69f9-47db-a90c-fb596efdcb55","title":"Searchwing - Mit Drohnen leben retten","logo":"/system/events/logos/000/007/963/large/14726308_1208926132479694_5138167602106859520_n.jpg?1479920421","type":"lecture","do_not_record":false,"start_time":"2016-12-28T17:15:00.000+01:00","end_time":"2016-12-28T18:15:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Refugees are dying in the Mediterranean Sea. Thousands of them. \r\nWe are building fixed wing drones, autonomously searching for refugee-vessels in a radius of 50km around a base-ship. \r\nThe association \"Seawatch e.V.\" has bought two well equipped Ships to help and rescue those people. But to help them we first have to find them.","speakers":[{"id":6266,"image":null,"full_public_name":"Steini","abstract":"Member of CCC Berlin since... well... don't know, feels like 'ever'. \r\nDid some virtual reality stuff in the 90s, founded some IT startups in the 2000s, now trying to live a dream by helping to create 'Holzmarkt' in Berlin. \r\nStudied physics and mathematics, but I am not a real physicist or mathematician at all.  \r\n","description":"","links":[]},{"id":7110,"image":"/system/people/avatars/000/007/110/large/Neugebauer_20150322_5901-200x200.jpg?1476096579","full_public_name":"Ruben Neugebauer","abstract":"Ruben Neugebauer is Journalist @jib-collective, Artivist with peng collective and co-funder of the NGO-Sea-Watch.","description":"","links":[{"url":"https://www.sea-watch.org","title":"Sea-Watch"},{"url":"https://www.jib-collective.net","title":"Jib"},{"url":"https://pen.gg","title":"Peng"}]},{"id":4231,"image":"/system/people/avatars/000/004/231/large/14119350505278539093.png?1481826795","full_public_name":"benthor","abstract":"","description":"","links":[]}]},{"id":8413,"guid":"25e2df7d-5740-4c2f-bc34-986326d606fe","title":"Security Nightmares 0x11","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-30T17:15:00.000+01:00","end_time":"2016-12-30T18:15:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Was hat sich im letzten Jahr im Bereich IT-Sicherheit getan? Welche neuen Entwicklungen haben sich ergeben? Welche neuen Buzzwords und Trends waren zu sehen?","speakers":[{"id":1633,"image":"/system/people/avatars/000/001/633/large/9.jpg?1360200570","full_public_name":"frank","abstract":"Spokesperson of the Chaos Computer Club and expert on secure communications","description":"","links":[{"url":"https://duckduckgo.com/?q=frank+rieger+ccc","title":"everything you need to know"},{"url":"http://frank.geekheim.de/","title":"blog"}]},{"id":384,"image":"/system/people/avatars/000/000/384/large/129.jpg?1360200314","full_public_name":"Ron","abstract":"","description":"","links":[]}]},{"id":8398,"guid":"5ae90a09-0b83-4357-bdb4-9afc04100c68","title":"Shining some light on the Amazon Dash button","logo":"/system/events/logos/000/008/398/large/messowires.jpg?1476689522","type":"lecture","do_not_record":false,"start_time":"2016-12-28T23:00:00.000+01:00","end_time":"2016-12-29T00:00:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"This talk will explore the hard- and software of the Amazon Dash button.","speakers":[{"id":5233,"image":"/system/people/avatars/000/005/233/large/znuh.jpg?1438364649","full_public_name":"hunz","abstract":"mostly hardware hacking","description":"","links":[]}]},{"id":7969,"guid":"74783236-46f4-493c-9574-1b27a44847b7","title":"Shut Up and Take My Money!","logo":"/system/events/logos/000/007/969/large/cube_flat-money_square.png?1480726610","type":"lecture","do_not_record":false,"start_time":"2016-12-27T16:45:00.000+01:00","end_time":"2016-12-27T17:15:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"FinTechs increasingly cut the ground from under long-established banks’ feet. With a \"Mobile First\" strategy, many set their sights on bringing all financial tasks—checking the account balance, making transactions, arranging investments, and ordering an overdraft—on your smartphone. In a business area that was once entirely committed to security, Fintechs make a hip design and outstanding user experience their one and only priority. Even though this strategy is rewarded by rapidly increasing customer numbers, it also reveals a flawed understanding of security. With the example of the pan-European banking startup N26 (formerly Number26), we succeeded independently from the used device to leak customer data, manipulate transactions, and to entirely take over accounts to ultimately issue arbitrary transactions—even without credit.","speakers":[{"id":5995,"image":"/system/people/avatars/000/005/995/large/IMG_0531.JPG?1482053132","full_public_name":"Vincent Haupert","abstract":"Vincent Haupert is a research associate at the Security Research Group  of the Department of Computer Science at the Friedrich-Alexander University of Erlangen-Nuremberg (FAU), Germany. His main interests are authentication, system security and software protection of mobile devices.","description":"","links":[{"url":"https://www1.cs.fau.de/staff/haupert","title":"Security Research Group at the Friedrich-Alexander University Erlangen-Nürnberg"}]}]},{"id":7904,"guid":"4de841b2-0f34-494e-ba5b-0b79ba2c88cd","title":"Software Defined Emissions","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T20:30:00.000+01:00","end_time":"2016-12-27T21:30:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"A technical talk on how to reverse-engineer electronic control units in order to document what was left apparently intentionally undocumented by the vendor – including how Volkswagen tweaked their cycle detection code while already being investigated by the EPA, how different the Volkswagen approach is really to the rest of the industry, and of course some trivia on how the „acoustic function“ got its name.","speakers":[{"id":1380,"image":"/system/people/avatars/000/001/380/large/ccc-domke-3637568103225989868.jpg?1482067805","full_public_name":"Felix „tmbinc“ Domke","abstract":"Loves to work on embedded devices’ software, even though most devices don’t love working with him. Studied electronic engineering, but is mostly a software person. Works for a company (a major one).","description":"Was never interested in internal combustion engines until curiosity about Volkswagen’s defeat device struck. ","links":[]}]},{"id":7958,"guid":"e4eb4104-b9e7-4e99-bcb2-d10ddff3e19a","title":"Space making/space shaping","logo":"/system/events/logos/000/007/958/large/rundgaenge001_detail_thump.jpg?1479331460","type":"lecture","do_not_record":false,"start_time":"2016-12-27T16:00:00.000+01:00","end_time":"2016-12-27T16:30:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"What are the politics and aesthetics of mapping? An introduction how cartography shapes cities and landscapes, creates borders and determines the perception of our environment. How an evolving mix of high-resolution satellite imagery, algorithm-based mappings and the huge amount of data of digitized cities will enhance these effects? And in contrast, how can maps be designed, that question the “objectivity” and “correctness” of conventional cartography?\r\n","speakers":[{"id":6849,"image":"/system/people/avatars/000/006/849/large/gpzVN761.jpg?1475166680","full_public_name":"Ulf Treger","abstract":"Working and living in Hamburg, I am doing research, projects and collaborations on cities, public space and digital communications.","description":"","links":[{"url":"www.dekoder.de","title":"website"}]}]},{"id":7912,"guid":"c300b194-2a85-4705-92aa-b4e789882303","title":"SpiegelMining – Reverse Engineering von Spiegel-Online","logo":"/system/events/logos/000/007/912/large/spiegelmining_logo_ccc.png?1479141333","type":"lecture","do_not_record":false,"start_time":"2016-12-28T21:45:00.000+01:00","end_time":"2016-12-28T22:45:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"Seit Mitte 2014 hat David fast 100.000 Artikel von Spiegel-Online systematisch gespeichert. Diese Datenmasse wird er in einem bunten Vortrag vorstellen und erforschen.","speakers":[{"id":5240,"image":"/system/people/avatars/000/005/240/large/dkr-001-5699.jpg?1481807302","full_public_name":"David Kriesel","abstract":"David is a computer scientist. He has a passion for biology and social insects. In real life, he works as a Data Science, Machine Learning and DevOps professional.","description":"In computer science, especially the biology inspired topics like neurocomputation, machine learning, text mining and swarm behavior make his day; He also wrote a 250p ebook („A Brief Introduction To Neural Networks“) which he made available for free at his home page in German and English language. \r\n\r\nDavid gained quite a bit of international recognition „Xerox Scanning Bug“ to public attention, followed by consequently forcing its correction. \r\n\r\nHe studied in Bonn, Germany, where he also lived for nearly ten years; further living places include Brussels and Ithaca, New York (the latter because of a research stay at Cornell University). ","links":[{"url":"http://www.dkriesel.com","title":"Homepage and Blog"},{"url":"http://www.dkriesel.com/en/xerox","title":"Xerox Scanning Bug (English)"},{"url":"http://www.dkriesel.com/xerox","title":"Xerox Scanning Bug (German)"}]}]},{"id":7873,"guid":"a57b8f0e-62ae-48d9-aa89-5ebfe5fdc056","title":"SpinalHDL : An alternative hardware description language","logo":"/system/events/logos/000/007/873/large/logo3.PNG?1479221750","type":"lecture","do_not_record":false,"start_time":"2016-12-28T21:45:00.000+01:00","end_time":"2016-12-28T22:45:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"Since too long we use VHDL and Verilog to describe hardware. SpinalHDL is an alternative language which does its best to prove that it is time to do a paradigm shift in hardware description.","speakers":[{"id":6736,"image":"/system/people/avatars/000/006/736/large/github.png?1479318789","full_public_name":"Dolu1990","abstract":"FPGA lover !","description":"I'm a young engineer of 26 years old. I learned FPGA by myself at the age of 18.\r\nNow, after my M.Sc in industrial technologies and some experiences in thecGPU team of Imagination Technologies, I'm working full time (as independent) on the elaboration of a new hardware description language.","links":[]}]},{"id":8068,"guid":"2b9b6095-9dcd-49f3-9792-cf74aab88b16","title":"State of Internet Censorship 2016","logo":"/system/events/logos/000/008/068/large/sick-2016.png?1475151368","type":"lecture","do_not_record":false,"start_time":"2016-12-28T20:30:00.000+01:00","end_time":"2016-12-28T21:30:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"2016 has been marked by major shifts in political policy towards the Internet in Turkey and Thailand, a renegotiation of the responsibilities of content platforms in the west, and a continued struggle for control over the Internet around the world. Turbulent times, indeed. In this session, we'll survey what's changed in Internet surveillance and censorship in the last year, and provide context for the major changes affecting the net today.","speakers":[{"id":4821,"image":"/system/people/avatars/000/004/821/large/profile-dprk.jpg?1435685197","full_public_name":"Will Scott","abstract":"Web Hacker.","description":"I am a phd from the networks lab at the University of Washington. I've also spent time over the last three years teaching computer science in pyongyang.\r\n\r\nMy research centers on how to make a more resilient web, through working with in-browser peer-to-peer and caching, and applying operating systems lessons to web frameworks.\r\n\r\nI've been a ski instructor, rode the transsiberian railroad to CCC, speak some chinese, and enjoy playing with fire.","links":[{"url":"https://wills.co.tt","title":"blog"},{"url":"https://twitter.com/willscott","title":"twitter"}]},{"id":6007,"image":"/system/people/avatars/000/006/007/large/me.png?1482100810","full_public_name":"Philipp Winter","abstract":"I work on computer networks and security. I seek to build usable, secure, and privacy-preserving services.","description":"","links":[{"url":"https://twitter.com/__phw","title":"Twitter"},{"url":"https://nymity.ch","title":"Homepage"}]}]},{"id":8136,"guid":"9e02145e-1d65-4398-b8e2-bd4c1faee0fa","title":"Stopping law enforcement hacking","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T18:30:00.000+01:00","end_time":"2016-12-28T19:30:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"We didn’t win the second crypto wars. Governments merely made a strategic retreat and they’ll be back. Although they will likely give up on trying to regulate or prohibit encryption, we should expect that malware and law enforcement hacking will play a starring role in the next battle in the crypto wars.","speakers":[{"id":5627,"image":null,"full_public_name":"Christopher Soghoian","abstract":"Dubbed the „Ralph Nader of the Internet“ by Wired and one of Politico’s top „thinkers, doers and visionaries transforming American politics“, Christopher Soghoian is „the most prominent of a new breed of activist technology researchers“ (The Economist), „who have risen to prominence by showing how tedious technical flaws can affect ordinary people“.","description":"Soghoian is the Principal Technologist with the Speech, Privacy, and Technology Project at the American Civil Liberties Union. He is also a Visiting Fellow at Yale Law School’s Information Society Project and a TED Senior Fellow.\r\n\r\nSoghoian completed his Ph.D. at Indiana University in 2012, which focused on the role that Internet and telephone companies play in enabling government surveillance of their customers.","links":[]}]},{"id":7978,"guid":"8fbee7ff-b50c-4310-af9d-d44794669f25","title":"Surveilling the surveillers","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-30T17:15:00.000+01:00","end_time":"2016-12-30T18:15:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"In the last years, technology-savvy artists and technologists have taken over the art world with works addressing current societal and political issues. Their works are located at the intersection between art, technology and activism and are dealing with a variety of problems like free speech, freedom of movement, military and governmental power, corporate and governmental surveillance to name just a few. This talk will present relevant works in this field and will draw connections between critical art and regulatory power, warfare, surveillance, electronic waste, electronic self-defense and the re-appropriation of architectural and technological artifacts in militant ways.","speakers":[{"id":4106,"image":"/system/people/avatars/000/004/106/large/1633small.png?1474796688","full_public_name":"mare","abstract":"I am a media artist and independent researcher living and working in Berlin with interest in space, perception, digitization, digital anthropology, power relations and minimal aesthetics.\r\nI collaborate with researchers, artists and galleries worldwide.","description":"Formally educated as a computer scientist at Karlsruhe Institute of Technology, Germany, I became a student of media art of Michael Bielicky at Karlsruhe University of Arts and Design. Today I am a self-employed media artist and independent researcher living and working in Berlin with interest in space, perception, digitization phenomena, digital anthropology, power relations and minimalistic aesthetics. My work addresses issues such as international power networks, religion, changes in the human condition through technology, mass surveillance and electronic and physical warfare.\r\n\r\nI have created interactive installations, sculptures, video works and experimental computer games for festivals, museums and galleries worldwide, including the Moscow International Biennale for Young Art, ZKM Museum of Media Art, ZKM Museum of Contemporary Art, Athens Digital Art Festival, INCUBARTE Art Festival Valencia, ETDM Estonian Museum of Applied Art and Design Tallinn and A MAZE. Festival Berlin.\r\n\r\nI give talks and workshops on minimalistic human-computer interaction and on how to exfiltrate data out of surveilled networks. My latest theoretical book, \"Real Virtuality\" is an edited anthology on theory and applications of virtual spaces.","links":[{"url":"http://martinreiche.com","title":"Website"}]}]},{"id":7909,"guid":"e0758eb2-0282-40d7-9c41-de607eb3d494","title":"Syrian Archive","logo":"/system/events/logos/000/007/909/large/TSA2.jpg?1473779744","type":"lecture","do_not_record":false,"start_time":"2016-12-28T12:15:00.000+01:00","end_time":"2016-12-28T12:45:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"Journalists and human rights groups need to find and use verified visual evidence in order to accurately report about what’s happening in conflict zones. In the case of Syria, there are more hours of online footage online than there have been hours of conflict.","speakers":[{"id":6068,"image":null,"full_public_name":"Jeff Deutch","abstract":"The Syrian Archive is a free and open source platform that collects, curates, verifies, and preserves visual documentation of human rights violations in Syria. The platform not only informs the public of conflict developments as they arise, but also provides an evidence base for use in future investigations.","description":"Individuals and organisations working on human rights need to find and use verified visual evidence in order to accurately report about what’s happening in conflict zones. In the case of Syria, there are more hours of online footage online than there have been hours of conflict.\r\n\r\nHidden in that footage are untold stories, human rights violations, and perhaps even evidence of war crimes. There is currently no tool or platform that supports the collecting, verifying, and collaboratively curating of visual evidence from social media platforms: The Syrian Archive is be the first to do so.","links":[]},{"id":7289,"image":null,"full_public_name":"Hadi Al-Khatib","abstract":"","description":"","links":[]}]},{"id":8336,"guid":"3f76be27-6ff5-4a23-a6c6-512eaff00f28","title":"Talking Behind Your Back","logo":"/system/events/logos/000/008/336/large/dog.jpg?1475273918","type":"lecture","do_not_record":false,"start_time":"2016-12-29T17:15:00.000+01:00","end_time":"2016-12-29T18:15:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"In the last two years, the marketing industry started to show a fast increasing interest in technologies for user cross-device tracking, proximity tracking, and their derivative monetization schemes. To meet these demands, a new ultrasound-based technology has recently emerged and is already utilized in a number of different real-world applications. Ultrasound tracking comes with a number of desirable features (e.g., easy to deploy, inaudible to humans), but alarmingly until now no comprehensive security analysis of the technology has been conducted. In this talk, we will publish the results of our security analysis of the ultrasound tracking ecosystem, and demonstrate the practical security and privacy risks that arise with its adoption. Subsequently, we will introduce some immediately deployable defense mechanisms for practitioners, researchers, and everyday users. Finally, we will initiate the discussion for the standardization of ultrasound beacons, and outline our proposed OS-level API that enables both secure and effortless deployment for ultrasound-enabled applications.","speakers":[{"id":6896,"image":null,"full_public_name":"Vasilios Mavroudis","abstract":"Vasilios Mavroudis is a doctoral researcher in the Information Security Group at the University College London, working with George Danezis. He enjoys doing practically applicable research on the intersection of systems security, anonymity and privacy. Recent work has focused on \"secure computations on untrusted hardware\", and \"privacy-preserving computations as a service\". In the past, he has worked on various projects including building systems to study evasive web-malware, and to detect attacks against telecommunication networks. He also maintains a number of side-projects, aiming to shed light on the security of often overlooked ecosystems.","description":"","links":[]},{"id":7225,"image":null,"full_public_name":"Federico Maggi","abstract":"I am a Senior Threat Researcher with Trend Micro’s Forward-Looking Threat Research (FTR) team, an elite team of researchers whose mission is to fighting against cyber criminals and scouting the future of emerging technologies, striving to predict and prevent emerging security risks and threats.\r\n\r\nMy research interests, mainly developed during my MSc and PhD, revolve around various topics under the “cyber security” and “cyber crime” umbrella terms, including threat analysis, malware analysis, mobile security, financial fraud analysis and detection, web- and social-network security and data analysis.\r\n\r\nBefore joining Trend Micro, I was an Assistant Professor at Dipartimento di Elettronica, Informazione e Bioingegneria (DEIB), Politecnico di Milano in Italy, where I co-directed the system-security group at the NECST Laboratory.\r\n\r\nIn my career, I collaborate(d) with several research groups (e.g., UCSB, FORTH, NEU, Stony Brook, KU Leven, and RHUL), and I have given several lectures and talks as an invited speaker at international venues and research schools. I also serve in the review or organizing committees of well-known conferences.","description":"","links":[{"url":"http://maggi.cc","title":"Home Page"}]}]},{"id":8069,"guid":"ff044b6a-d567-4309-b9a8-ec9384b16a27","title":"Tapping into the core","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T13:00:00.000+01:00","end_time":"2016-12-28T13:30:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"Engaging universally available deep debug functionality of modern\r\nIntel cores, with zero software or hardware modifications\r\nrequired on the target side.","speakers":[{"id":6957,"image":null,"full_public_name":"Maxim Goryachy","abstract":"","description":"","links":[]},{"id":7256,"image":"/system/people/avatars/000/007/256/large/GetPersonaPhoto.jpg?1481744072","full_public_name":"Mark Ermolov","abstract":"I'am a system programmer that is intrested in security aspects of hardware, firmware, and low-level system sofware (bare-metal hypervisors, OSes cores, device drivers). I'am working in company Positive Technologies in Moscow at mentioned position.","description":"I've had talks at russian security conferences PHDays and ZeroNigths. One of the my previouse researches was about internal structure of Microsoft PathGuard and ways to compromise it. Another my most recent reserach was about how to disable Intel Management Engine. My professional intrestings also include virtualization technologies, low level GPU programming, reverse engineering of firmwares and device drivers. With Maxim Goryachy I have prepared to talk about Intel DCI - most recent and intriguing technology to organize low cost hardware JTAG debuging of latest Intel processors.","links":[{"url":"https://github.com/ptresearch/me-disablement","title":"My research: How to become the sole owner of your PC"}]}]},{"id":8097,"guid":"c19012c9-71de-4272-a6f4-898f5c48b8d9","title":"Technologien für und wider Digitale Souveränität","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-29T17:15:00.000+01:00","end_time":"2016-12-29T18:15:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"''Technologien für und wider Digitale Souveränität''\r\n\r\nDie weltweite Vernetzung ist die tiefgreifendste Veränderung seit der\r\nindustriellen Revolution.  In einer Zeit der maßlose Massenüberwachung scheint die Digitale Souveränität den Einsatz privatsphärenfreundlicher Technologien als ein unverzichtbarer Bestandteil von gesellschaftlichen Lösungsversuchen zwingend zu erfordern.\r\n\r\nIn unserem Beitrag möchten wir hackerrelvante Teilaspekte und Verfahren aus einer Studie für das Bundesministerium für Justiz und Verbraucherschutz vorstellen. Unter anderem sind hier kryptographische Protokolle (z. B.  Blinde Signaturen, Zero-Knowlege Protokolle) und Methoden zur statistischen Auswertung von vertraulichen Daten  (z.B. K-Anonymität, Differentielle Vertraulichkeit) zu nennen.\r\n","speakers":[{"id":1545,"image":"/system/people/avatars/000/001/545/large/RuediWeis200300.jpg?1379017202","full_public_name":"ruedi","abstract":"","description":"","links":[]},{"id":5580,"image":null,"full_public_name":"vgrass","abstract":"","description":"","links":[{"url":"http://vgrass.de","title":"vgrass.de"}]},{"id":7263,"image":null,"full_public_name":"Prof. Stefan Lucks","abstract":"","description":"","links":[]}]},{"id":8191,"guid":"34ea8f1f-9fad-41aa-8424-e833f10e5e8b","title":"The 12 Networking Truths","logo":"/system/events/logos/000/008/191/large/talk.jpg?1475247464","type":"lecture","do_not_record":false,"start_time":"2016-12-29T22:45:00.000+01:00","end_time":"2016-12-29T23:15:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"In *The 12 Networking Truths* Swedish artist Jonas Lund will discuss how he has attempted to subvert the contemporary art world system by using different types of exploits to gain an upper hand against the competition. \r\n\r\nFrom designing an algorithm for art production to data mining art world personalities, the artist will describe how he has incorporated a classic programming mindset in an otherwise logic-free environment. \r\n\r\nThe 12 Networking Truths refers to RFC 1925 - The Twelve Networking Truths, a memo posted on the 1st of April 1996, positioned as revealing the fundamental truths underlying all network protocol designs. The truths include statements such as ‘It Has To Work.’ and ‘Good, Fast, Cheap: Pick any two (you can’t have all three).’. This memo will be the underlying story line throughout the talk, as each truths has a corresponding position within the artist’s artistic practice. \r\n","speakers":[{"id":6889,"image":"/system/people/avatars/000/006/889/large/jonaslund_content-aware-500.jpg?1475247551","full_public_name":"Jonas Lund","abstract":"Swedish contemporary artist","description":"Jonas Lund is a Swedish artist that creates paintings, sculpture, photography, websites and performances that incorporate data from his studies of art world trends and behavior. He earned an MA at Piet Zwart Institute, Rotterdam (2013) and a BFA at Gerrit Rietveld Academy, Amsterdam (2009). He has had solo exhibitions at Steve Turner, Los Angeles (2015, 2014); Boetzelaer|Nispen, Amsterdam (2014); Showroom MAMA, Rotterdam (2013); and has had work included in numerous group exhibitions including at Eyebeam, New York; New Museum, New York, XPO Gallery, Paris; Van Abbemuseum, Eindhoven, Witte De With, Rotterdam, De Hallen, Haarlem and the Moving Museum, Istanbul. His work has been written about in Artforum, Artslant, Rhizome, Huffington Post, Furtherfield and Wired.","links":[{"url":"http://jonaslund.biz","title":"Artist website"}]}]},{"id":8419,"guid":"5f0ab68a-8e2d-481e-b009-55a1af58760c","title":"The Clash of Digitalizations","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T12:15:00.000+01:00","end_time":"2016-12-28T12:45:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"This talk discusses the representation of Arab males in video games and the adverse effect it has on the collective political imagination. Anonymous military-aged Arab men become increasingly the exception to the laws of human rights, and become default targets for conventional and unmanned drone attacks. This devolution is seen through the lens of the changing nature of conflict through digitalization, the collapse of the nation state in Iraq and Syria, and the future of war. ","speakers":[{"id":6169,"image":null,"full_public_name":"Saud Al-Zaid","abstract":"","description":"","links":[]}]},{"id":7821,"guid":"61f9d4c6-a3de-4958-a57c-efcf941668fa","title":"The DROWN Attack","logo":"/system/events/logos/000/007/821/large/DROWN_logo.png?1472827263","type":"lecture","do_not_record":false,"start_time":"2016-12-27T14:00:00.000+01:00","end_time":"2016-12-27T15:00:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"We present DROWN, a novel cross-protocol attack on TLS that uses a server supporting SSLv2 as an oracle to decrypt modern TLS connections. Using Internet-wide scans, we find that 33% of all HTTPS servers are vulnerable to this protocol-level attack.","speakers":[{"id":3205,"image":"/system/people/avatars/000/003/205/large/person-3349-128x128.png?1405692760","full_public_name":"Sebastian Schinzel","abstract":"Sebastian is a professor for IT security at Münster University of Applied Sciences.","description":"Since 2013, Sebastian leads the IT Security Lab at Münster University of Applied Sciences. His research interests involve penetration testing, software security and side channel attacks.","links":[{"url":"http://sebastian-schinzel.de/","title":"Homepage"},{"url":"https://twitter.com/seecurity","title":"Twitter"}]}]},{"id":8170,"guid":"9039efe4-3282-47d2-a0b5-630843e23304","title":"The Economic Consequences of Internet Censorship","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-30T11:30:00.000+01:00","end_time":"2016-12-30T12:00:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Internet censorship today is widespread, both by governments and by private entities. Much of the discussion so far has focused on political and social effects of this censorship. However, censorship also has a clear effect on the economic structure of society that has not been explored.","speakers":[{"id":6990,"image":null,"full_public_name":"Toni","abstract":"PhD Student passionate about data, economics, game theory and China. ","description":"","links":[]}]},{"id":8295,"guid":"1275f046-e52e-4b0b-9f5b-7eb2008b2ec4","title":"The Fight for Encryption in 2016","logo":"/system/events/logos/000/008/295/large/EncryptionLogo.png?1479417484","type":"lecture","do_not_record":false,"start_time":"2016-12-27T12:45:00.000+01:00","end_time":"2016-12-27T13:45:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Both strong end-to-end communications encryption and device encryption are legal in most jurisdictions today, and remain widely available. Yet software programmers and hardware producers are increasingly under pressure from law enforcement and policy makers around the world to include so-called backdoors in encryption products.","speakers":[{"id":4020,"image":"/system/people/avatars/000/004/020/large/KOHeadshotCloseup.jpg?1479416923","full_public_name":"Kurt Opsahl","abstract":"Kurt Opsahl is the Deputy General Counsel at the Electronic Frontier Foundation (EFF), a civil society organization that fights for civil liberties in the digital age.","description":"In addition to representing clients on civil liberties, free speech and privacy law, Opsahl counsels on EFF projects and initiatives. He is the lead attorney on the Coders’ Rights Project. Before joining EFF, Opsahl worked at Perkins Coie, where he represented technology clients with respect to intellectual property, privacy, defamation, and other online liability matters, including working on Kelly v. Arribasoft, MGM v. Grokster and CoStar v. LoopNet. For his work responding to government subpoenas, Opsahl is proud to have been called a „rabid dog“ by the Department of Justice. Prior to Perkins, Opsahl was a research fellow to Professor Pamela Samuelson at the U.C. Berkeley School of Information Management \u0026 Systems. Opsahl received his law degree from Boalt Hall, and undergraduate degree from U.C. Santa Cruz. He co-authored „Electronic Media and Privacy Law Handbook“. In 2007, Opsahl was named as one of the „Attorneys of the Year“ by California Lawyer magazine for his work on the O’Grady v. Superior Court appeal. In 2014, he was elected to the USENIX Board of Directors and became an affiliate of the Berkman Center for Internet \u0026 Society at Harvard University.","links":[{"url":"https://www.eff.org/about/staff/kurt-opsahl","title":"EFF Staff Bio"}]}]},{"id":8425,"guid":"87092ad2-d3fd-4a37-bb58-1fe71217a06b","title":"The Global Assassination Grid","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T11:30:00.000+01:00","end_time":"2016-12-27T12:30:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"As they say in the Air Force, ‚No comms no bombs‘,  – A technician’s insight into the invisible networks governing military drones and the quest for accountability","speakers":[{"id":7193,"image":null,"full_public_name":"Cian Westmoreland","abstract":"In 2009, Cian Westmoreland was one of the US Air Force communications personnel who built a critical component of the global communications infrastructure underlying the drone program in Afghanistan through the 73rd Expeditionary Air Control Squadron.","description":"It’s area of responsibility covered 621,000 square kms over Afghanistan, and assists in networking disparate ground and air assets across coalition forces and service branches, in addition to drones. It helps connect the battlefield to the Combined Air Operations Center in Al Udeid, Qatar and Ramstein, Germany. At the end of his tour he received a document stating that he assisted in 200+ enemy kills, while the United Nations Assistance Mission in Afghanistan reports 359 civilians killed that year.\r\n\r\nCian began speaking openly about his role in November of 2015, along with three other former servicemen to the Guardian and DemocracyNow.","links":[]}]},{"id":8324,"guid":"97570300-6590-45c9-a477-ab629f92a3b1","title":"The High Priests of the Digital Age","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-30T12:15:00.000+01:00","end_time":"2016-12-30T12:45:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"The High Priests of the Digital Age Are Working Behind Your Back to Make You Confess, and Repent.","speakers":[{"id":7057,"image":null,"full_public_name":"catchthewhistle","abstract":"I am a researcher at Columbia University and Sciences Po Paris in political philosophy.","description":"I am an expert of the Snowden case and digital surveillance. This will be my first talk on masturbation.","links":[{"url":"https://twitter.com/catchthewhistle","title":"Twitter"}]}]},{"id":8406,"guid":"f1e2dc22-8925-4a8a-8cd3-4d03aa0e33b7","title":"The Moon and European Space Exploration","logo":"/system/events/logos/000/008/406/large/moon.jpeg?1478093272","type":"lecture","do_not_record":false,"start_time":"2016-12-29T20:30:00.000+01:00","end_time":"2016-12-29T21:00:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Since the early successes of moon missions in the Sixtie, mankind has moved on to the earth orbit and other deep space missions. But interest in the moon as a target has intensified recently as the strategies for future missions are evolving.","speakers":[{"id":7168,"image":"/system/people/avatars/000/007/168/large/jan-woerner.jpg?1478018928","full_public_name":"Jan Wörner","abstract":"Jan Wörner is the Director General of the European Space Agency (ESA) and former chairman of the executive board of the German Aerospace Center (DLR)","description":"","links":[]}]},{"id":7925,"guid":"f62fb3be-656f-4e7b-9619-11f3cdb2da26","title":"The Nibbletronic","logo":"/system/events/logos/000/007/925/large/nibbletronic.JPG?1473939697","type":"lecture","do_not_record":false,"start_time":"2016-12-27T16:00:00.000+01:00","end_time":"2016-12-27T16:30:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"The NibbleTronic is a MIDI wind controller that features a novel user interface resulting in a unique tonal range. The standard configuration allows to precisely play a bit more than four full octaves including semitones with only one hand. ","speakers":[{"id":6792,"image":null,"full_public_name":"ctrapp","abstract":"Mechanical engineer and software developer from Leipzig. Occasionally musician, doing improvised live performances of electronic music with his brother. Loves to work with artists .","description":"","links":[{"url":"http://www.schlimme-gegend.de/","title":"My projects/ stories/ blog"}]}]},{"id":8064,"guid":"fc56c971-c65e-43ca-a92c-d98c7fb47bd6","title":"The Transhumanist Paradox","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-30T13:45:00.000+01:00","end_time":"2016-12-30T14:15:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"How does a pluralist society – a society built to accommodate our irreconcilable differences – make a choice about the technological future of mankind? How can a liberal state dedicated to upholding individual liberty interfere in technological progress, and why should it? ","speakers":[{"id":6924,"image":null,"full_public_name":"Xavier Flory","abstract":"I'm a political theorist at Sciences Po currently researching the relationship between transhumanism (the Singularity in particular) and political liberalism. ","description":"","links":[]}]},{"id":8029,"guid":"1c75e6a1-e586-4b91-abce-92a4561d0181","title":"The Ultimate Game Boy Talk","logo":"/system/events/logos/000/008/029/large/Screen_Shot_2016-09-29_at_7.31.41_AM.png?1475159522","type":"lecture","do_not_record":false,"start_time":"2016-12-30T16:00:00.000+01:00","end_time":"2016-12-30T17:00:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"The 8-bit Game Boy was sold between 1989 and 2003, but its architecture more closely resembles machines from the early 1980s, like the Commodore 64 or the NES. This talk attempts to communicate \"everything about the Game Boy\" to the listener, including its internals and quirks, as well as the tricks that have been used by games and modern demos, reviving once more the spirit of times when programmers counted clock cycles and hardware limitations were seen as a challenge.","speakers":[{"id":1643,"image":"/system/people/avatars/000/001/643/large/283.png?1360200572","full_public_name":"Michael Steil","abstract":"By day, Michael Steil works on operating system technologies. By night, he hacks obsolete systems. In a previous life, he used to hack gaming consoles.","description":"By day, Michael Steil works on operating system technologies. By night, he hacks obsolete systems. In a previous life, he used to hack gaming consoles.","links":[{"url":"http://www.pagetable.com","title":"www.pagetable.com - some assembly required"}]}]},{"id":7861,"guid":"61677c86-8d83-4c30-9cf4-f7741e1a8798","title":"The Universe Is, Like, Seriously Huge","logo":"/system/events/logos/000/007/861/large/HUDF.jpg?1473189037","type":"lecture","do_not_record":false,"start_time":"2016-12-29T23:30:00.000+01:00","end_time":"2016-12-30T00:00:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Astronomers struggle to accurately measure distances in the vastness of the known universe. Get an insight into the sophisticated techniques and dirty tricks of today's astrophysics and cosmology. No physics background required, featuring lots of pretty space pictures.","speakers":[{"id":4920,"image":"/system/people/avatars/000/004/920/large/twitterme.jpg?1410024157","full_public_name":"Michael Büker","abstract":"With Congress since 28C3. Currently living in Dresden. Linux, languages and Internet geek. Diploma in physics with specialization in astroparticle physics and peace research. Working in science communication and science journalism, sometimes seen on stage or behind the scenes where science goes entertainment.","description":"","links":[{"url":"https://twitter.com/emtiu","title":"@emtiu on Twitter"}]}]},{"id":8416,"guid":"1b27dbeb-cffc-48a1-b2e6-b2011c338a50","title":"The Untold Story of Edward Snowden’s Escape from Hong Kong","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T18:30:00.000+01:00","end_time":"2016-12-28T19:30:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"On June 9, 2013, Edward Snowden revealed massive civil rights abuses by the NSA. On June 10, Snowden didn’t know where to hide.","speakers":[{"id":7222,"image":"/system/people/avatars/000/007/222/large/Lena_Rohrbach.jpg?1482231381","full_public_name":"Lena Rohrbach","abstract":"Lena is Amnesty International Germany’s expert on human rights in the digital age and a moral philosopher by training. She works on privacy and free speech issues.","description":"This year, she co-organized a constitutional complaint against German surveillance law, a theatre play on mass surveillance, and a „letter writing marathon“ for the Pardon Snowden Campaign.","links":[]},{"id":7258,"image":"/system/people/avatars/000/007/258/large/S%C3%B6nke_Iwersen.jpg?1482231323","full_public_name":"Sönke Iwersen","abstract":"Sönke is head of the investigative research unit at Handelsblatt, the Germany Financial Daily. He specializes in uncovering corruption, fraud and gross mismanagement.","description":"Iwersen has won many journalism awards, including the Henri Nannen Preis and two Wächterpreise.","links":[{"url":"https://handelsblatt-recherche.com/","title":"https://handelsblatt-recherche.com/"}]},{"id":7259,"image":"/system/people/avatars/000/007/259/large/Robert_Tibbo.JPG?1482231349","full_public_name":"Robert Tibbo","abstract":"Robert is a human rights lawyer in Hong Kong.","description":"With more than 12,000 refugees living in miserable conditions in the world’s richest city, there is plenty to do for him. However, nothing could have prepared Robert for the stress that came with representing the Most Wanted Man Alive. Having succeeded in keeping Snowden alive, he is still in touch with him today.","links":[]}]},{"id":8233,"guid":"d851c029-9f83-41af-befd-a54209453d41","title":"The woman behind your WiFi","logo":"/system/events/logos/000/008/233/large/Secret_Communication_System.jpg?1475258124","type":"lecture","do_not_record":false,"start_time":"2016-12-29T20:30:00.000+01:00","end_time":"2016-12-29T21:00:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"Used in cell phone technology, bluetooth devices, and WiFi, Frequency Hopping Spread Spectrum (FHSS) is often said to have been invented in the early 1940s by none other than Hollywood actress and sex symbol Hedy Lamarr. This talk will present the undeniably entertaining history of a well-known actress moonlighting as a military inventor as well as give an overview of the 100-year-old history of frequency hopping and its past and present uses.","speakers":[{"id":4221,"image":null,"full_public_name":"Anja Drephal","abstract":"Studied History, Japanese and American Studies at FU Berlin, Waseda University Tokyo, KFU Graz. Currently learning about 0s and 1s at HU Berlin. \r\nInterested in 20th Century History, Japanese and American Studies, Intelligence and Espionage, Pandas and Star Wars.\r\n","description":"","links":[]}]},{"id":8330,"guid":"725b4ff6-8d4c-4d8f-9e38-6b1e49e1602c","title":"The Zcash anonymous cryptocurrency","logo":"/system/events/logos/000/008/330/large/zcash.png?1479469683","type":"lecture","do_not_record":false,"start_time":"2016-12-29T23:30:00.000+01:00","end_time":"2016-12-30T00:00:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"Zcash is the third iteration of an extension to the Bitcoin protocol that provides true untraceability, i.e. fully anonymous transactions. It is arguably the first serious attempt to establish this extension, in the form of its own blockchain, beyond the form of an academic proposal. The talk provides an introduction to the magic that makes it work.","speakers":[{"id":1758,"image":"/system/people/avatars/000/001/758/large/377.jpg?1360200609","full_public_name":"pesco","abstract":"A coder by passion, a mathematician by training, lately an applied scientist of insecurity by profession. Cryptographer by night. Closet cypherpunk.","description":"When I'm not playing video games or haunting karaoke bars, I spend my time on programming projects. I used to do a lot of Haskell but recently my life has turned into a downward spiral of functional programming in C. Yes, you read that right. I swear it's not as weird as it... yeah okay, it's weird.\r\n\r\nI spent a good chunk of my lifetime enrolled as a student of mathematics. My thesis was about the particulars of one particular set of quantum-computer-resistant cryptographic algorithms (Lyubashevsky's identification scheme, if you must know). I finally managed to finish and am now employed at TUHH (\"Hamburg University of Technology!\") for a doctorate in IT security. I do SCADA-related parsing things there and call it LangSec.\r\n\r\nMy biggest claims to fame are probably my substantial contributions to the Hammer parser combinator library and the undisputed king of secure instant messaging, the bitlbee OTR plugin.","links":[{"url":"http://smhallberg.de/","title":"\"Professional\" CV"},{"url":"http://smhallberg.de/portfolio.en.html","title":"Some previous projects and talks"},{"url":"http://khjk.org/","title":"Blog"}]}]},{"id":8287,"guid":"9d6db804-1074-4116-8210-cca78b335a1a","title":"Understanding the Snooper’s Charter","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-30T14:30:00.000+01:00","end_time":"2016-12-30T15:00:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"The ‚Investigative Powers Bill‘ is about to become law in the UK. Its provisions, from looking up Internet connection records without a warrant to forcing communication service providers to assist with interception and decryption of data, have caused an outcry in the Western world. But how and why did British politics get here? And, most importantly of all: How could we fight back?","speakers":[{"id":6857,"image":"/system/people/avatars/000/006/857/large/11206004_10153307150708633_4377356733442055587_n_2.jpg?1475268950","full_public_name":"Hendrik Obelöer","abstract":"I’m fascinated by the interplay of technology and society. Motivated by my interest to understand larger trends and powers in our society, I chose to study European Social and Political Studies at UCL in London.","description":"Just starting to realise the ubiquitous nature of British surveillance, the Snowden revelations had a strong impression on me. Subsequently, I followed closely and was very happy about the opportunity to do an internship at netzpolitik.org during this summer. Besides finishing my Bachelor’s degree, I report about current developments in British civil rights issues.\r\n\r\nI grew up in Lübeck and during my time in High School I participated in and chaired at several international student conferences. Not only did this create an interest in international politics, but also made me want to engage in shaping future discussions. Studying in London and Rome gave me the opportunity to understand different takes on civil liberties and duties – and it also reinforced my view that we need to take an active stand to defend them.\r\n\r\nStriving to understand problems at their fundamental level and on a large scale, I am still convinced that change can also happen on a small scale. I did this for example as an elected student representative in School and University. Likewise, I took an active stand on many political topics and tried to advocate for a more just, free and inclusive society. At some point I wanted to discuss these views and be likewise challenged on them. That is why I started writing for Eureka, a student magazine about European issues, and later even lead it magazine as editor.","links":[]}]},{"id":8014,"guid":"c3844820-b5ed-4b12-9094-cfc67aff60be","title":"Untrusting the CPU","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T18:15:00.000+01:00","end_time":"2016-12-27T19:15:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"It is a sad fact of reality that we can no longer trust our CPUs to only run the things we want and to not have exploitable flaws. I will provide an proposal for a system to restore (some) trust in communication secrecy and system security even in this day and age without compromising too much the benefits in usability and speed modern systems provide.","speakers":[{"id":6903,"image":"/system/people/avatars/000/006/903/large/pegasus.png?1474964414","full_public_name":"jaseg","abstract":"I'm from Berlin, doing mostly embedded electronics and low-level firmware foo. I'm currently employed at srlabs.","description":"","links":[]}]},{"id":8142,"guid":"14590762-b249-463b-9617-46d0f0d3f5b3","title":"Virtual Secure Boot","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-30T16:00:00.000+01:00","end_time":"2016-12-30T17:00:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"Over the last two years secure boot support for virtual machines was added to qemu, kvm (linux kernel) and ovmf (edk2/tianocore).  This talk covers the implementation details and the issues we had to deal with along the way.","speakers":[{"id":6861,"image":null,"full_public_name":"Gerd Hoffmann","abstract":"Gerd is working on virtualization for about ten years.  He maintains\r\ngraphics and usb emulation in the qemu project.  He is also involved\r\nin firmware development for qemu (seabios, coreboot, edk2) and in\r\nlinux guest drivers support.","description":"","links":[{"url":"https://www.kraxel.org/blog/","title":"blog"}]}]},{"id":8094,"guid":"b9ca38ea-fa88-48c4-8083-9415eee93fcb","title":"Visiting The Bear Den","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T23:00:00.000+01:00","end_time":"2016-12-28T00:00:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"Sednit, a.k.a Fancy Bear/APT28/Sofacy, is a group of attackers\r\noperating since at least 2004 and whose main objective is to steal\r\nconfidential information from specific targets. Over the past two years,\r\nthis group's activity increased significantly, in particular with numerous attacks against foreign affairs ministries and embassies all over the world. They are supposedly behind the DNC hack, and the WADA hack, which happened earlier this year. This talk presents the results of a two-year hunt after Sednit, during which we dug up and analyzed many of their software.\r\n\r\n","speakers":[{"id":6942,"image":null,"full_public_name":"Jessy Campos","abstract":"Jessy Campos is a Malware Researcher in ESET’s Security Research Laboratory. He spoke at technical conferences such as REcon. Enjoying reverse-engineering malware, he works on tracking and monitoring groups performing targeted attacks since his beginnings in the team.","description":"","links":[]}]},{"id":8280,"guid":"7deb971d-1768-4a56-93ed-fe0192a13025","title":"Von Alpakas, Hasenbären und Einhörnern – Über Anerkennungskultur","logo":"/system/events/logos/000/008/280/large/logo.png?1475267099","type":"lecture","do_not_record":false,"start_time":"2016-12-29T20:30:00.000+01:00","end_time":"2016-12-29T21:00:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"Wie würdigen verschiedene Tech-Communities das ehrenamtliche Engagement ihrer Mitglieder? Wie lassen sich gewünschte Lernprozesse verstärken? Was sind unsere Erfahrungen bei Jugend hackt? Und was haben Badges damit zu tun?","speakers":[{"id":5285,"image":"/system/people/avatars/000/005/285/large/maria_fiona_krakenbuerger_2014.jpg?1417823646","full_public_name":"Maria Reimer","abstract":"Maria works for the Open Knowledge Foundation Germany and is the project lead of Jugend hackt, a Germany based fostering program for young coders. ","description":"","links":[{"url":"http://www.jugendhackt.de","title":"Jugend hackt"},{"url":"http://www.okfn.de","title":"Open Knowledge Foundation Germany"}]},{"id":7232,"image":"/system/people/avatars/000/007/232/large/danielseitz-cc-by-bpb.png?1480434785","full_public_name":"Daniel seitz","abstract":"Reisen, Medienpädagogik, @medialepfade, Mobiles Lernen, @jugendhackt, ePartizipation, openData, Games, Medienkunst, VJ Generation Gästeliste - PGP: BB5B9DF6","description":"","links":[{"url":"http://medialepfade.org","title":"mediale pfade"},{"url":"https://jugendhackt.org","title":"Jugend hackt"}]},{"id":7229,"image":"/system/people/avatars/000/007/229/large/paula-jugendhackt.png?1480336476","full_public_name":"Paula Glaser","abstract":"After her bachelor studies at the University of Applied Science in Offenburg, Paula Glaser worked for two years in e-commerce. In 2012 she decided to head in a new direction and started studying ‘Media in Education’ at the University of Pedagogies in Freiburg.","description":"During her studies she realized a scientific evaluation of ‘Jugend hackt 2014’ and started working for the ‘Open Knowledge Foundation Deutschland’ in February 2015, where she is organizing ‘Jugend hackt’ together with Maria Reimer.","links":[{"url":"http://www.jugendhackt.org","title":"Jugend hackt"}]},{"id":7230,"image":null,"full_public_name":"Robert Alisch","abstract":"","description":"","links":[]}]},{"id":8418,"guid":"69ce21df-4bf5-43ce-a500-ac7707ee64b7","title":"Von Kaffeeriechern, Abtrittanbietern und Fischbeinreißern","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T14:30:00.000+01:00","end_time":"2016-12-28T15:00:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"","speakers":[{"id":7187,"image":null,"full_public_name":"Michaela Vieser","abstract":"Michaela Viesers Texte und Kolumnen erschienen in der Financial Times Deutschland, Vanity Fair Deutschland, NZZ, Geo, Tagesspiegel, Welt am Sonntag. \r\n\r\nMichaela Vieser lebt und arbeitet in Berlin.\r\n\r\nIm Sommersemester 2010 war sie Dozentin für japanische Ästhetik an der FH Potsdam.\r\n\r\n","description":"Michaela Vieser driftet und pirscht in ihrer Arbeit immer wieder in unbekannte Gegenden vor: Ihr Buch „Übersehene Sehenswürdigkeiten. Deutsche Orte.“ wurde ausgewählt unter die 100 besten Produkte junger Deutscher, das japanische Bildungsministerium förderte sie mit einem eineinhalbjährigen Forschungsstipendium um über die Kunst der japanischen Bergasketen nachzudenken, gerade finanzierte die Bosch Stiftung ihr eine Reise ins Altai Gebirge auf der Suche nach einem Mythos, der die russische Weltraumindustrie beflügelte.\r\n\r\nLesungen mit Michaela Vieser fanden in der Vergangenheit statt bei der Bertelsmann Stiftung, im Museum für Arbeit in Hamburg, oder in der Volksbühne. Ihr letztes Buch über Liebesrituale wurde am Weltbuchtag vom Verband der Buchhändler dem Bundespräsidenten überreicht. Michaela Vieser ist bekannt für akribische Recherchearbeit und das Verknüpfen von scheinbar belanglosen Fakten zu einem größeren Bild, das, durch historische und soziologische Einblicke, neue Sichtweisen auf die heutige Lebenskultur ermöglicht.","links":[{"url":"http://michaelavieser.de/","title":"http://michaelavieser.de/"}]}]},{"id":8445,"guid":"2bdf3de1-417b-4a5a-b31e-4701a921fb5c","title":"Warum in die Ferne schweifen, wenn das Ausland liegt so nah?","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-30T14:30:00.000+01:00","end_time":"2016-12-30T15:30:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Der Vortrag stellt die in Deutschland zulässigen Überwachungsmaßnahmen des Internetverkehrs aus rechtlicher und operativer Sicht dar und versucht, die sich aus den Erkenntnissen des NSA-Untersuchungsausschusses ergebenden Fragen auf die gelebte Praxis anzuwenden.","speakers":[{"id":174,"image":"/system/people/avatars/000/000/174/large/690.jpg?1360200270","full_public_name":"Klaus Landefeld","abstract":"Vorstand des eco e. V. und Aufsichtsrat der DE-CIX International AG","description":"","links":[]}]},{"id":7860,"guid":"599ef527-fc3f-4474-8137-cf0e49cf118f","title":"Welcome to the Anthropocene?","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-28T13:00:00.000+01:00","end_time":"2016-12-28T13:30:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"The Anthropocene is widely understood to mean the current \u003cem\u003e\u0026quot;period of Earth's history during which humans have a decisive influence on the state, dynamics and future\u0026quot;\u003c/em\u003e of this planet. For several years, scientists in the \u003ca href=\"http://quaternary.stratigraphy.org/workinggroups/anthropocene/\" title=\"Website of the Working Group on the \u0026#39;Anthropocene\u0026#39; (AWG)\"\u003eWorking Group on the 'Anthropocene' (AWG)\u003c/a\u003e have \u003ca href=\"https://www2.le.ac.uk/offices/press/press-releases/2016/august/media-note-anthropocene-working-group-awg\" title=\"Media note on AWG recommendations\"\u003eworked (and voted!)\u003c/a\u003e on defining the beginning of the Anthropocene in geochemical terms. The mid-20\u003csup\u003eth\u003c/sup\u003e century provides an obvious geochemical 'timestamp': fallout from \u003ca href=\"https://media.ccc.de/v/31c3_-_6121_-_en_-_saal_2_-_201412291715_-_what_ever_happened_to_nuclear_weapons_-_michael_buker\" title=\"Michael Büker\u0026#39;s \u0026#39;What Ever Happened to Nuclear Weapons?\u0026#39; talk at 31c3\"\u003enuclear weapons detonations\u003c/a\u003e. Which other chemicals and timestamps are being considered for marking the Anthropocene's start? How is 'define-by-committee' even working out for \u003ca href=\"http://www.stratigraphy.org/index.php/ics-chart-timescale\" title=\"International Chronostratigraphic Chart AKA Geological Timescale\"\u003egeological epochs\u003c/a\u003e? This talk boils the scientific background of the Anthropocene debate down for non-stratigraphers.","speakers":[{"id":6574,"image":"/system/people/avatars/000/006/574/large/Ed_Flanagan_-_Forest_Light.jpg?1473060264","full_public_name":"KaLeiMai","abstract":"Studied biochemistry, Arctic ecology and geology in Konstanz and Tromsø. Drifted into tech support \u0026 lab automation. Interested in pharmaceutical data integrity, Git, R, and all other sciency and techy thingies. One half of the \u003ca href=\"http://konscience.de/\"\u003eKonScience podcast\u003c/a\u003e.","description":"","links":[{"url":"https://twitter.com/kaleimai/","title":"Twitter"},{"url":"http://www.konscience.de/archiv/","title":"KonScience-Podcast (lectures denoted \"KSL…\")"}]}]},{"id":8044,"guid":"1aa7a4c5-1a3f-444f-99fb-e9c7b4744794","title":"What could possibly go wrong with \u003cinsert x86 instruction here\u003e?","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T11:30:00.000+01:00","end_time":"2016-12-27T12:30:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Hardware is often considered as an abstract layer that behaves correctly, just executing instructions and outputting a result. However, the internal state of the hardware leaks information about the programs that are executing. In this talk, we focus on how to extract information from the execution of simple x86 instructions that do not require any privileges. Beyond classical cache-based side-channel attacks, we demonstrate how to perform cache attacks without a single memory access, as well as how to bypass kernel ASLR. This talk does not require any knowledge about assembly. We promise.","speakers":[{"id":5943,"image":"/system/people/avatars/000/005/943/large/tangerine.png?1482789670","full_public_name":"Clémentine Maurice","abstract":"Postdoctoral researcher at the Graz University of Technology, Austria.","description":"Clémentine Maurice is a researcher in infosec. She obtained her PhD from Telecom ParisTech in October 2015 while working at Technicolor in Rennes, jointly with the S3 group of Eurecom in Sophia Antipolis. She is now working as a postdoctoral researcher in the Secure Systems group at the Graz University of Technology, in Austria. Among other topics, she is interested in microarchitectural covert and side channels and reverse-engineering processor parts. She led the research on Rowhammer hardware fault attacks in JavaScript through a remote website, an attack also known as Rowhammer.js. She presented her work on several academic conferences, as well as BlackHat Europe and the CCC.","links":[{"url":"https://twitter.com/BloodyTangerine","title":"Twitter"},{"url":"https://cmaurice.fr/","title":"Website"}]},{"id":6937,"image":null,"full_public_name":"Moritz Lipp","abstract":"Moritz Lipp is a researcher in infosec at Graz University of Technology. He has received his master's degree on computer science with a strong focus on infosec in 2016. In the past he has been invited to teach in infosec courses on undergraduate and graduate level. His research has been published at top academic conferences like Usenix Security and been presented on blackhat Europe. In his current research, he focuses on side-channel attacks on mobile devices.","description":"","links":[{"url":"http://twitter.com/mlqxyz","title":"Twitter"}]}]},{"id":8033,"guid":"361946ca-4577-467d-b608-022c8a2d3164","title":"What's It Doing Now?","logo":"/system/events/logos/000/008/033/large/Screen_Shot_2016-09-28_at_11.29.27.png?1475055126","type":"lecture","do_not_record":false,"start_time":"2016-12-27T18:15:00.000+01:00","end_time":"2016-12-27T18:45:00.000+01:00","room":{"name":"Saal 1","id":379},"abstract":"Legend has it that most airline pilots will at one time have uttered the sentence \"What's it Doing now?\", whenever the autopilot or one of its related systems did something unexpected. I will be exploring some high-profile accidents in which wrong expectations of automation behaviour contributed to the outcome.","speakers":[{"id":6928,"image":"/system/people/avatars/000/006/928/large/Screen_Shot_2016-09-28_at_11.36.53.png?1475055439","full_public_name":"Bernd Sieker","abstract":"I am a systems engineer, computer scientist and aviation accident analyst; I specialise in root cause analysis, reverse-engineering and formal methods for safety-critical systems development and hold a private pilot's license.","description":"I have a German Diploma in computer science and a PhD in engineering (Dr.-Ing.), have held university lectures in computer networks and system safety and security for the last 7 years. I also work in a small engineering consulting company where I have done several analyses of aviation accidents, reverse-engineered system functions from publicly available user documentation and evaluated avionics systems and human-machine interaction, especially the role cockpit indications (or lack thereof) and of crew training in aviation accidents.\r\n\r\nI fly a small single-engine airplane for fun and sometimes for business trips.\r\n\r\nI also play the piano, keyboards, recorder and tin whistle.\r\n\r\nI am married and we have three children.","links":[]}]},{"id":8039,"guid":"56ec19c0-9844-46d6-b728-7a8217b8ed38","title":"What We Can Learn about Creativity from 3D Printing","logo":"/system/events/logos/000/008/039/large/Bildschirmfoto_2016-09-28_um_15.05.17.png?1475067941","type":"lecture","do_not_record":false,"start_time":"2016-12-29T22:00:00.000+01:00","end_time":"2016-12-29T22:30:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"For the past three years we studied the world’s largest 3D printing community “Thingiverse”. We explored the remix-relationships—accessible due the community’s use of open licenses—of more than 200.000 individual designs, tracked an entire week’s new designs for half a year, interviewed more than 80 creators and surveyed over 200 more. This allowed us to develop a deep understanding of the creative processes that take place on the platform.\r\nIn this talk we would like to present our findings. This is of interest to people who care about 3D printing as we can give sort of a behind the scenes view on how ideas come to life here. But it is also interesting to people that care about creativity in general. As what we have found has merit outside of 3D printing, too. In this talk we would like to cover the following: (1) Introduce our research setting and explain why it is useful to study this, (2) provide a consolidated overview on our most interesting findings, and (3) give real life examples for how these findings are transferable to other settings.\r\nWe have presented primary results of the studies at various academic conferences and have a comprehensive paper on the project currently under revision at the Journal of Information Technology (see attached file). We are a group of three university professors and a Ph.D. student. We work on the intersection of information systems, innovation management, product development, and creativity. We believe that many of the people we studied either attend 33C3 or watch talks online and we therefore think that our results would be of interest to this community. Further, we feel that a well structured talk is better and more entertaining than mailing around our academic journal publications to those who are interested. And lastly, we are eager to receive feedback from a more hands-on audience (than what we deal with at academic conferences). It would be especially useful for us to hear of new developments, discuss ideas for follow-up research projects, and get access to creators that would like to work with us in the future.","speakers":[{"id":6933,"image":"/system/people/avatars/000/006/933/large/Sascha.png?1475065939","full_public_name":"Sascha Friesike","abstract":"Professor at the University of Wuerzburg, researcher at the Alexander von Humboldt Institute for Internet and Society, soon moving to Amsterdam to become a professor the Vrije Universiteit. Research on creativity and innovation.","description":"Sascha Friesike is a professor for Management and Entrepreneurship at the University of Wuerzburg. He studied industrial engineering at the TU Berlin and holds a Ph.D. from the University of St.Gallen in Innovation and Technology Management. During his Ph.D. he was conducting research at Stanford. Currently, he is also active as a researcher at the Alexander von Humboldt Institute for Internet and Society in Berlin. In his research he focuses on the question “How do new things come to life?” In studying this he has looked at a variety of settings like communities, academia, NGOs, and private companies. In January 2017 Friesike will move to the Netherlands and become a professor at the Vrije Universiteit Amsterdam. He has published several books on creativity, research, and innovation besides a multitude of academic articles on these topics. ","links":[]}]},{"id":7949,"guid":"10b11771-c76f-44d5-9b65-9ebca428d8ff","title":"Wheel of Fortune","logo":"/system/events/logos/000/007/949/large/tarot_wheel_of_fortune.jpg?1479175448","type":"lecture","do_not_record":false,"start_time":"2016-12-28T13:45:00.000+01:00","end_time":"2016-12-28T14:15:00.000+01:00","room":{"name":"Saal 6","id":382},"abstract":"Secure random number generators play a crucial role in the wider security ecosystem. In the absence of a dedicated hardware True Random Number Generator (TRNG), computer systems have to resort to a software (cryptographically secure) Pseudo-Random Number Generator (CSPRNG). Since the (secure) design of a CSPRNG is an involved and complicated effort and since randomness is such a security-critical resource, many operating systems provide a CSPRNG as a core system service and many popular security software products assume their presence. The constraints imposed by the embedded world, however, pose a variety of unique challenges to proper OS (CS)PRNG design and implementation which have historically resulted in security failures. In this talk we will discuss these challenges, how they affect the quality of (CS)PRNGs in embedded operating systems and illustrate our arguments by means of the first public analysis of the OS random number generators of several popular embedded operating systems.","speakers":[{"id":6657,"image":null,"full_public_name":"Jos Wetzels","abstract":"Jos Wetzels is a Research Assistant with the Distributed and Embedded System Security (DIES) Group at the University of Twente. He currently works on projects aimed at hardening embedded systems used in critical infrastructure (as part of the PREEMPTIVE European Union project (FP7)), where he focuses on binary security in general and exploit development and mitigations in particular, and has been involved in the AVATAR research project regarding on-the-fly detection and containment of unknown malware and Advanced Persistent Threats. He has assisted teaching hands-on offensive security classes for graduate students at the Dutch Kerckhoffs Institute for several years.","description":"","links":[{"url":"http://samvartaka.github.io","title":"Homepage"}]},{"id":6699,"image":"/system/people/avatars/000/006/699/large/0kNLxdCK.jpg?1481708647","full_public_name":"Ali Abbasi","abstract":"Ali Abbasi is a Ph.D. candidate in Distributed and Embedded System Security group at the University of Twente, The Netherlands and visiting Ph.D. researcher at the Chair of Systems Security of Ruhr-University Bochum, Germany. His research interest involves embedded systems security mostly related to Industrial Control Systems, Critical Infrastructure security, and Real-Time Operating Systems security. He received his master degree in Computer Science from Tsinghua University, Beijing, China in 2013. He was working there on Programmable Logic Controller (PLC) security in Network Security Lab, Microprocessor and SoC Technology R\u0026D center with the National 863 High-tech Program grant from Ministry of Industry and Information Technology of China. He is currently doing his research at the Chair of Systems Security of Ruhr-University Bochum regarding designing system-level protection mechanisms to battle against the sophisticated memory corruption and code-reuse attacks against PLCs and other critical real-time embedded systems. Before that Ali was working as Head of Vulnerability Analysis and Penetration Testing Group at National Computer Security Incident Response Team (CSIRT) at the Sharif University of Technology in Tehran, Iran.","description":"","links":[{"url":"http://wwwhome.cs.utwente.nl/~abbasia/","title":"Homepage"}]}]},{"id":7964,"guid":"530f0400-e4e8-4d99-909d-4cfc8121c0b0","title":"Where in the World Is Carmen Sandiego?","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T21:45:00.000+01:00","end_time":"2016-12-27T22:45:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Travel booking systems are among the oldest global IT infrastructures, and have changed surprisingly little since the 80s. The personal information contained in these systems is hence not well secured by today's standards. This talk shows real-world hacking risks from tracking travelers to stealing flights. ","speakers":[{"id":1741,"image":"/system/people/avatars/000/001/741/large/1317.png?1360200605","full_public_name":"Karsten Nohl","abstract":"Karsten Nohl is a cryptographer and security researcher. He likes to test security assumptions in proprietary systems and typically breaks them.","description":"","links":[]},{"id":7238,"image":null,"full_public_name":"Nemanja Nikodijevic","abstract":"","description":"","links":[]}]},{"id":8143,"guid":"fd205d0d-d767-4ff6-9771-9f2d4c933fe7","title":"Woolim – Lifting the Fog on DPRK’s Latest Tablet PC","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T23:00:00.000+01:00","end_time":"2016-12-28T00:00:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Last year we have been talking about DPRK’s operating system Red Star OS and its surveillance features. We have identified a watermarking mechanism and gave an insight on the internals of the operating system itself. This year we will be talking about one of DPRK’s Tablet PCs, called Woolim.","speakers":[{"id":3993,"image":null,"full_public_name":"Florian Grunow","abstract":"Florian works as a Security Analyst at ERNW in Heidelberg. He leads a team that is performing security assessments.","description":"Florian holds a Bachelor’s degree in Medical Computer Sciences and a Master’s degree in Software Engineering. He works as a Security Analyst and team lead at ERNW, performing application and infrastructure assessments. His research focus is the security of medical devices. He is a member of CCC Mannheim e. V.","links":[]},{"id":6354,"image":null,"full_public_name":"Niklaus Schiess","abstract":"Niklaus is working as a Security Analyst for ERNW GmbH based in Heidelberg, Germany. Application and network security are the main focus of his work but he also enjoys writing code and occasionally participates in CTFs.","description":"","links":[]},{"id":7227,"image":null,"full_public_name":"Manuel Lubetzki","abstract":"Manuel has worked as a security researcher at ERNW mainly focusing on web application security.","description":"He is specifically interested in reverse engineering, wireless security and artificial intelligence. Currently he’s studying at the university of Tübingen.","links":[]}]},{"id":8061,"guid":"ac80424a-f4dc-431d-95f3-3f85664ba2dc","title":"You can -j REJECT but you can not hide: Global scanning of the IPv6 Internet","logo":null,"type":"lecture","do_not_record":false,"start_time":"2016-12-27T23:00:00.000+01:00","end_time":"2016-12-28T00:00:00.000+01:00","room":{"name":"Saal 2","id":380},"abstract":"In this talk we will explore and present various IPv6 scanning techniques that allow attackers to peek into IPv6 networks. With the already known difference between IPv4 and IPv6 firewalling (the latter is worse... ) we then demonstrate how these techniques can be combined and used to obtain a large-scale view on the state of IPv6 in infrastructures and data centers. To give the whole issue a somewhat more fun dimension, we will also look at some (security) sensitive applications of this technique. Complimentary code-snippets will be provided.","speakers":[{"id":6948,"image":"/system/people/avatars/000/006/948/large/08bb87640d344baa05ee747cf1688b93.jpeg?1479473159","full_public_name":"Tobias Fiebig","abstract":"BSc in Cognitive Science from University of Osnabrueck in 2012, MSc in System and Networkengineering from the University of Amsterdam in 2013, pursuing a PhD in $something_with_computers at TU Berlin since then. While I initially started with the security group of Prof. Seifert, my networking interests brought me into a dual-adviser-disorder situation, with Prof. Feldmann as my second adviser by now. I am currently working on measuring misconfiguration on the Internet, which basically boils down to telling people that there are no experts in OPS, and we do need usable and secure-by-default systems there, as well as for end users. While zMap used to be a fun tool to research misconfigurations, IPv6 is currently putting an end to this. Well... I am working on this,... In summary, following a statement from a collaborator of the first paper we published together: \"Where the hell do you always get these stupid ideas?!\"","description":"","links":[]}]},{"id":8262,"guid":"a0c851a1-b44e-46cb-bbb8-db966bc8639b","title":"Zwischen Technikbegeisterung und kritischer Reflexion: Chaos macht Schule","logo":"/system/events/logos/000/008/262/large/Cms_logo.jpg?1475263992","type":"lecture","do_not_record":false,"start_time":"2016-12-27T14:00:00.000+01:00","end_time":"2016-12-27T15:00:00.000+01:00","room":{"name":"Saal G","id":381},"abstract":"Die Lebenswelt von Kindern und Jugendlichen sowie die der Schulen könnte in Bezug auf die Digitalisierung kaum gegensätzlicher sein: Schülerinnen und Schüler leben und entfalten sich begeistert in der digitalen Welt, aber die Schule ist kaum in der Lage, Schülern ihre drängenden Fragen rund um die komplexe digitale Welt zu beantworten. In unserem Talk möchten wir anhand unserer Erfahrungen aus dem Projekt \"Chaos macht Schule\" u.a. diskutieren, wie man die heranwachsende Generation u. a. für Themen wie Datenschutz und Überwachung sensibilisieren und gleichzeitig Technikbegeisterung bei jungen Menschen fördern kann.","speakers":[{"id":6859,"image":null,"full_public_name":"benni","abstract":"","description":"","links":[]},{"id":4390,"image":null,"full_public_name":"Dorina","abstract":"FH Lübeck","description":"","links":[]}]}]}}